rogermc2/MB_Ada/src/p32mx470f512.h
/*-------------------------------------------------------------------------
 * PIC32MX470F512H processor header
 *
 * This software is developed by Microchip Technology Inc. and its
 * subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are 
 * met:
 * 
 * 1.      Redistributions of source code must retain the above copyright
 *         notice, this list of conditions and the following disclaimer.
 * 2.      Redistributions in binary form must reproduce the above 
 *         copyright notice, this list of conditions and the following 
 *         disclaimer in the documentation and/or other materials provided 
 *         with the distribution.
 * 3.      Microchip's name may not be used to endorse or promote products
 *         derived from this software without specific prior written 
 *         permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR PURPOSE ARE DISCLAIMED. IN NO EVENT 
 * SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR 
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
 * ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * 
 *-------------------------------------------------------------------------*/
//#ifndef __32MX470F512H_H
//#define __32MX470F512H_H

//#if defined (__LANGUAGE_C__) || defined (__LANGUAGE_C_PLUS_PLUS)

//#ifdef __cplusplus
//"C" {
//#endif

volatile unsigned int WDTCON;
typedef union {
  struct {
    unsigned WDTCLR:1;
    unsigned WDTWINEN:1;
    unsigned SWDTPS:5;
    unsigned :8;
    unsigned ON:1;
  };
  struct {
    unsigned :2;
    unsigned SWDTPS0:1;
    unsigned SWDTPS1:1;
    unsigned SWDTPS2:1;
    unsigned SWDTPS3:1;
    unsigned SWDTPS4:1;
  };
  struct {
    unsigned :2;
    unsigned WDTPSTA:5;
  };
  struct {
    unsigned :2;
    unsigned WDTPS:5;
  };
  struct {
    unsigned w:32;
  };
} __WDTCONbits_t;
volatile __WDTCONbits_t WDTCONbits __asm__ ("WDTCON");
volatile unsigned int        WDTCONCLR;
volatile unsigned int        WDTCONSET;
volatile unsigned int        WDTCONINV;
volatile unsigned int        RTCCON;
typedef union {
  struct {
    unsigned RTCOE:1;
    unsigned HALFSEC:1;
    unsigned RTCSYNC:1;
    unsigned RTCWREN:1;
    unsigned :2;
    unsigned RTCCLKON:1;
    unsigned RTSECSEL:1;
    unsigned :5;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned CAL:10;
  };
  struct {
    unsigned w:32;
  };
} __RTCCONbits_t;
volatile __RTCCONbits_t RTCCONbits __asm__ ("RTCCON");
volatile unsigned int        RTCCONCLR;
volatile unsigned int        RTCCONSET;
volatile unsigned int        RTCCONINV;
volatile unsigned int        RTCALRM;
typedef union {
  struct {
    unsigned ARPT:8;
    unsigned AMASK:4;
    unsigned ALRMSYNC:1;
    unsigned PIV:1;
    unsigned CHIME:1;
    unsigned ALRMEN:1;
  };
  struct {
    unsigned w:32;
  };
} __RTCALRMbits_t;
volatile __RTCALRMbits_t RTCALRMbits __asm__ ("RTCALRM");
volatile unsigned int        RTCALRMCLR;
volatile unsigned int        RTCALRMSET;
volatile unsigned int        RTCALRMINV;
volatile unsigned int        RTCTIME;
typedef union {
  struct {
    unsigned :8;
    unsigned SEC01:4;
    unsigned SEC10:4;
    unsigned MIN01:4;
    unsigned MIN10:4;
    unsigned HR01:4;
    unsigned HR10:4;
  };
  struct {
    unsigned w:32;
  };
} __RTCTIMEbits_t;
volatile __RTCTIMEbits_t RTCTIMEbits __asm__ ("RTCTIME");
volatile unsigned int        RTCTIMECLR;
volatile unsigned int        RTCTIMESET;
volatile unsigned int        RTCTIMEINV;
volatile unsigned int        RTCDATE;
typedef union {
  struct {
    unsigned WDAY01:4;
    unsigned :4;
    unsigned DAY01:4;
    unsigned DAY10:4;
    unsigned MONTH01:4;
    unsigned MONTH10:4;
    unsigned YEAR01:4;
    unsigned YEAR10:4;
  };
  struct {
    unsigned w:32;
  };
} __RTCDATEbits_t;
volatile __RTCDATEbits_t RTCDATEbits __asm__ ("RTCDATE");
volatile unsigned int        RTCDATECLR;
volatile unsigned int        RTCDATESET;
volatile unsigned int        RTCDATEINV;
volatile unsigned int        ALRMTIME;
typedef union {
  struct {
    unsigned :8;
    unsigned SEC01:4;
    unsigned SEC10:4;
    unsigned MIN01:4;
    unsigned MIN10:4;
    unsigned HR01:4;
    unsigned HR10:4;
  };
  struct {
    unsigned w:32;
  };
} __ALRMTIMEbits_t;
volatile __ALRMTIMEbits_t ALRMTIMEbits __asm__ ("ALRMTIME");
volatile unsigned int        ALRMTIMECLR;
volatile unsigned int        ALRMTIMESET;
volatile unsigned int        ALRMTIMEINV;
volatile unsigned int        ALRMDATE;
typedef union {
  struct {
    unsigned WDAY01:4;
    unsigned :4;
    unsigned DAY01:4;
    unsigned DAY10:4;
    unsigned MONTH01:4;
    unsigned MONTH10:4;
  };
  struct {
    unsigned w:32;
  };
} __ALRMDATEbits_t;
volatile __ALRMDATEbits_t ALRMDATEbits __asm__ ("ALRMDATE");
volatile unsigned int        ALRMDATECLR;
volatile unsigned int        ALRMDATESET;
volatile unsigned int        ALRMDATEINV;
volatile unsigned int        T1CON;
typedef union {
  struct {
    unsigned :1;
    unsigned TCS:1;
    unsigned TSYNC:1;
    unsigned :1;
    unsigned TCKPS:2;
    unsigned :1;
    unsigned TGATE:1;
    unsigned :3;
    unsigned TWIP:1;
    unsigned TWDIS:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :4;
    unsigned TCKPS0:1;
    unsigned TCKPS1:1;
  };
  struct {
    unsigned :13;
    unsigned TSIDL:1;
    unsigned :1;
    unsigned TON:1;
  };
  struct {
    unsigned w:32;
  };
} __T1CONbits_t;
volatile __T1CONbits_t T1CONbits __asm__ ("T1CON");
volatile unsigned int        T1CONCLR;
volatile unsigned int        T1CONSET;
volatile unsigned int        T1CONINV;
volatile unsigned int        TMR1;
volatile unsigned int        TMR1CLR;
volatile unsigned int        TMR1SET;
volatile unsigned int        TMR1INV;
volatile unsigned int        PR1;
volatile unsigned int        PR1CLR;
volatile unsigned int        PR1SET;
volatile unsigned int        PR1INV;
volatile unsigned int        T2CON;
typedef union {
  struct {
    unsigned :1;
    unsigned TCS:1;
    unsigned :1;
    unsigned T32:1;
    unsigned TCKPS:3;
    unsigned TGATE:1;
    unsigned :5;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :4;
    unsigned TCKPS0:1;
    unsigned TCKPS1:1;
    unsigned TCKPS2:1;
  };
  struct {
    unsigned :13;
    unsigned TSIDL:1;
    unsigned :1;
    unsigned TON:1;
  };
  struct {
    unsigned w:32;
  };
} __T2CONbits_t;
volatile __T2CONbits_t T2CONbits __asm__ ("T2CON");
volatile unsigned int        T2CONCLR;
volatile unsigned int        T2CONSET;
volatile unsigned int        T2CONINV;
volatile unsigned int        TMR2;
volatile unsigned int        TMR2CLR;
volatile unsigned int        TMR2SET;
volatile unsigned int        TMR2INV;
volatile unsigned int        PR2;
volatile unsigned int        PR2CLR;
volatile unsigned int        PR2SET;
volatile unsigned int        PR2INV;
volatile unsigned int        T3CON;
typedef union {
  struct {
    unsigned :1;
    unsigned TCS:1;
    unsigned :1;
    unsigned T32:1;
    unsigned TCKPS:3;
    unsigned TGATE:1;
    unsigned :5;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :4;
    unsigned TCKPS0:1;
    unsigned TCKPS1:1;
    unsigned TCKPS2:1;
  };
  struct {
    unsigned :13;
    unsigned TSIDL:1;
    unsigned :1;
    unsigned TON:1;
  };
  struct {
    unsigned w:32;
  };
} __T3CONbits_t;
volatile __T3CONbits_t T3CONbits __asm__ ("T3CON");
volatile unsigned int        T3CONCLR;
volatile unsigned int        T3CONSET;
volatile unsigned int        T3CONINV;
volatile unsigned int        TMR3;
volatile unsigned int        TMR3CLR;
volatile unsigned int        TMR3SET;
volatile unsigned int        TMR3INV;
volatile unsigned int        PR3;
volatile unsigned int        PR3CLR;
volatile unsigned int        PR3SET;
volatile unsigned int        PR3INV;
volatile unsigned int        T4CON;
typedef union {
  struct {
    unsigned :1;
    unsigned TCS:1;
    unsigned :1;
    unsigned T32:1;
    unsigned TCKPS:3;
    unsigned TGATE:1;
    unsigned :5;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :4;
    unsigned TCKPS0:1;
    unsigned TCKPS1:1;
    unsigned TCKPS2:1;
  };
  struct {
    unsigned :13;
    unsigned TSIDL:1;
    unsigned :1;
    unsigned TON:1;
  };
  struct {
    unsigned w:32;
  };
} __T4CONbits_t;
