rogermc2/MB_Ada/src/p32mx470f512.h
volatile __T4CONbits_t T4CONbits __asm__ ("T4CON");
volatile unsigned int        T4CONCLR;
volatile unsigned int        T4CONSET;
volatile unsigned int        T4CONINV;
volatile unsigned int        TMR4;
volatile unsigned int        TMR4CLR;
volatile unsigned int        TMR4SET;
volatile unsigned int        TMR4INV;
volatile unsigned int        PR4;
volatile unsigned int        PR4CLR;
volatile unsigned int        PR4SET;
volatile unsigned int        PR4INV;
volatile unsigned int        T5CON;
typedef union {
  struct {
    unsigned :1;
    unsigned TCS:1;
    unsigned :1;
    unsigned T32:1;
    unsigned TCKPS:3;
    unsigned TGATE:1;
    unsigned :5;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :4;
    unsigned TCKPS0:1;
    unsigned TCKPS1:1;
    unsigned TCKPS2:1;
  };
  struct {
    unsigned :13;
    unsigned TSIDL:1;
    unsigned :1;
    unsigned TON:1;
  };
  struct {
    unsigned w:32;
  };
} __T5CONbits_t;
volatile __T5CONbits_t T5CONbits __asm__ ("T5CON");
volatile unsigned int        T5CONCLR;
volatile unsigned int        T5CONSET;
volatile unsigned int        T5CONINV;
volatile unsigned int        TMR5;
volatile unsigned int        TMR5CLR;
volatile unsigned int        TMR5SET;
volatile unsigned int        TMR5INV;
volatile unsigned int        PR5;
volatile unsigned int        PR5CLR;
volatile unsigned int        PR5SET;
volatile unsigned int        PR5INV;
volatile unsigned int        IC1CON;
typedef union {
  struct {
    unsigned ICM:3;
    unsigned ICBNE:1;
    unsigned ICOV:1;
    unsigned ICI:2;
    unsigned ICTMR:1;
    unsigned C32:1;
    unsigned FEDGE:1;
    unsigned :3;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned ICM0:1;
    unsigned ICM1:1;
    unsigned ICM2:1;
    unsigned :2;
    unsigned ICI0:1;
    unsigned ICI1:1;
  };
  struct {
    unsigned :13;
    unsigned ICSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __IC1CONbits_t;
volatile __IC1CONbits_t IC1CONbits __asm__ ("IC1CON");
volatile unsigned int        IC1CONCLR;
volatile unsigned int        IC1CONSET;
volatile unsigned int        IC1CONINV;
volatile unsigned int        IC1BUF;
volatile unsigned int        IC2CON;
typedef union {
  struct {
    unsigned ICM:3;
    unsigned ICBNE:1;
    unsigned ICOV:1;
    unsigned ICI:2;
    unsigned ICTMR:1;
    unsigned C32:1;
    unsigned FEDGE:1;
    unsigned :3;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned ICM0:1;
    unsigned ICM1:1;
    unsigned ICM2:1;
    unsigned :2;
    unsigned ICI0:1;
    unsigned ICI1:1;
  };
  struct {
    unsigned :13;
    unsigned ICSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __IC2CONbits_t;
volatile __IC2CONbits_t IC2CONbits __asm__ ("IC2CON");
volatile unsigned int        IC2CONCLR;
volatile unsigned int        IC2CONSET;
volatile unsigned int        IC2CONINV;
volatile unsigned int        IC2BUF;
volatile unsigned int        IC3CON;
typedef union {
  struct {
    unsigned ICM:3;
    unsigned ICBNE:1;
    unsigned ICOV:1;
    unsigned ICI:2;
    unsigned ICTMR:1;
    unsigned C32:1;
    unsigned FEDGE:1;
    unsigned :3;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned ICM0:1;
    unsigned ICM1:1;
    unsigned ICM2:1;
    unsigned :2;
    unsigned ICI0:1;
    unsigned ICI1:1;
  };
  struct {
    unsigned :13;
    unsigned ICSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __IC3CONbits_t;
volatile __IC3CONbits_t IC3CONbits __asm__ ("IC3CON");
volatile unsigned int        IC3CONCLR;
volatile unsigned int        IC3CONSET;
volatile unsigned int        IC3CONINV;
volatile unsigned int        IC3BUF;
volatile unsigned int        IC4CON;
typedef union {
  struct {
    unsigned ICM:3;
    unsigned ICBNE:1;
    unsigned ICOV:1;
    unsigned ICI:2;
    unsigned ICTMR:1;
    unsigned C32:1;
    unsigned FEDGE:1;
    unsigned :3;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned ICM0:1;
    unsigned ICM1:1;
    unsigned ICM2:1;
    unsigned :2;
    unsigned ICI0:1;
    unsigned ICI1:1;
  };
  struct {
    unsigned :13;
    unsigned ICSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __IC4CONbits_t;
volatile __IC4CONbits_t IC4CONbits __asm__ ("IC4CON");
volatile unsigned int        IC4CONCLR;
volatile unsigned int        IC4CONSET;
volatile unsigned int        IC4CONINV;
volatile unsigned int        IC4BUF;
volatile unsigned int        IC5CON;
typedef union {
  struct {
    unsigned ICM:3;
    unsigned ICBNE:1;
    unsigned ICOV:1;
    unsigned ICI:2;
    unsigned ICTMR:1;
    unsigned C32:1;
    unsigned FEDGE:1;
    unsigned :3;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned ICM0:1;
    unsigned ICM1:1;
    unsigned ICM2:1;
    unsigned :2;
    unsigned ICI0:1;
    unsigned ICI1:1;
  };
  struct {
    unsigned :13;
    unsigned ICSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __IC5CONbits_t;
volatile __IC5CONbits_t IC5CONbits __asm__ ("IC5CON");
volatile unsigned int        IC5CONCLR;
volatile unsigned int        IC5CONSET;
volatile unsigned int        IC5CONINV;
volatile unsigned int        IC5BUF;
volatile unsigned int        OC1CON;
typedef union {
  struct {
    unsigned OCM:3;
    unsigned OCTSEL:1;
    unsigned OCFLT:1;
    unsigned OC32:1;
    unsigned :7;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned OCM0:1;
    unsigned OCM1:1;
    unsigned OCM2:1;
  };
  struct {
    unsigned :13;
    unsigned OCSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __OC1CONbits_t;
volatile __OC1CONbits_t OC1CONbits __asm__ ("OC1CON");
volatile unsigned int        OC1CONCLR;
volatile unsigned int        OC1CONSET;
volatile unsigned int        OC1CONINV;
volatile unsigned int        OC1R;
volatile unsigned int        OC1RCLR;
volatile unsigned int        OC1RSET;
volatile unsigned int        OC1RINV;
volatile unsigned int        OC1RS;
volatile unsigned int        OC1RSCLR;
volatile unsigned int        OC1RSSET;
volatile unsigned int        OC1RSINV;
volatile unsigned int        OC2CON;
typedef union {
  struct {
    unsigned OCM:3;
    unsigned OCTSEL:1;
    unsigned OCFLT:1;
    unsigned OC32:1;
    unsigned :7;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned OCM0:1;
    unsigned OCM1:1;
    unsigned OCM2:1;
  };
  struct {
    unsigned :13;
    unsigned OCSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __OC2CONbits_t;
volatile __OC2CONbits_t OC2CONbits __asm__ ("OC2CON");
volatile unsigned int        OC2CONCLR;
volatile unsigned int        OC2CONSET;
volatile unsigned int        OC2CONINV;
volatile unsigned int        OC2R;
volatile unsigned int        OC2RCLR;
volatile unsigned int        OC2RSET;
volatile unsigned int        OC2RINV;
volatile unsigned int        OC2RS;
volatile unsigned int        OC2RSCLR;
volatile unsigned int        OC2RSSET;
volatile unsigned int        OC2RSINV;
volatile unsigned int        OC3CON;
typedef union {
  struct {
    unsigned OCM:3;
    unsigned OCTSEL:1;
    unsigned OCFLT:1;
    unsigned OC32:1;
    unsigned :7;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned OCM0:1;
    unsigned OCM1:1;
    unsigned OCM2:1;
  };
  struct {
    unsigned :13;
    unsigned OCSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __OC3CONbits_t;
volatile __OC3CONbits_t OC3CONbits __asm__ ("OC3CON");
volatile unsigned int        OC3CONCLR;
volatile unsigned int        OC3CONSET;
volatile unsigned int        OC3CONINV;
volatile unsigned int        OC3R;
volatile unsigned int        OC3RCLR;
volatile unsigned int        OC3RSET;
volatile unsigned int        OC3RINV;
volatile unsigned int        OC3RS;
volatile unsigned int        OC3RSCLR;
volatile unsigned int        OC3RSSET;
volatile unsigned int        OC3RSINV;
volatile unsigned int        OC4CON;
typedef union {
  struct {
    unsigned OCM:3;
    unsigned OCTSEL:1;
    unsigned OCFLT:1;
    unsigned OC32:1;
    unsigned :7;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned OCM0:1;
    unsigned OCM1:1;
    unsigned OCM2:1;
  };
  struct {
    unsigned :13;
    unsigned OCSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __OC4CONbits_t;
volatile __OC4CONbits_t OC4CONbits __asm__ ("OC4CON");
volatile unsigned int        OC4CONCLR;
volatile unsigned int        OC4CONSET;
volatile unsigned int        OC4CONINV;
volatile unsigned int        OC4R;
volatile unsigned int        OC4RCLR;
volatile unsigned int        OC4RSET;
volatile unsigned int        OC4RINV;
volatile unsigned int        OC4RS;
volatile unsigned int        OC4RSCLR;
volatile unsigned int        OC4RSSET;
volatile unsigned int        OC4RSINV;
volatile unsigned int        OC5CON;
typedef union {
  struct {
    unsigned OCM:3;
    unsigned OCTSEL:1;
    unsigned OCFLT:1;
    unsigned OC32:1;
    unsigned :7;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned OCM0:1;
    unsigned OCM1:1;
    unsigned OCM2:1;
  };
  struct {
    unsigned :13;
    unsigned OCSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __OC5CONbits_t;
volatile __OC5CONbits_t OC5CONbits __asm__ ("OC5CON");
volatile unsigned int        OC5CONCLR;
volatile unsigned int        OC5CONSET;
volatile unsigned int        OC5CONINV;
volatile unsigned int        OC5R;
volatile unsigned int        OC5RCLR;
volatile unsigned int        OC5RSET;
volatile unsigned int        OC5RINV;
volatile unsigned int        OC5RS;
volatile unsigned int        OC5RSCLR;
volatile unsigned int        OC5RSSET;
volatile unsigned int        OC5RSINV;
volatile unsigned int        I2C1111CON;
typedef union {
  struct {
    unsigned SEN:1;
    unsigned RSEN:1;
    unsigned PEN:1;
    unsigned RCEN:1;
    unsigned ACKEN:1;
    unsigned ACKDT:1;
    unsigned STREN:1;
    unsigned GCEN:1;
    unsigned SMEN:1;
    unsigned DISSLW:1;
    unsigned A10M:1;
    unsigned STRICT:1;
    unsigned SCLREL:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :11;
    unsigned IPMIEN:1;
    unsigned :1;
    unsigned I2CSIDL:1;
    unsigned :1;
    unsigned I2CEN:1;
  };
  struct {
    unsigned w:32;
  };
} __I2C1111CONbits_t;
volatile __I2C1111CONbits_t I2C1111CONbits __asm__ ("I2C1111CON");
volatile unsigned int        I2C1CON;
typedef union {
  struct {
    unsigned SEN:1;
    unsigned RSEN:1;
    unsigned PEN:1;
    unsigned RCEN:1;
    unsigned ACKEN:1;
    unsigned ACKDT:1;
    unsigned STREN:1;
    unsigned GCEN:1;
    unsigned SMEN:1;
    unsigned DISSLW:1;
    unsigned A10M:1;
    unsigned STRICT:1;
    unsigned SCLREL:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :11;
    unsigned IPMIEN:1;
    unsigned :1;
    unsigned I2CSIDL:1;
    unsigned :1;
    unsigned I2CEN:1;
  };
  struct {
    unsigned w:32;
  };
} __I2C1CONbits_t;
