rogermc2/MB_Ada/src/p32mx470f512.h
volatile __I2C1CONbits_t I2C1CONbits __asm__ ("I2C1CON");
volatile unsigned int        I2C1111CONCLR;
volatile unsigned int        I2C1CONCLR;
volatile unsigned int        I2C1111CONSET;
volatile unsigned int        I2C1CONSET;
volatile unsigned int        I2C1111CONINV;
volatile unsigned int        I2C1CONINV;
volatile unsigned int        I2C1111STAT;
typedef union {
  struct {
    unsigned TBF:1;
    unsigned RBF:1;
    unsigned R_W:1;
    unsigned S:1;
    unsigned P:1;
    unsigned D_A:1;
    unsigned I2COV:1;
    unsigned IWCOL:1;
    unsigned ADD10:1;
    unsigned GCSTAT:1;
    unsigned BCL:1;
    unsigned :3;
    unsigned TRSTAT:1;
    unsigned ACKSTAT:1;
  };
  struct {
    unsigned :6;
    unsigned I2CPOV:1;
  };
  struct {
    unsigned w:32;
  };
} __I2C1111STATbits_t;
volatile __I2C1111STATbits_t I2C1111STATbits __asm__ ("I2C1111STAT");
volatile unsigned int        I2C1STAT;
typedef union {
  struct {
    unsigned TBF:1;
    unsigned RBF:1;
    unsigned R_W:1;
    unsigned S:1;
    unsigned P:1;
    unsigned D_A:1;
    unsigned I2COV:1;
    unsigned IWCOL:1;
    unsigned ADD10:1;
    unsigned GCSTAT:1;
    unsigned BCL:1;
    unsigned :3;
    unsigned TRSTAT:1;
    unsigned ACKSTAT:1;
  };
  struct {
    unsigned :6;
    unsigned I2CPOV:1;
  };
  struct {
    unsigned w:32;
  };
} __I2C1STATbits_t;
volatile __I2C1STATbits_t I2C1STATbits __asm__ ("I2C1STAT");
volatile unsigned int        I2C1111STATCLR;
volatile unsigned int        I2C1STATCLR;
volatile unsigned int        I2C1111STATSET;
volatile unsigned int        I2C1STATSET;
volatile unsigned int        I2C1111STATINV;
volatile unsigned int        I2C1STATINV;
volatile unsigned int        I2C1111ADD;
volatile unsigned int        I2C1ADD;
volatile unsigned int        I2C1111ADDCLR;
volatile unsigned int        I2C1ADDCLR;
volatile unsigned int        I2C1111ADDSET;
volatile unsigned int        I2C1ADDSET;
volatile unsigned int        I2C1111ADDINV;
volatile unsigned int        I2C1ADDINV;
volatile unsigned int        I2C1111MSK;
volatile unsigned int        I2C1MSK;
volatile unsigned int        I2C1111MSKCLR;
volatile unsigned int        I2C1MSKCLR;
volatile unsigned int        I2C1111MSKSET;
volatile unsigned int        I2C1MSKSET;
volatile unsigned int        I2C1111MSKINV;
volatile unsigned int        I2C1MSKINV;
volatile unsigned int        I2C1111BRG;
volatile unsigned int        I2C1BRG;
volatile unsigned int        I2C1111BRGCLR;
volatile unsigned int        I2C1BRGCLR;
volatile unsigned int        I2C1111BRGSET;
volatile unsigned int        I2C1BRGSET;
volatile unsigned int        I2C1111BRGINV;
volatile unsigned int        I2C1BRGINV;
volatile unsigned int        I2C1111TRN;
volatile unsigned int        I2C1TRN;
volatile unsigned int        I2C1111TRNCLR;
volatile unsigned int        I2C1TRNCLR;
volatile unsigned int        I2C1111TRNSET;
volatile unsigned int        I2C1TRNSET;
volatile unsigned int        I2C1111TRNINV;
volatile unsigned int        I2C1TRNINV;
volatile unsigned int        I2C1111RCV;
volatile unsigned int        I2C1RCV;
volatile unsigned int        I2C2CON;
typedef union {
  struct {
    unsigned SEN:1;
    unsigned RSEN:1;
    unsigned PEN:1;
    unsigned RCEN:1;
    unsigned ACKEN:1;
    unsigned ACKDT:1;
    unsigned STREN:1;
    unsigned GCEN:1;
    unsigned SMEN:1;
    unsigned DISSLW:1;
    unsigned A10M:1;
    unsigned STRICT:1;
    unsigned SCLREL:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :11;
    unsigned IPMIEN:1;
    unsigned :1;
    unsigned I2CSIDL:1;
    unsigned :1;
    unsigned I2CEN:1;
  };
  struct {
    unsigned w:32;
  };
} __I2C2CONbits_t;
volatile __I2C2CONbits_t I2C2CONbits __asm__ ("I2C2CON");
volatile unsigned int        I2CABCON;
typedef union {
  struct {
    unsigned SEN:1;
    unsigned RSEN:1;
    unsigned PEN:1;
    unsigned RCEN:1;
    unsigned ACKEN:1;
    unsigned ACKDT:1;
    unsigned STREN:1;
    unsigned GCEN:1;
    unsigned SMEN:1;
    unsigned DISSLW:1;
    unsigned A10M:1;
    unsigned STRICT:1;
    unsigned SCLREL:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :11;
    unsigned IPMIEN:1;
    unsigned :1;
    unsigned I2CSIDL:1;
    unsigned :1;
    unsigned I2CEN:1;
  };
  struct {
    unsigned w:32;
  };
} __I2CABCONbits_t;
volatile __I2CABCONbits_t I2CABCONbits __asm__ ("I2CABCON");
volatile unsigned int        I2C2CONCLR;
volatile unsigned int        I2CABCONCLR;
volatile unsigned int        I2C2CONSET;
volatile unsigned int        I2CABCONSET;
volatile unsigned int        I2C2CONINV;
volatile unsigned int        I2CABCONINV;
volatile unsigned int        I2C2STAT;
typedef union {
  struct {
    unsigned TBF:1;
    unsigned RBF:1;
    unsigned R_W:1;
    unsigned S:1;
    unsigned P:1;
    unsigned D_A:1;
    unsigned I2COV:1;
    unsigned IWCOL:1;
    unsigned ADD10:1;
    unsigned GCSTAT:1;
    unsigned BCL:1;
    unsigned :3;
    unsigned TRSTAT:1;
    unsigned ACKSTAT:1;
  };
  struct {
    unsigned :6;
    unsigned I2CPOV:1;
  };
  struct {
    unsigned w:32;
  };
} __I2C2STATbits_t;
volatile __I2C2STATbits_t I2C2STATbits __asm__ ("I2C2STAT");
volatile unsigned int        I2CABSTAT;
typedef union {
  struct {
    unsigned TBF:1;
    unsigned RBF:1;
    unsigned R_W:1;
    unsigned S:1;
    unsigned P:1;
    unsigned D_A:1;
    unsigned I2COV:1;
    unsigned IWCOL:1;
    unsigned ADD10:1;
    unsigned GCSTAT:1;
    unsigned BCL:1;
    unsigned :3;
    unsigned TRSTAT:1;
    unsigned ACKSTAT:1;
  };
  struct {
    unsigned :6;
    unsigned I2CPOV:1;
  };
  struct {
    unsigned w:32;
  };
} __I2CABSTATbits_t;
volatile __I2CABSTATbits_t I2CABSTATbits __asm__ ("I2CABSTAT");
volatile unsigned int        I2C2STATCLR;
volatile unsigned int        I2CABSTATCLR;
volatile unsigned int        I2C2STATSET;
volatile unsigned int        I2CABSTATSET;
volatile unsigned int        I2C2STATINV;
volatile unsigned int        I2CABSTATINV;
volatile unsigned int        I2C2ADD;
volatile unsigned int        I2CABADD;
volatile unsigned int        I2C2ADDCLR;
volatile unsigned int        I2CABADDCLR;
volatile unsigned int        I2C2ADDSET;
volatile unsigned int        I2CABADDSET;
volatile unsigned int        I2C2ADDINV;
volatile unsigned int        I2CABADDINV;
volatile unsigned int        I2C2MSK;
volatile unsigned int        I2CABMSK;
volatile unsigned int        I2C2MSKCLR;
volatile unsigned int        I2CABMSKCLR;
volatile unsigned int        I2C2MSKSET;
volatile unsigned int        I2CABMSKSET;
volatile unsigned int        I2C2MSKINV;
volatile unsigned int        I2CABMSKINV;
volatile unsigned int        I2C2BRG;
volatile unsigned int        I2CABBRG;
volatile unsigned int        I2C2BRGCLR;
volatile unsigned int        I2CABBRGCLR;
volatile unsigned int        I2C2BRGSET;
volatile unsigned int        I2CABBRGSET;
volatile unsigned int        I2C2BRGINV;
volatile unsigned int        I2CABBRGINV;
volatile unsigned int        I2C2TRN;
volatile unsigned int        I2CABTRN;
volatile unsigned int        I2C2TRNCLR;
volatile unsigned int        I2CABTRNCLR;
volatile unsigned int        I2C2TRNSET;
volatile unsigned int        I2CABTRNSET;
volatile unsigned int        I2C2TRNINV;
volatile unsigned int        I2CABTRNINV;
volatile unsigned int        I2C2RCV;
volatile unsigned int        I2CABRCV;
volatile unsigned int        SPI1CON;
typedef union {
  struct {
    unsigned SRXISEL:2;
    unsigned STXISEL:2;
    unsigned DISSDI:1;
    unsigned MSTEN:1;
    unsigned CKP:1;
    unsigned SSEN:1;
    unsigned CKE:1;
    unsigned SMP:1;
    unsigned MODE16:1;
    unsigned MODE32:1;
    unsigned DISSDO:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned ENHBUF:1;
    unsigned SPIFE:1;
    unsigned :5;
    unsigned MCLKSEL:1;
    unsigned FRMCNT:3;
    unsigned FRMSYPW:1;
    unsigned MSSEN:1;
    unsigned FRMPOL:1;
    unsigned FRMSYNC:1;
    unsigned FRMEN:1;
  };
  struct {
    unsigned w:32;
  };
} __SPI1CONbits_t;
volatile __SPI1CONbits_t SPI1CONbits __asm__ ("SPI1CON");
volatile unsigned int        SPI1CONCLR;
volatile unsigned int        SPI1CONSET;
volatile unsigned int        SPI1CONINV;
volatile unsigned int        SPI1STAT;
typedef union {
  struct {
    unsigned SPIRBF:1;
    unsigned SPITBF:1;
    unsigned :1;
    unsigned SPITBE:1;
    unsigned :1;
    unsigned SPIRBE:1;
    unsigned SPIROV:1;
    unsigned SRMT:1;
    unsigned SPITUR:1;
    unsigned :2;
    unsigned SPIBUSY:1;
    unsigned FRMERR:1;
    unsigned :3;
    unsigned TXBUFELM:5;
    unsigned :3;
    unsigned RXBUFELM:5;
  };
  struct {
    unsigned w:32;
  };
} __SPI1STATbits_t;
volatile __SPI1STATbits_t SPI1STATbits __asm__ ("SPI1STAT");
volatile unsigned int        SPI1STATCLR;
volatile unsigned int        SPI1STATSET;
volatile unsigned int        SPI1STATINV;
volatile unsigned int        SPI1BUF;
volatile unsigned int        SPI1BRG;
volatile unsigned int        SPI1BRGCLR;
volatile unsigned int        SPI1BRGSET;
volatile unsigned int        SPI1BRGINV;
volatile unsigned int        SPI1CON2;
typedef union {
  struct {
    unsigned AUDMOD:2;
    unsigned :1;
    unsigned AUDMONO:1;
    unsigned :3;
    unsigned AUDEN:1;
    unsigned IGNTUR:1;
    unsigned IGNROV:1;
    unsigned SPITUREN:1;
    unsigned SPIROVEN:1;
    unsigned FRMERREN:1;
    unsigned :2;
    unsigned SPISGNEXT:1;
  };
  struct {
    unsigned AUDMOD0:1;
    unsigned AUDMOD1:1;
  };
  struct {
    unsigned w:32;
  };
} __SPI1CON2bits_t;
