rogermc2/MB_Ada/src/p32mx470f512.h
volatile __UodMODEbits_t UodMODEbits __asm__ ("UodMODE");
volatile unsigned int        U4MODECLR;
volatile unsigned int        UodMODECLR;
volatile unsigned int        U4MODESET;
volatile unsigned int        UodMODESET;
volatile unsigned int        U4MODEINV;
volatile unsigned int        UodMODEINV;
volatile unsigned int        U4STA;
typedef union {
  struct {
    unsigned URXDA:1;
    unsigned OERR:1;
    unsigned FERR:1;
    unsigned PERR:1;
    unsigned RIDLE:1;
    unsigned ADDEN:1;
    unsigned URXISEL:2;
    unsigned TRMT:1;
    unsigned UTXBF:1;
    unsigned UTXEN:1;
    unsigned UTXBRK:1;
    unsigned URXEN:1;
    unsigned UTXINV:1;
    unsigned UTXISEL:2;
    unsigned ADDR:8;
    unsigned ADM_EN:1;
  };
  struct {
    unsigned :6;
    unsigned URXISEL0:1;
    unsigned URXISEL1:1;
    unsigned :6;
    unsigned UTXISEL0:1;
    unsigned UTXISEL1:1;
  };
  struct {
    unsigned :14;
    unsigned UTXSEL:2;
  };
  struct {
    unsigned w:32;
  };
} __U4STAbits_t;
volatile __U4STAbits_t U4STAbits __asm__ ("U4STA");
volatile unsigned int        UodSTA;
typedef union {
  struct {
    unsigned URXDA:1;
    unsigned OERR:1;
    unsigned FERR:1;
    unsigned PERR:1;
    unsigned RIDLE:1;
    unsigned ADDEN:1;
    unsigned URXISEL:2;
    unsigned TRMT:1;
    unsigned UTXBF:1;
    unsigned UTXEN:1;
    unsigned UTXBRK:1;
    unsigned URXEN:1;
    unsigned UTXINV:1;
    unsigned UTXISEL:2;
    unsigned ADDR:8;
    unsigned ADM_EN:1;
  };
  struct {
    unsigned :6;
    unsigned URXISEL0:1;
    unsigned URXISEL1:1;
    unsigned :6;
    unsigned UTXISEL0:1;
    unsigned UTXISEL1:1;
  };
  struct {
    unsigned :14;
    unsigned UTXSEL:2;
  };
  struct {
    unsigned w:32;
  };
} __UodSTAbits_t;
volatile __UodSTAbits_t UodSTAbits __asm__ ("UodSTA");
volatile unsigned int        U4STACLR;
volatile unsigned int        UodSTACLR;
volatile unsigned int        U4STASET;
volatile unsigned int        UodSTASET;
volatile unsigned int        U4STAINV;
volatile unsigned int        UodSTAINV;
volatile unsigned int        U4TXREG;
volatile unsigned int        UodTXREG;
volatile unsigned int        U4RXREG;
volatile unsigned int        UodRXREG;
volatile unsigned int        U4BRG;
volatile unsigned int        UodBRG;
volatile unsigned int        U4BRGCLR;
volatile unsigned int        UodBRGCLR;
volatile unsigned int        U4BRGSET;
volatile unsigned int        UodBRGSET;
volatile unsigned int        U4BRGINV;
volatile unsigned int        UodBRGINV;
volatile unsigned int        PMCON;
typedef union {
  struct {
    unsigned RDSP:1;
    unsigned WRSP:1;
    unsigned :1;
    unsigned CS1P:1;
    unsigned CS2P:1;
    unsigned ALP:1;
    unsigned CSF:2;
    unsigned PTRDEN:1;
    unsigned PTWREN:1;
    unsigned PMPTTL:1;
    unsigned ADRMUX:2;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :6;
    unsigned CSF0:1;
    unsigned CSF1:1;
    unsigned :3;
    unsigned ADRMUX0:1;
    unsigned ADRMUX1:1;
  };
  struct {
    unsigned :13;
    unsigned PSIDL:1;
    unsigned :1;
    unsigned PMPEN:1;
  };
  struct {
    unsigned w:32;
  };
} __PMCONbits_t;
volatile __PMCONbits_t PMCONbits __asm__ ("PMCON");
volatile unsigned int        PMCONCLR;
volatile unsigned int        PMCONSET;
volatile unsigned int        PMCONINV;
volatile unsigned int        PMMODE;
typedef union {
  struct {
    unsigned WAITE:2;
    unsigned WAITM:4;
    unsigned WAITB:2;
    unsigned MODE:2;
    unsigned MODE16:1;
    unsigned INCM:2;
    unsigned IRQM:2;
    unsigned BUSY:1;
  };
  struct {
    unsigned WAITE0:1;
    unsigned WAITE1:1;
    unsigned WAITM0:1;
    unsigned WAITM1:1;
    unsigned WAITM2:1;
    unsigned WAITM3:1;
    unsigned WAITB0:1;
    unsigned WAITB1:1;
    unsigned MODE0:1;
    unsigned MODE1:1;
    unsigned :1;
    unsigned INCM0:1;
    unsigned INCM1:1;
    unsigned IRQM0:1;
    unsigned IRQM1:1;
  };
  struct {
    unsigned w:32;
  };
} __PMMODEbits_t;
volatile __PMMODEbits_t PMMODEbits __asm__ ("PMMODE");
volatile unsigned int        PMMODECLR;
volatile unsigned int        PMMODESET;
volatile unsigned int        PMMODEINV;
volatile unsigned int        PMADDR;
typedef union {
  struct {
    unsigned ADDR:14;
    unsigned CS:2;
  };
  struct {
    unsigned PADDR:14;
  };
  struct {
    unsigned :14;
    unsigned CS1:1;
    unsigned CS2:1;
  };
  struct {
    unsigned w:32;
  };
} __PMADDRbits_t;
volatile __PMADDRbits_t PMADDRbits __asm__ ("PMADDR");
volatile unsigned int        PMADDRCLR;
volatile unsigned int        PMADDRSET;
volatile unsigned int        PMADDRINV;
volatile unsigned int        PMDOUT;
typedef union {
  struct {
    unsigned DATAOUT:32;
  };
  struct {
    unsigned w:32;
  };
} __PMDOUTbits_t;
volatile __PMDOUTbits_t PMDOUTbits __asm__ ("PMDOUT");
volatile unsigned int        PMDOUTCLR;
volatile unsigned int        PMDOUTSET;
volatile unsigned int        PMDOUTINV;
volatile unsigned int        PMDIN;
typedef union {
  struct {
    unsigned DATAIN:32;
  };
  struct {
    unsigned w:32;
  };
} __PMDINbits_t;
volatile __PMDINbits_t PMDINbits __asm__ ("PMDIN");
volatile unsigned int        PMDINCLR;
volatile unsigned int        PMDINSET;
volatile unsigned int        PMDININV;
volatile unsigned int        PMAEN;
typedef union {
  struct {
    unsigned PTEN:16;
  };
  struct {
    unsigned PTEN0:1;
    unsigned PTEN1:1;
    unsigned PTEN2:1;
    unsigned PTEN3:1;
    unsigned PTEN4:1;
    unsigned PTEN5:1;
    unsigned PTEN6:1;
    unsigned PTEN7:1;
    unsigned PTEN8:1;
    unsigned PTEN9:1;
    unsigned PTEN10:1;
    unsigned PTEN11:1;
    unsigned PTEN12:1;
    unsigned PTEN13:1;
    unsigned PTEN14:1;
    unsigned PTEN15:1;
  };
  struct {
    unsigned w:32;
  };
} __PMAENbits_t;
volatile __PMAENbits_t PMAENbits __asm__ ("PMAEN");
volatile unsigned int        PMAENCLR;
volatile unsigned int        PMAENSET;
volatile unsigned int        PMAENINV;
volatile unsigned int        PMSTAT;
typedef union {
  struct {
    unsigned OB0E:1;
    unsigned OB1E:1;
    unsigned OB2E:1;
    unsigned OB3E:1;
    unsigned :2;
    unsigned OBUF:1;
    unsigned OBE:1;
    unsigned IB0F:1;
    unsigned IB1F:1;
    unsigned IB2F:1;
    unsigned IB3F:1;
    unsigned :2;
    unsigned IBOV:1;
    unsigned IBF:1;
  };
  struct {
    unsigned w:32;
  };
} __PMSTATbits_t;
