rogermc2/MB_Ada/src/p32mx470f512.h
volatile __PMSTATbits_t PMSTATbits __asm__ ("PMSTAT");
volatile unsigned int        PMSTATCLR;
volatile unsigned int        PMSTATSET;
volatile unsigned int        PMSTATINV;
volatile unsigned int        AD1CON1;
typedef union {
  struct {
    unsigned DONE:1;
    unsigned SAMP:1;
    unsigned ASAM:1;
    unsigned :1;
    unsigned CLRASAM:1;
    unsigned SSRC:3;
    unsigned FORM:3;
    unsigned :2;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :5;
    unsigned SSRC0:1;
    unsigned SSRC1:1;
    unsigned SSRC2:1;
    unsigned FORM0:1;
    unsigned FORM1:1;
    unsigned FORM2:1;
  };
  struct {
    unsigned :13;
    unsigned ADSIDL:1;
    unsigned :1;
    unsigned ADON:1;
  };
  struct {
    unsigned w:32;
  };
} __AD1CON1bits_t;
volatile __AD1CON1bits_t AD1CON1bits __asm__ ("AD1CON1");
volatile unsigned int        AD1CON1CLR;
volatile unsigned int        AD1CON1SET;
volatile unsigned int        AD1CON1INV;
volatile unsigned int        AD1CON2;
typedef union {
  struct {
    unsigned ALTS:1;
    unsigned BUFM:1;
    unsigned SMPI:4;
    unsigned :1;
    unsigned BUFS:1;
    unsigned :2;
    unsigned CSCNA:1;
    unsigned :1;
    unsigned OFFCAL:1;
    unsigned VCFG:3;
  };
  struct {
    unsigned :2;
    unsigned SMPI0:1;
    unsigned SMPI1:1;
    unsigned SMPI2:1;
    unsigned SMPI3:1;
    unsigned :7;
    unsigned VCFG0:1;
    unsigned VCFG1:1;
    unsigned VCFG2:1;
  };
  struct {
    unsigned w:32;
  };
} __AD1CON2bits_t;
volatile __AD1CON2bits_t AD1CON2bits __asm__ ("AD1CON2");
volatile unsigned int        AD1CON2CLR;
volatile unsigned int        AD1CON2SET;
volatile unsigned int        AD1CON2INV;
volatile unsigned int        AD1CON3;
typedef union {
  struct {
    unsigned ADCS:8;
    unsigned SAMC:5;
    unsigned :2;
    unsigned ADRC:1;
  };
  struct {
    unsigned ADCS0:1;
    unsigned ADCS1:1;
    unsigned ADCS2:1;
    unsigned ADCS3:1;
    unsigned ADCS4:1;
    unsigned ADCS5:1;
    unsigned ADCS6:1;
    unsigned ADCS7:1;
    unsigned SAMC0:1;
    unsigned SAMC1:1;
    unsigned SAMC2:1;
    unsigned SAMC3:1;
    unsigned SAMC4:1;
  };
  struct {
    unsigned w:32;
  };
} __AD1CON3bits_t;
volatile __AD1CON3bits_t AD1CON3bits __asm__ ("AD1CON3");
volatile unsigned int        AD1CON3CLR;
volatile unsigned int        AD1CON3SET;
volatile unsigned int        AD1CON3INV;
volatile unsigned int        AD1CHS;
typedef union {
  struct {
    unsigned :16;
    unsigned CH0SA:4;
    unsigned :3;
    unsigned CH0NA:1;
    unsigned CH0SB:4;
    unsigned :3;
    unsigned CH0NB:1;
  };
  struct {
    unsigned :16;
    unsigned CH0SA0:1;
    unsigned CH0SA1:1;
    unsigned CH0SA2:1;
    unsigned CH0SA3:1;
    unsigned :4;
    unsigned CH0SB0:1;
    unsigned CH0SB1:1;
    unsigned CH0SB2:1;
    unsigned CH0SB3:1;
  };
  struct {
    unsigned w:32;
  };
} __AD1CHSbits_t;
volatile __AD1CHSbits_t AD1CHSbits __asm__ ("AD1CHS");
volatile unsigned int        AD1CHSCLR;
volatile unsigned int        AD1CHSSET;
volatile unsigned int        AD1CHSINV;
volatile unsigned int        AD1CSSL;
typedef union {
  struct {
    unsigned CSSL:31;
  };
  struct {
    unsigned CSSL0:1;
    unsigned CSSL1:1;
    unsigned CSSL2:1;
    unsigned CSSL3:1;
    unsigned CSSL4:1;
    unsigned CSSL5:1;
    unsigned CSSL6:1;
    unsigned CSSL7:1;
    unsigned CSSL8:1;
    unsigned CSSL9:1;
    unsigned CSSL10:1;
    unsigned CSSL11:1;
    unsigned CSSL12:1;
    unsigned CSSL13:1;
    unsigned CSSL14:1;
    unsigned CSSL15:1;
    unsigned CSSL16:1;
    unsigned CSSL17:1;
    unsigned CSSL18:1;
    unsigned CSSL19:1;
    unsigned CSSL20:1;
    unsigned CSSL21:1;
    unsigned CSSL22:1;
    unsigned CSSL23:1;
    unsigned CSSL24:1;
    unsigned CSSL25:1;
    unsigned CSSL26:1;
    unsigned CSSL27:1;
    unsigned CSSL28:1;
    unsigned CSSL29:1;
    unsigned CSSL30:1;
  };
  struct {
    unsigned w:32;
  };
} __AD1CSSLbits_t;
volatile __AD1CSSLbits_t AD1CSSLbits __asm__ ("AD1CSSL");
volatile unsigned int        AD1CSSLCLR;
volatile unsigned int        AD1CSSLSET;
volatile unsigned int        AD1CSSLINV;
volatile unsigned int        ADC1BUF0;
volatile unsigned int        ADC1BUF1;
volatile unsigned int        ADC1BUF2;
volatile unsigned int        ADC1BUF3;
volatile unsigned int        ADC1BUF4;
volatile unsigned int        ADC1BUF5;
volatile unsigned int        ADC1BUF6;
volatile unsigned int        ADC1BUF7;
volatile unsigned int        ADC1BUF8;
volatile unsigned int        ADC1BUF9;
volatile unsigned int        ADC1BUFA;
volatile unsigned int        ADC1BUFB;
volatile unsigned int        ADC1BUFC;
volatile unsigned int        ADC1BUFD;
volatile unsigned int        ADC1BUFE;
volatile unsigned int        ADC1BUFF;
volatile unsigned int        CVRCON;
typedef union {
  struct {
    unsigned CVR:4;
    unsigned CVRSS:1;
    unsigned CVRR:1;
    unsigned CVROE:1;
    unsigned :1;
    unsigned BGSEL:2;
    unsigned VREFSEL:1;
    unsigned :4;
    unsigned ON:1;
  };
  struct {
    unsigned CVR0:1;
    unsigned CVR1:1;
    unsigned CVR2:1;
    unsigned CVR3:1;
    unsigned :4;
    unsigned BGSEL0:1;
    unsigned BGSEL1:1;
  };
  struct {
    unsigned w:32;
  };
} __CVRCONbits_t;
volatile __CVRCONbits_t CVRCONbits __asm__ ("CVRCON");
volatile unsigned int        CVRCONCLR;
volatile unsigned int        CVRCONSET;
volatile unsigned int        CVRCONINV;
volatile unsigned int        CM1CON;
typedef union {
  struct {
    unsigned CCH:2;
    unsigned :2;
    unsigned CREF:1;
    unsigned :1;
    unsigned EVPOL:2;
    unsigned COUT:1;
    unsigned :3;
    unsigned CLPWR:1;
    unsigned CPOL:1;
    unsigned COE:1;
    unsigned ON:1;
  };
  struct {
    unsigned CCH0:1;
    unsigned CCH1:1;
    unsigned :4;
    unsigned EVPOL0:1;
    unsigned EVPOL1:1;
  };
  struct {
    unsigned w:32;
  };
} __CM1CONbits_t;
volatile __CM1CONbits_t CM1CONbits __asm__ ("CM1CON");
volatile unsigned int        CM1CONCLR;
volatile unsigned int        CM1CONSET;
volatile unsigned int        CM1CONINV;
volatile unsigned int        CM2CON;
typedef union {
  struct {
    unsigned CCH:2;
    unsigned :2;
    unsigned CREF:1;
    unsigned :1;
    unsigned EVPOL:2;
    unsigned COUT:1;
    unsigned :3;
    unsigned CLPWR:1;
    unsigned CPOL:1;
    unsigned COE:1;
    unsigned ON:1;
  };
  struct {
    unsigned CCH0:1;
    unsigned CCH1:1;
    unsigned :4;
    unsigned EVPOL0:1;
    unsigned EVPOL1:1;
  };
  struct {
    unsigned w:32;
  };
} __CM2CONbits_t;
volatile __CM2CONbits_t CM2CONbits __asm__ ("CM2CON");
volatile unsigned int        CM2CONCLR;
volatile unsigned int        CM2CONSET;
volatile unsigned int        CM2CONINV;
volatile unsigned int        CMSTAT;
typedef union {
  struct {
    unsigned C1OUT:1;
    unsigned C2OUT:1;
    unsigned C3OUT:1;
    unsigned C4OUT:1;
    unsigned C5OUT:1;
    unsigned C6OUT:1;
    unsigned :7;
    unsigned SIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __CMSTATbits_t;
volatile __CMSTATbits_t CMSTATbits __asm__ ("CMSTAT");
volatile unsigned int        CMSTATCLR;
volatile unsigned int        CMSTATSET;
volatile unsigned int        CMSTATINV;
volatile unsigned int        CTMUCON;
typedef union {
  struct {
    unsigned IRNG:2;
    unsigned ITRIM:6;
    unsigned CTTRIG:1;
    unsigned IDISSEN:1;
    unsigned EDGSEQEN:1;
    unsigned EDGEN:1;
    unsigned TGEN:1;
    unsigned CTMUSIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned :2;
    unsigned EDG2SEL:4;
    unsigned EDG2POL:1;
    unsigned EDG2MOD:1;
    unsigned EDG1STAT:1;
    unsigned EDG2STAT:1;
    unsigned EDG1SEL:4;
    unsigned EDG1POL:1;
    unsigned EDG1MOD:1;
  };
  struct {
    unsigned w:32;
  };
} __CTMUCONbits_t;
volatile __CTMUCONbits_t CTMUCONbits __asm__ ("CTMUCON");
volatile unsigned int        CTMUCONCLR;
volatile unsigned int        CTMUCONSET;
volatile unsigned int        CTMUCONINV;
volatile unsigned int        OSCCON;
typedef union {
  struct {
    unsigned OSWEN:1;
    unsigned SOSCEN:1;
    unsigned UFRCEN:1;
    unsigned CF:1;
    unsigned SLPEN:1;
    unsigned SLOCK:1;
    unsigned ULOCK:1;
    unsigned CLKLOCK:1;
    unsigned NOSC:3;
    unsigned :1;
    unsigned COSC:3;
    unsigned :1;
    unsigned PLLMULT:3;
    unsigned PBDIV:2;
    unsigned PBDIVRDY:1;
    unsigned SOSCRDY:1;
    unsigned :1;
    unsigned FRCDIV:3;
    unsigned PLLODIV:3;
  };
  struct {
    unsigned :8;
    unsigned NOSC0:1;
    unsigned NOSC1:1;
    unsigned NOSC2:1;
    unsigned :1;
    unsigned COSC0:1;
    unsigned COSC1:1;
    unsigned COSC2:1;
    unsigned :1;
    unsigned PLLMULT0:1;
    unsigned PLLMULT1:1;
    unsigned PLLMULT2:1;
    unsigned PBDIV0:1;
    unsigned PBDIV1:1;
    unsigned :3;
    unsigned FRCDIV0:1;
    unsigned FRCDIV1:1;
    unsigned FRCDIV2:1;
    unsigned PLLODIV0:1;
    unsigned PLLODIV1:1;
    unsigned PLLODIV2:1;
  };
  struct {
    unsigned w:32;
  };
} __OSCCONbits_t;
