rogermc2/MB_Ada/src/p32mx470f512.h
volatile __OSCCONbits_t OSCCONbits __asm__ ("OSCCON");
volatile unsigned int        OSCCONCLR;
volatile unsigned int        OSCCONSET;
volatile unsigned int        OSCCONINV;
volatile unsigned int        OSCTUN;
typedef union {
  struct {
    unsigned TUN:6;
  };
  struct {
    unsigned TUN0:1;
    unsigned TUN1:1;
    unsigned TUN2:1;
    unsigned TUN3:1;
    unsigned TUN4:1;
    unsigned TUN5:1;
  };
  struct {
    unsigned w:32;
  };
} __OSCTUNbits_t;
volatile __OSCTUNbits_t OSCTUNbits __asm__ ("OSCTUN");
volatile unsigned int        OSCTUNCLR;
volatile unsigned int        OSCTUNSET;
volatile unsigned int        OSCTUNINV;
volatile unsigned int        REFOCON;
typedef union {
  struct {
    unsigned ROSEL:4;
    unsigned :4;
    unsigned ACTIVE:1;
    unsigned DIVSWEN:1;
    unsigned :1;
    unsigned RSLP:1;
    unsigned OE:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned RODIV:15;
  };
  struct {
    unsigned w:32;
  };
} __REFOCONbits_t;
volatile __REFOCONbits_t REFOCONbits __asm__ ("REFOCON");
volatile unsigned int        REFOCONCLR;
volatile unsigned int        REFOCONSET;
volatile unsigned int        REFOCONINV;
volatile unsigned int        REFOTRIM;
typedef union {
  struct {
    unsigned :23;
    unsigned ROTRIM:9;
  };
  struct {
    unsigned w:32;
  };
} __REFOTRIMbits_t;
volatile __REFOTRIMbits_t REFOTRIMbits __asm__ ("REFOTRIM");
volatile unsigned int        REFOTRIMCLR;
volatile unsigned int        REFOTRIMSET;
volatile unsigned int        REFOTRIMINV;
volatile unsigned int        CFGCON;
typedef struct {
  unsigned TDOEN:1;
  unsigned :1;
  unsigned TROEN:1;
  unsigned JTAGEN:1;
  unsigned :8;
  unsigned PMDLOCK:1;
  unsigned IOLOCK:1;
} __CFGCONbits_t;
volatile __CFGCONbits_t CFGCONbits __asm__ ("CFGCON");
volatile unsigned int        DDPCON;
typedef struct {
  unsigned TDOEN:1;
  unsigned :1;
  unsigned TROEN:1;
  unsigned JTAGEN:1;
  unsigned :8;
  unsigned PMDLOCK:1;
  unsigned IOLOCK:1;
} __DDPCONbits_t;
volatile __DDPCONbits_t DDPCONbits __asm__ ("DDPCON");
volatile unsigned int        DEVID;
typedef struct {
  unsigned DEVID:28;
  unsigned VER:4;
} __DEVIDbits_t;
volatile __DEVIDbits_t DEVIDbits __asm__ ("DEVID");
volatile unsigned int        SYSKEY;
volatile unsigned int        SYSKEYCLR;
volatile unsigned int        SYSKEYSET;
volatile unsigned int        SYSKEYINV;
volatile unsigned int        PMD1;
typedef struct {
  unsigned AD1MD:1;
  unsigned :7;
  unsigned CTMUMD:1;
  unsigned :3;
  unsigned CVRMD:1;
} __PMD1bits_t;
volatile __PMD1bits_t PMD1bits __asm__ ("PMD1");
volatile unsigned int        PMD1CLR;
volatile unsigned int        PMD1SET;
volatile unsigned int        PMD1INV;
volatile unsigned int        PMD2;
typedef struct {
  unsigned CMP1MD:1;
  unsigned CMP2MD:1;
} __PMD2bits_t;
volatile __PMD2bits_t PMD2bits __asm__ ("PMD2");
volatile unsigned int        PMD2CLR;
volatile unsigned int        PMD2SET;
volatile unsigned int        PMD2INV;
volatile unsigned int        PMD3;
typedef struct {
  unsigned IC1MD:1;
  unsigned IC2MD:1;
  unsigned IC3MD:1;
  unsigned IC4MD:1;
  unsigned IC5MD:1;
  unsigned :11;
  unsigned OC1MD:1;
  unsigned OC2MD:1;
  unsigned OC3MD:1;
  unsigned OC4MD:1;
  unsigned OC5MD:1;
} __PMD3bits_t;
volatile __PMD3bits_t PMD3bits __asm__ ("PMD3");
volatile unsigned int        PMD3CLR;
volatile unsigned int        PMD3SET;
volatile unsigned int        PMD3INV;
volatile unsigned int        PMD4;
typedef struct {
  unsigned T1MD:1;
  unsigned T2MD:1;
  unsigned T3MD:1;
  unsigned T4MD:1;
  unsigned T5MD:1;
} __PMD4bits_t;
volatile __PMD4bits_t PMD4bits __asm__ ("PMD4");
volatile unsigned int        PMD4CLR;
volatile unsigned int        PMD4SET;
volatile unsigned int        PMD4INV;
volatile unsigned int        PMD5;
typedef struct {
  unsigned U1MD:1;
  unsigned U2MD:1;
  unsigned U3MD:1;
  unsigned U4MD:1;
  unsigned :4;
  unsigned SPI1MD:1;
  unsigned SPI2MD:1;
  unsigned :6;
  unsigned I2C1MD:1;
  unsigned I2C2MD:1;
  unsigned :6;
  unsigned USB1MD:1;
} __PMD5bits_t;
volatile __PMD5bits_t PMD5bits __asm__ ("PMD5");
volatile unsigned int        PMD5CLR;
volatile unsigned int        PMD5SET;
volatile unsigned int        PMD5INV;
volatile unsigned int        PMD6;
typedef struct {
  unsigned RTCCMD:1;
  unsigned REFOMD:1;
  unsigned :14;
  unsigned PMPMD:1;
} __PMD6bits_t;
volatile __PMD6bits_t PMD6bits __asm__ ("PMD6");
volatile unsigned int        PMD6CLR;
volatile unsigned int        PMD6SET;
volatile unsigned int        PMD6INV;
volatile unsigned int        NVMCON;
typedef union {
  struct {
    unsigned NVMOP:4;
    unsigned :7;
    unsigned LVDSTAT:1;
    unsigned LVDERR:1;
    unsigned WRERR:1;
    unsigned WREN:1;
    unsigned WR:1;
  };
  struct {
    unsigned NVMOP0:1;
    unsigned NVMOP1:1;
    unsigned NVMOP2:1;
    unsigned NVMOP3:1;
  };
  struct {
    unsigned PROGOP:4;
  };
  struct {
    unsigned PROGOP0:1;
    unsigned PROGOP1:1;
    unsigned PROGOP2:1;
    unsigned PROGOP3:1;
  };
  struct {
    unsigned w:32;
  };
} __NVMCONbits_t;
volatile __NVMCONbits_t NVMCONbits __asm__ ("NVMCON");
volatile unsigned int        NVMCONCLR;
volatile unsigned int        NVMCONSET;
volatile unsigned int        NVMCONINV;
volatile unsigned int        NVMKEY;
volatile unsigned int        NVMADDR;
volatile unsigned int        NVMADDRCLR;
volatile unsigned int        NVMADDRSET;
volatile unsigned int        NVMADDRINV;
volatile unsigned int        NVMDATA;
volatile unsigned int        NVMSRCADDR;
volatile unsigned int        RCON;
typedef union {
  struct {
    unsigned POR:1;
    unsigned BOR:1;
    unsigned IDLE:1;
    unsigned SLEEP:1;
    unsigned WDTO:1;
    unsigned :1;
    unsigned SWR:1;
    unsigned EXTR:1;
    unsigned VREGS:1;
    unsigned CMR:1;
    unsigned :19;
    unsigned HVDR:1;
  };
  struct {
    unsigned w:32;
  };
} __RCONbits_t;
volatile __RCONbits_t RCONbits __asm__ ("RCON");
volatile unsigned int        RCONCLR;
volatile unsigned int        RCONSET;
volatile unsigned int        RCONINV;
volatile unsigned int        RSWRST;
typedef union {
  struct {
    unsigned SWRST:1;
  };
  struct {
    unsigned w:32;
  };
} __RSWRSTbits_t;
volatile __RSWRSTbits_t RSWRSTbits __asm__ ("RSWRST");
volatile unsigned int        RSWRSTCLR;
volatile unsigned int        RSWRSTSET;
volatile unsigned int        RSWRSTINV;
volatile unsigned int        INT1R;
typedef struct {
  unsigned INT1R:4;
} __INT1Rbits_t;
