rogermc2/MB_Ada/src/p32mx470f512.h
volatile __INT1Rbits_t INT1Rbits __asm__ ("INT1R");
volatile unsigned int        INT2R;
typedef struct {
  unsigned INT2R:4;
} __INT2Rbits_t;
volatile __INT2Rbits_t INT2Rbits __asm__ ("INT2R");
volatile unsigned int        INT3R;
typedef struct {
  unsigned INT3R:4;
} __INT3Rbits_t;
volatile __INT3Rbits_t INT3Rbits __asm__ ("INT3R");
volatile unsigned int        INT4R;
typedef struct {
  unsigned INT4R:4;
} __INT4Rbits_t;
volatile __INT4Rbits_t INT4Rbits __asm__ ("INT4R");
volatile unsigned int        T2CKR;
typedef struct {
  unsigned T2CKR:4;
} __T2CKRbits_t;
volatile __T2CKRbits_t T2CKRbits __asm__ ("T2CKR");
volatile unsigned int        T3CKR;
typedef struct {
  unsigned T3CKR:4;
} __T3CKRbits_t;
volatile __T3CKRbits_t T3CKRbits __asm__ ("T3CKR");
volatile unsigned int        T4CKR;
typedef struct {
  unsigned T4CKR:4;
} __T4CKRbits_t;
volatile __T4CKRbits_t T4CKRbits __asm__ ("T4CKR");
volatile unsigned int        T5CKR;
typedef struct {
  unsigned T5CKR:4;
} __T5CKRbits_t;
volatile __T5CKRbits_t T5CKRbits __asm__ ("T5CKR");
volatile unsigned int        IC1R;
typedef struct {
  unsigned IC1R:4;
} __IC1Rbits_t;
volatile __IC1Rbits_t IC1Rbits __asm__ ("IC1R");
volatile unsigned int        IC2R;
typedef struct {
  unsigned IC2R:4;
} __IC2Rbits_t;
volatile __IC2Rbits_t IC2Rbits __asm__ ("IC2R");
volatile unsigned int        IC3R;
typedef struct {
  unsigned IC3R:4;
} __IC3Rbits_t;
volatile __IC3Rbits_t IC3Rbits __asm__ ("IC3R");
volatile unsigned int        IC4R;
typedef struct {
  unsigned IC4R:4;
} __IC4Rbits_t;
volatile __IC4Rbits_t IC4Rbits __asm__ ("IC4R");
volatile unsigned int        IC5R;
typedef struct {
  unsigned IC5R:4;
} __IC5Rbits_t;
volatile __IC5Rbits_t IC5Rbits __asm__ ("IC5R");
volatile unsigned int        OCFAR;
typedef struct {
  unsigned OCFAR:4;
} __OCFARbits_t;
volatile __OCFARbits_t OCFARbits __asm__ ("OCFAR");
volatile unsigned int        OCFBR;
typedef struct {
  unsigned OCFBR:4;
} __OCFBRbits_t;
volatile __OCFBRbits_t OCFBRbits __asm__ ("OCFBR");
volatile unsigned int        U1RXR;
typedef struct {
  unsigned U1RXR:4;
} __U1RXRbits_t;
volatile __U1RXRbits_t U1RXRbits __asm__ ("U1RXR");
volatile unsigned int        U1CTSR;
typedef struct {
  unsigned U1CTSR:4;
} __U1CTSRbits_t;
volatile __U1CTSRbits_t U1CTSRbits __asm__ ("U1CTSR");
volatile unsigned int        U2RXR;
typedef struct {
  unsigned U2RXR:4;
} __U2RXRbits_t;
volatile __U2RXRbits_t U2RXRbits __asm__ ("U2RXR");
volatile unsigned int        U2CTSR;
typedef struct {
  unsigned U2CTSR:4;
} __U2CTSRbits_t;
volatile __U2CTSRbits_t U2CTSRbits __asm__ ("U2CTSR");
volatile unsigned int        U3RXR;
typedef struct {
  unsigned U3RXR:4;
} __U3RXRbits_t;
volatile __U3RXRbits_t U3RXRbits __asm__ ("U3RXR");
volatile unsigned int        U3CTSR;
typedef struct {
  unsigned U3CTSR:4;
} __U3CTSRbits_t;
volatile __U3CTSRbits_t U3CTSRbits __asm__ ("U3CTSR");
volatile unsigned int        U4RXR;
typedef struct {
  unsigned U4RXR:4;
} __U4RXRbits_t;
volatile __U4RXRbits_t U4RXRbits __asm__ ("U4RXR");
volatile unsigned int        U4CTSR;
typedef struct {
  unsigned U4CTSR:4;
} __U4CTSRbits_t;
volatile __U4CTSRbits_t U4CTSRbits __asm__ ("U4CTSR");
volatile unsigned int        U5RXR;
typedef struct {
  unsigned U5RXR:4;
} __U5RXRbits_t;
volatile __U5RXRbits_t U5RXRbits __asm__ ("U5RXR");
volatile unsigned int        U5CTSR;
typedef struct {
  unsigned U5CTSR:4;
} __U5CTSRbits_t;
volatile __U5CTSRbits_t U5CTSRbits __asm__ ("U5CTSR");
volatile unsigned int        SDI1R;
typedef struct {
  unsigned SDI1R:4;
} __SDI1Rbits_t;
volatile __SDI1Rbits_t SDI1Rbits __asm__ ("SDI1R");
volatile unsigned int        SS1R;
typedef struct {
  unsigned SS1R:4;
} __SS1Rbits_t;
volatile __SS1Rbits_t SS1Rbits __asm__ ("SS1R");
volatile unsigned int        SDI2R;
typedef struct {
  unsigned SDI2R:4;
} __SDI2Rbits_t;
volatile __SDI2Rbits_t SDI2Rbits __asm__ ("SDI2R");
volatile unsigned int        SS2R;
typedef struct {
  unsigned SS2R:4;
} __SS2Rbits_t;
volatile __SS2Rbits_t SS2Rbits __asm__ ("SS2R");
volatile unsigned int        REFCLKIR;
typedef struct {
  unsigned REFCLKIR:4;
} __REFCLKIRbits_t;
volatile __REFCLKIRbits_t REFCLKIRbits __asm__ ("REFCLKIR");
volatile unsigned int        RPB0R;
typedef struct {
  unsigned RPB0R:4;
} __RPB0Rbits_t;
volatile __RPB0Rbits_t RPB0Rbits __asm__ ("RPB0R");
volatile unsigned int        RPB1R;
typedef struct {
  unsigned RPB1R:4;
} __RPB1Rbits_t;
volatile __RPB1Rbits_t RPB1Rbits __asm__ ("RPB1R");
volatile unsigned int        RPB2R;
typedef struct {
  unsigned RPB2R:4;
} __RPB2Rbits_t;
volatile __RPB2Rbits_t RPB2Rbits __asm__ ("RPB2R");
volatile unsigned int        RPB3R;
typedef struct {
  unsigned RPB3R:4;
} __RPB3Rbits_t;
volatile __RPB3Rbits_t RPB3Rbits __asm__ ("RPB3R");
volatile unsigned int        RPB5R;
typedef struct {
  unsigned RPB5R:4;
} __RPB5Rbits_t;
volatile __RPB5Rbits_t RPB5Rbits __asm__ ("RPB5R");
volatile unsigned int        RPB6R;
typedef struct {
  unsigned RPB6R:4;
} __RPB6Rbits_t;
volatile __RPB6Rbits_t RPB6Rbits __asm__ ("RPB6R");
volatile unsigned int        RPB7R;
typedef struct {
  unsigned RPB7R:4;
} __RPB7Rbits_t;
volatile __RPB7Rbits_t RPB7Rbits __asm__ ("RPB7R");
volatile unsigned int        RPB8R;
typedef struct {
  unsigned RPB8R:4;
} __RPB8Rbits_t;
volatile __RPB8Rbits_t RPB8Rbits __asm__ ("RPB8R");
volatile unsigned int        RPB9R;
typedef struct {
  unsigned RPB9R:4;
} __RPB9Rbits_t;
volatile __RPB9Rbits_t RPB9Rbits __asm__ ("RPB9R");
volatile unsigned int        RPB10R;
typedef struct {
  unsigned RPB10R:4;
} __RPB10Rbits_t;
volatile __RPB10Rbits_t RPB10Rbits __asm__ ("RPB10R");
volatile unsigned int        RPB14R;
typedef struct {
  unsigned RPB14R:4;
} __RPB14Rbits_t;
volatile __RPB14Rbits_t RPB14Rbits __asm__ ("RPB14R");
volatile unsigned int        RPB15R;
typedef struct {
  unsigned RPB15R:4;
} __RPB15Rbits_t;
volatile __RPB15Rbits_t RPB15Rbits __asm__ ("RPB15R");
volatile unsigned int        RPD0R;
typedef struct {
  unsigned RPD0R:4;
} __RPD0Rbits_t;
volatile __RPD0Rbits_t RPD0Rbits __asm__ ("RPD0R");
volatile unsigned int        RPD1R;
typedef struct {
  unsigned RPD1R:4;
} __RPD1Rbits_t;
