rogermc2/MB_Ada/src/p32mx470f512.h
volatile __RPD1Rbits_t RPD1Rbits __asm__ ("RPD1R");
volatile unsigned int        RPD2R;
typedef struct {
  unsigned RPD2R:4;
} __RPD2Rbits_t;
volatile __RPD2Rbits_t RPD2Rbits __asm__ ("RPD2R");
volatile unsigned int        RPD3R;
typedef struct {
  unsigned RPD3R:4;
} __RPD3Rbits_t;
volatile __RPD3Rbits_t RPD3Rbits __asm__ ("RPD3R");
volatile unsigned int        RPD4R;
typedef struct {
  unsigned RPD4R:4;
} __RPD4Rbits_t;
volatile __RPD4Rbits_t RPD4Rbits __asm__ ("RPD4R");
volatile unsigned int        RPD5R;
typedef struct {
  unsigned RPD5R:4;
} __RPD5Rbits_t;
volatile __RPD5Rbits_t RPD5Rbits __asm__ ("RPD5R");
volatile unsigned int        RPD8R;
typedef struct {
  unsigned RPD8R:4;
} __RPD8Rbits_t;
volatile __RPD8Rbits_t RPD8Rbits __asm__ ("RPD8R");
volatile unsigned int        RPD9R;
typedef struct {
  unsigned RPD9R:4;
} __RPD9Rbits_t;
volatile __RPD9Rbits_t RPD9Rbits __asm__ ("RPD9R");
volatile unsigned int        RPD10R;
typedef struct {
  unsigned RPD10R:4;
} __RPD10Rbits_t;
volatile __RPD10Rbits_t RPD10Rbits __asm__ ("RPD10R");
volatile unsigned int        RPD11R;
typedef struct {
  unsigned RPD11R:4;
} __RPD11Rbits_t;
volatile __RPD11Rbits_t RPD11Rbits __asm__ ("RPD11R");
volatile unsigned int        RPD12R;
typedef struct {
  unsigned RPD12R:4;
} __RPD12Rbits_t;
volatile __RPD12Rbits_t RPD12Rbits __asm__ ("RPD12R");
volatile unsigned int        RPD14R;
typedef struct {
  unsigned RPD14R:4;
} __RPD14Rbits_t;
volatile __RPD14Rbits_t RPD14Rbits __asm__ ("RPD14R");
volatile unsigned int        RPD15R;
typedef struct {
  unsigned RPD15R:4;
} __RPD15Rbits_t;
volatile __RPD15Rbits_t RPD15Rbits __asm__ ("RPD15R");
volatile unsigned int        RPE3R;
typedef struct {
  unsigned RPE3R:4;
} __RPE3Rbits_t;
volatile __RPE3Rbits_t RPE3Rbits __asm__ ("RPE3R");
volatile unsigned int        RPE5R;
typedef struct {
  unsigned RPE5R:4;
} __RPE5Rbits_t;
volatile __RPE5Rbits_t RPE5Rbits __asm__ ("RPE5R");
volatile unsigned int        RPE8R;
typedef struct {
  unsigned RPE8R:4;
} __RPE8Rbits_t;
volatile __RPE8Rbits_t RPE8Rbits __asm__ ("RPE8R");
volatile unsigned int        RPE9R;
typedef struct {
  unsigned RPE9R:4;
} __RPE9Rbits_t;
volatile __RPE9Rbits_t RPE9Rbits __asm__ ("RPE9R");
volatile unsigned int        RPF0R;
typedef struct {
  unsigned RPF0R:4;
} __RPF0Rbits_t;
volatile __RPF0Rbits_t RPF0Rbits __asm__ ("RPF0R");
volatile unsigned int        RPF1R;
typedef struct {
  unsigned RPF1R:4;
} __RPF1Rbits_t;
volatile __RPF1Rbits_t RPF1Rbits __asm__ ("RPF1R");
volatile unsigned int        RPF2R;
typedef struct {
  unsigned RPF2R:4;
} __RPF2Rbits_t;
volatile __RPF2Rbits_t RPF2Rbits __asm__ ("RPF2R");
volatile unsigned int        RPF3R;
typedef struct {
  unsigned RPF3R:4;
} __RPF3Rbits_t;
volatile __RPF3Rbits_t RPF3Rbits __asm__ ("RPF3R");
volatile unsigned int        RPF4R;
typedef struct {
  unsigned RPF4R:4;
} __RPF4Rbits_t;
volatile __RPF4Rbits_t RPF4Rbits __asm__ ("RPF4R");
volatile unsigned int        RPF5R;
typedef struct {
  unsigned RPF5R:4;
} __RPF5Rbits_t;
volatile __RPF5Rbits_t RPF5Rbits __asm__ ("RPF5R");
volatile unsigned int        RPF6R;
typedef struct {
  unsigned RPF6R:4;
} __RPF6Rbits_t;
volatile __RPF6Rbits_t RPF6Rbits __asm__ ("RPF6R");
volatile unsigned int        RPG6R;
typedef struct {
  unsigned RPG6R:4;
} __RPG6Rbits_t;
volatile __RPG6Rbits_t RPG6Rbits __asm__ ("RPG6R");
volatile unsigned int        RPG7R;
typedef struct {
  unsigned RPG7R:4;
} __RPG7Rbits_t;
volatile __RPG7Rbits_t RPG7Rbits __asm__ ("RPG7R");
volatile unsigned int        RPG8R;
typedef struct {
  unsigned RPG8R:4;
} __RPG8Rbits_t;
volatile __RPG8Rbits_t RPG8Rbits __asm__ ("RPG8R");
volatile unsigned int        RPG9R;
typedef struct {
  unsigned RPG9R:4;
} __RPG9Rbits_t;
volatile __RPG9Rbits_t RPG9Rbits __asm__ ("RPG9R");
volatile unsigned int        INTCON;
typedef union {
  struct {
    unsigned INT0EP:1;
    unsigned INT1EP:1;
    unsigned INT2EP:1;
    unsigned INT3EP:1;
    unsigned INT4EP:1;
    unsigned :3;
    unsigned TPC:3;
    unsigned :1;
    unsigned MVEC:1;
    unsigned :3;
    unsigned SS0:1;
  };
  struct {
    unsigned w:32;
  };
} __INTCONbits_t;
volatile __INTCONbits_t INTCONbits __asm__ ("INTCON");
volatile unsigned int        INTCONCLR;
volatile unsigned int        INTCONSET;
volatile unsigned int        INTCONINV;
volatile unsigned int        INTSTAT;
typedef struct {
  unsigned VEC:6;
  unsigned :2;
  unsigned SRIPL:3;
} __INTSTATbits_t;
volatile __INTSTATbits_t INTSTATbits __asm__ ("INTSTAT");
volatile unsigned int        IPTMR;
volatile unsigned int        IPTMRCLR;
volatile unsigned int        IPTMRSET;
volatile unsigned int        IPTMRINV;
volatile unsigned int        IFS0;
typedef union {
  struct {
    unsigned CTIF:1;
    unsigned CS0IF:1;
    unsigned CS1IF:1;
    unsigned INT0IF:1;
    unsigned T1IF:1;
    unsigned IC1EIF:1;
    unsigned IC1IF:1;
    unsigned OC1IF:1;
    unsigned INT1IF:1;
    unsigned T2IF:1;
    unsigned IC2EIF:1;
    unsigned IC2IF:1;
    unsigned OC2IF:1;
    unsigned INT2IF:1;
    unsigned T3IF:1;
    unsigned IC3EIF:1;
    unsigned IC3IF:1;
    unsigned OC3IF:1;
    unsigned INT3IF:1;
    unsigned T4IF:1;
    unsigned IC4EIF:1;
    unsigned IC4IF:1;
    unsigned OC4IF:1;
    unsigned INT4IF:1;
    unsigned T5IF:1;
    unsigned IC5EIF:1;
    unsigned IC5IF:1;
    unsigned OC5IF:1;
    unsigned AD1IF:1;
    unsigned FSCMIF:1;
    unsigned RTCCIF:1;
    unsigned FCEIF:1;
  };
  struct {
    unsigned w:32;
  };
} __IFS0bits_t;
volatile __IFS0bits_t IFS0bits __asm__ ("IFS0");
volatile unsigned int        IFS0CLR;
volatile unsigned int        IFS0SET;
volatile unsigned int        IFS0INV;
volatile unsigned int        IFS1;
typedef union {
  struct {
    unsigned CMP1IF:1;
    unsigned CMP2IF:1;
    unsigned USBIF:1;
    unsigned SPI1EIF:1;
    unsigned SPI1RXIF:1;
    unsigned SPI1TXIF:1;
    unsigned U1EIF:1;
    unsigned U1RXIF:1;
    unsigned U1TXIF:1;
    unsigned I2C1BIF:1;
    unsigned I2C1SIF:1;
    unsigned I2C1MIF:1;
    unsigned CNAIF:1;
    unsigned CNBIF:1;
    unsigned CNCIF:1;
    unsigned CNDIF:1;
    unsigned CNEIF:1;
    unsigned CNFIF:1;
    unsigned CNGIF:1;
    unsigned PMPIF:1;
    unsigned PMPEIF:1;
    unsigned SPI2EIF:1;
    unsigned SPI2RXIF:1;
    unsigned SPI2TXIF:1;
    unsigned U2EIF:1;
    unsigned U2RXIF:1;
    unsigned U2TXIF:1;
    unsigned I2C2BIF:1;
    unsigned I2C2SIF:1;
    unsigned I2C2MIF:1;
    unsigned U3EIF:1;
    unsigned U3RXIF:1;
  };
  struct {
    unsigned w:32;
  };
} __IFS1bits_t;
