rogermc2/MB_Ada/src/p32mx470f512.h
volatile __IFS1bits_t IFS1bits __asm__ ("IFS1");
volatile unsigned int        IFS1CLR;
volatile unsigned int        IFS1SET;
volatile unsigned int        IFS1INV;
volatile unsigned int        IFS2;
typedef struct {
  unsigned U3TXIF:1;
  unsigned U4EIF:1;
  unsigned U4RXIF:1;
  unsigned U4TXIF:1;
  unsigned :3;
  unsigned CTMUIF:1;
  unsigned DMA0IF:1;
  unsigned DMA1IF:1;
  unsigned DMA2IF:1;
  unsigned DMA3IF:1;
} __IFS2bits_t;
volatile __IFS2bits_t IFS2bits __asm__ ("IFS2");
volatile unsigned int        IFS2CLR;
volatile unsigned int        IFS2SET;
volatile unsigned int        IFS2INV;
volatile unsigned int        IEC0;
typedef union {
  struct {
    unsigned CTIE:1;
    unsigned CS0IE:1;
    unsigned CS1IE:1;
    unsigned INT0IE:1;
    unsigned T1IE:1;
    unsigned IC1EIE:1;
    unsigned IC1IE:1;
    unsigned OC1IE:1;
    unsigned INT1IE:1;
    unsigned T2IE:1;
    unsigned IC2EIE:1;
    unsigned IC2IE:1;
    unsigned OC2IE:1;
    unsigned INT2IE:1;
    unsigned T3IE:1;
    unsigned IC3EIE:1;
    unsigned IC3IE:1;
    unsigned OC3IE:1;
    unsigned INT3IE:1;
    unsigned T4IE:1;
    unsigned IC4EIE:1;
    unsigned IC4IE:1;
    unsigned OC4IE:1;
    unsigned INT4IE:1;
    unsigned T5IE:1;
    unsigned IC5EIE:1;
    unsigned IC5IE:1;
    unsigned OC5IE:1;
    unsigned AD1IE:1;
    unsigned FSCMIE:1;
    unsigned RTCCIE:1;
    unsigned FCEIE:1;
  };
  struct {
    unsigned w:32;
  };
} __IEC0bits_t;
volatile __IEC0bits_t IEC0bits __asm__ ("IEC0");
volatile unsigned int        IEC0CLR;
volatile unsigned int        IEC0SET;
volatile unsigned int        IEC0INV;
volatile unsigned int        IEC1;
typedef union {
  struct {
    unsigned CMP1IE:1;
    unsigned CMP2IE:1;
    unsigned USBIE:1;
    unsigned SPI1EIE:1;
    unsigned SPI1RXIE:1;
    unsigned SPI1TXIE:1;
    unsigned U1EIE:1;
    unsigned U1RXIE:1;
    unsigned U1TXIE:1;
    unsigned I2C1BIE:1;
    unsigned I2C1SIE:1;
    unsigned I2C1MIE:1;
    unsigned CNAIE:1;
    unsigned CNBIE:1;
    unsigned CNCIE:1;
    unsigned CNDIE:1;
    unsigned CNEIE:1;
    unsigned CNFIE:1;
    unsigned CNGIE:1;
    unsigned PMPIE:1;
    unsigned PMPEIE:1;
    unsigned SPI2EIE:1;
    unsigned SPI2RXIE:1;
    unsigned SPI2TXIE:1;
    unsigned U2EIE:1;
    unsigned U2RXIE:1;
    unsigned U2TXIE:1;
    unsigned I2C2BIE:1;
    unsigned I2C2SIE:1;
    unsigned I2CMIE:1;
    unsigned U3EIE:1;
    unsigned U3RXIE:1;
  };
  struct {
    unsigned w:32;
  };
} __IEC1bits_t;
volatile __IEC1bits_t IEC1bits __asm__ ("IEC1");
volatile unsigned int        IEC1CLR;
volatile unsigned int        IEC1SET;
volatile unsigned int        IEC1INV;
volatile unsigned int        IEC2;
typedef struct {
  unsigned U3TXIE:1;
  unsigned U4EIE:1;
  unsigned U4RXIE:1;
  unsigned U4TXIE:1;
  unsigned :3;
  unsigned CTMUIE:1;
  unsigned DMA0IE:1;
  unsigned DMA1IE:1;
  unsigned DMA2IE:1;
  unsigned DMA3IE:1;
} __IEC2bits_t;
volatile __IEC2bits_t IEC2bits __asm__ ("IEC2");
volatile unsigned int        IEC2CLR;
volatile unsigned int        IEC2SET;
volatile unsigned int        IEC2INV;
volatile unsigned int        IPC0;
typedef union {
  struct {
    unsigned CTIS:2;
    unsigned CTIP:3;
    unsigned :3;
    unsigned CS0IS:2;
    unsigned CS0IP:3;
    unsigned :3;
    unsigned CS1IS:2;
    unsigned CS1IP:3;
    unsigned :3;
    unsigned INT0IS:2;
    unsigned INT0IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC0bits_t;
volatile __IPC0bits_t IPC0bits __asm__ ("IPC0");
volatile unsigned int        IPC0CLR;
volatile unsigned int        IPC0SET;
volatile unsigned int        IPC0INV;
volatile unsigned int        IPC1;
typedef union {
  struct {
    unsigned T1IS:2;
    unsigned T1IP:3;
    unsigned :3;
    unsigned IC1IS:2;
    unsigned IC1IP:3;
    unsigned :3;
    unsigned OC1IS:2;
    unsigned OC1IP:3;
    unsigned :3;
    unsigned INT1IS:2;
    unsigned INT1IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC1bits_t;
volatile __IPC1bits_t IPC1bits __asm__ ("IPC1");
volatile unsigned int        IPC1CLR;
volatile unsigned int        IPC1SET;
volatile unsigned int        IPC1INV;
volatile unsigned int        IPC2;
typedef union {
  struct {
    unsigned T2IS:2;
    unsigned T2IP:3;
    unsigned :3;
    unsigned IC2IS:2;
    unsigned IC2IP:3;
    unsigned :3;
    unsigned OC2IS:2;
    unsigned OC2IP:3;
    unsigned :3;
    unsigned INT2IS:2;
    unsigned INT2IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC2bits_t;
volatile __IPC2bits_t IPC2bits __asm__ ("IPC2");
volatile unsigned int        IPC2CLR;
volatile unsigned int        IPC2SET;
volatile unsigned int        IPC2INV;
volatile unsigned int        IPC3;
typedef union {
  struct {
    unsigned T3IS:2;
    unsigned T3IP:3;
    unsigned :3;
    unsigned IC3IS:2;
    unsigned IC3IP:3;
    unsigned :3;
    unsigned OC3IS:2;
    unsigned OC3IP:3;
    unsigned :3;
    unsigned INT3IS:2;
    unsigned INT3IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC3bits_t;
volatile __IPC3bits_t IPC3bits __asm__ ("IPC3");
volatile unsigned int        IPC3CLR;
volatile unsigned int        IPC3SET;
volatile unsigned int        IPC3INV;
volatile unsigned int        IPC4;
typedef union {
  struct {
    unsigned T4IS:2;
    unsigned T4IP:3;
    unsigned :3;
    unsigned IC4IS:2;
    unsigned IC4IP:3;
    unsigned :3;
    unsigned OC4IS:2;
    unsigned OC4IP:3;
    unsigned :3;
    unsigned INT4IS:2;
    unsigned INT4IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC4bits_t;
volatile __IPC4bits_t IPC4bits __asm__ ("IPC4");
volatile unsigned int        IPC4CLR;
volatile unsigned int        IPC4SET;
volatile unsigned int        IPC4INV;
volatile unsigned int        IPC5;
typedef union {
  struct {
    unsigned T5IS:2;
    unsigned T5IP:3;
    unsigned :3;
    unsigned IC5IS:2;
    unsigned IC5IP:3;
    unsigned :3;
    unsigned OC5IS:2;
    unsigned OC5IP:3;
    unsigned :3;
    unsigned AD1IS:2;
    unsigned AD1IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC5bits_t;
volatile __IPC5bits_t IPC5bits __asm__ ("IPC5");
volatile unsigned int        IPC5CLR;
volatile unsigned int        IPC5SET;
volatile unsigned int        IPC5INV;
volatile unsigned int        IPC6;
typedef union {
  struct {
    unsigned FSCMIS:2;
    unsigned FSCMIP:3;
    unsigned :3;
    unsigned RTCCIS:2;
    unsigned RTCCIP:3;
    unsigned :3;
    unsigned FCEIS:2;
    unsigned FCEIP:3;
    unsigned :3;
    unsigned CMP1IS:2;
    unsigned CMP1IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC6bits_t;
volatile __IPC6bits_t IPC6bits __asm__ ("IPC6");
volatile unsigned int        IPC6CLR;
volatile unsigned int        IPC6SET;
volatile unsigned int        IPC6INV;
volatile unsigned int        IPC7;
typedef union {
  struct {
    unsigned CMP2IS:2;
    unsigned CMP2IP:3;
    unsigned :3;
    unsigned USBIS:2;
    unsigned USBIP:3;
    unsigned :3;
    unsigned SPI1IS:2;
    unsigned SPI1IP:3;
    unsigned :3;
    unsigned U1IS:2;
    unsigned U1IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC7bits_t;
