rogermc2/MB_Ada/src/p32mx470f512.h
volatile __IPC7bits_t IPC7bits __asm__ ("IPC7");
volatile unsigned int        IPC7CLR;
volatile unsigned int        IPC7SET;
volatile unsigned int        IPC7INV;
volatile unsigned int        IPC8;
typedef union {
  struct {
    unsigned I2C1IS:2;
    unsigned I2C1IP:3;
    unsigned :3;
    unsigned CNIS:2;
    unsigned CNIP:3;
    unsigned :3;
    unsigned PMPIS:2;
    unsigned PMPIP:3;
    unsigned :3;
    unsigned SPI2IS:2;
    unsigned SPI2IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC8bits_t;
volatile __IPC8bits_t IPC8bits __asm__ ("IPC8");
volatile unsigned int        IPC8CLR;
volatile unsigned int        IPC8SET;
volatile unsigned int        IPC8INV;
volatile unsigned int        IPC9;
typedef union {
  struct {
    unsigned U2IS:2;
    unsigned U2IP:3;
    unsigned :3;
    unsigned I2C2IS:2;
    unsigned I2C2IP:3;
    unsigned :3;
    unsigned U3IS:2;
    unsigned U3IP:3;
    unsigned :3;
    unsigned U4IS:2;
    unsigned U4IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC9bits_t;
volatile __IPC9bits_t IPC9bits __asm__ ("IPC9");
volatile unsigned int        IPC9CLR;
volatile unsigned int        IPC9SET;
volatile unsigned int        IPC9INV;
volatile unsigned int        IPC10;
typedef union {
  struct {
    unsigned :8;
    unsigned CTMUIP:2;
    unsigned CTMUIS:3;
    unsigned :3;
    unsigned DMA0IS:2;
    unsigned DMA0IP:3;
    unsigned :3;
    unsigned DMA1IS:2;
    unsigned DMA1IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC10bits_t;
volatile __IPC10bits_t IPC10bits __asm__ ("IPC10");
volatile unsigned int        IPC10CLR;
volatile unsigned int        IPC10SET;
volatile unsigned int        IPC10INV;
volatile unsigned int        IPC11;
typedef union {
  struct {
    unsigned DMA2IS:2;
    unsigned DMA2IP:3;
    unsigned :3;
    unsigned DMA3IS:2;
    unsigned DMA3IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC11bits_t;
volatile __IPC11bits_t IPC11bits __asm__ ("IPC11");
volatile unsigned int        IPC11CLR;
volatile unsigned int        IPC11SET;
volatile unsigned int        IPC11INV;
volatile unsigned int        BMXCON;
typedef union {
  struct {
    unsigned BMXARB:3;
    unsigned :3;
    unsigned BMXWSDRM:1;
    unsigned :9;
    unsigned BMXERRIS:1;
    unsigned BMXERRDS:1;
    unsigned BMXERRDMA:1;
    unsigned BMXERRICD:1;
    unsigned BMXERRIXI:1;
    unsigned :5;
    unsigned BMXCHEDMA:1;
  };
  struct {
    unsigned w:32;
  };
} __BMXCONbits_t;
volatile __BMXCONbits_t BMXCONbits __asm__ ("BMXCON");
volatile unsigned int        BMXCONCLR;
volatile unsigned int        BMXCONSET;
volatile unsigned int        BMXCONINV;
volatile unsigned int        BMXDKPBA;
volatile unsigned int        BMXDKPBACLR;
volatile unsigned int        BMXDKPBASET;
volatile unsigned int        BMXDKPBAINV;
volatile unsigned int        BMXDUDBA;
volatile unsigned int        BMXDUDBACLR;
volatile unsigned int        BMXDUDBASET;
volatile unsigned int        BMXDUDBAINV;
volatile unsigned int        BMXDUPBA;
volatile unsigned int        BMXDUPBACLR;
volatile unsigned int        BMXDUPBASET;
volatile unsigned int        BMXDUPBAINV;
volatile unsigned int        BMXDRMSZ;
volatile unsigned int        BMXPUPBA;
volatile unsigned int        BMXPUPBACLR;
volatile unsigned int        BMXPUPBASET;
volatile unsigned int        BMXPUPBAINV;
volatile unsigned int        BMXPFMSZ;
volatile unsigned int        BMXBOOTSZ;
volatile unsigned int        DMACON;
typedef union {
  struct {
    unsigned :11;
    unsigned DMABUSY:1;
    unsigned SUSPEND:1;
    unsigned :2;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __DMACONbits_t;
volatile __DMACONbits_t DMACONbits __asm__ ("DMACON");
volatile unsigned int        DMACONCLR;
volatile unsigned int        DMACONSET;
volatile unsigned int        DMACONINV;
volatile unsigned int        DMASTAT;
typedef union {
  struct {
    unsigned DMACH:3;
    unsigned RDWR:1;
  };
  struct {
    unsigned w:32;
  };
} __DMASTATbits_t;
volatile __DMASTATbits_t DMASTATbits __asm__ ("DMASTAT");
volatile unsigned int        DMASTATCLR;
volatile unsigned int        DMASTATSET;
volatile unsigned int        DMASTATINV;
volatile unsigned int        DMAADDR;
volatile unsigned int        DMAADDRCLR;
volatile unsigned int        DMAADDRSET;
volatile unsigned int        DMAADDRINV;
volatile unsigned int        DCRCCON;
typedef union {
  struct {
    unsigned CRCCH:3;
    unsigned :2;
    unsigned CRCTYP:1;
    unsigned CRCAPP:1;
    unsigned CRCEN:1;
    unsigned PLEN:5;
    unsigned :11;
    unsigned BITO:1;
    unsigned :2;
    unsigned WBO:1;
    unsigned BYTO:2;
  };
  struct {
    unsigned w:32;
  };
} __DCRCCONbits_t;
volatile __DCRCCONbits_t DCRCCONbits __asm__ ("DCRCCON");
volatile unsigned int        DCRCCONCLR;
volatile unsigned int        DCRCCONSET;
volatile unsigned int        DCRCCONINV;
volatile unsigned int        DCRCDATA;
volatile unsigned int        DCRCDATACLR;
volatile unsigned int        DCRCDATASET;
volatile unsigned int        DCRCDATAINV;
volatile unsigned int        DCRCXOR;
volatile unsigned int        DCRCXORCLR;
volatile unsigned int        DCRCXORSET;
volatile unsigned int        DCRCXORINV;
volatile unsigned int        DCH0CON;
typedef union {
  struct {
    unsigned CHPRI:2;
    unsigned CHEDET:1;
    unsigned :1;
    unsigned CHAEN:1;
    unsigned CHCHN:1;
    unsigned CHAED:1;
    unsigned CHEN:1;
    unsigned CHCHNS:1;
    unsigned :6;
    unsigned CHBUSY:1;
  };
  struct {
    unsigned w:32;
  };
} __DCH0CONbits_t;
volatile __DCH0CONbits_t DCH0CONbits __asm__ ("DCH0CON");
volatile unsigned int        DCH0CONCLR;
volatile unsigned int        DCH0CONSET;
volatile unsigned int        DCH0CONINV;
volatile unsigned int        DCH0ECON;
typedef union {
  struct {
    unsigned :3;
    unsigned AIRQEN:1;
    unsigned SIRQEN:1;
    unsigned PATEN:1;
    unsigned CABORT:1;
    unsigned CFORCE:1;
    unsigned CHSIRQ:8;
    unsigned CHAIRQ:8;
  };
  struct {
    unsigned w:32;
  };
} __DCH0ECONbits_t;
volatile __DCH0ECONbits_t DCH0ECONbits __asm__ ("DCH0ECON");
volatile unsigned int        DCH0ECONCLR;
volatile unsigned int        DCH0ECONSET;
volatile unsigned int        DCH0ECONINV;
volatile unsigned int        DCH0INT;
typedef union {
  struct {
    unsigned CHERIF:1;
    unsigned CHTAIF:1;
    unsigned CHCCIF:1;
    unsigned CHBCIF:1;
    unsigned CHDHIF:1;
    unsigned CHDDIF:1;
    unsigned CHSHIF:1;
    unsigned CHSDIF:1;
    unsigned :8;
    unsigned CHERIE:1;
    unsigned CHTAIE:1;
    unsigned CHCCIE:1;
    unsigned CHBCIE:1;
    unsigned CHDHIE:1;
    unsigned CHDDIE:1;
    unsigned CHSHIE:1;
    unsigned CHSDIE:1;
  };
  struct {
    unsigned w:32;
  };
} __DCH0INTbits_t;
volatile __DCH0INTbits_t DCH0INTbits __asm__ ("DCH0INT");
volatile unsigned int        DCH0INTCLR;
volatile unsigned int        DCH0INTSET;
volatile unsigned int        DCH0INTINV;
volatile unsigned int        DCH0SSA;
volatile unsigned int        DCH0SSACLR;
volatile unsigned int        DCH0SSASET;
volatile unsigned int        DCH0SSAINV;
volatile unsigned int        DCH0DSA;
volatile unsigned int        DCH0DSACLR;
volatile unsigned int        DCH0DSASET;
volatile unsigned int        DCH0DSAINV;
volatile unsigned int        DCH0SSIZ;
volatile unsigned int        DCH0SSIZCLR;
volatile unsigned int        DCH0SSIZSET;
volatile unsigned int        DCH0SSIZINV;
volatile unsigned int        DCH0DSIZ;
volatile unsigned int        DCH0DSIZCLR;
volatile unsigned int        DCH0DSIZSET;
volatile unsigned int        DCH0DSIZINV;
volatile unsigned int        DCH0SPTR;
volatile unsigned int        DCH0SPTRCLR;
volatile unsigned int        DCH0SPTRSET;
volatile unsigned int        DCH0SPTRINV;
volatile unsigned int        DCH0DPTR;
volatile unsigned int        DCH0DPTRCLR;
volatile unsigned int        DCH0DPTRSET;
volatile unsigned int        DCH0DPTRINV;
volatile unsigned int        DCH0CSIZ;
volatile unsigned int        DCH0CSIZCLR;
volatile unsigned int        DCH0CSIZSET;
volatile unsigned int        DCH0CSIZINV;
volatile unsigned int        DCH0CPTR;
volatile unsigned int        DCH0CPTRCLR;
volatile unsigned int        DCH0CPTRSET;
volatile unsigned int        DCH0CPTRINV;
volatile unsigned int        DCH0DAT;
volatile unsigned int        DCH0DATCLR;
volatile unsigned int        DCH0DATSET;
volatile unsigned int        DCH0DATINV;
volatile unsigned int        DCH1CON;
typedef union {
  struct {
    unsigned CHPRI:2;
    unsigned CHEDET:1;
    unsigned :1;
    unsigned CHAEN:1;
    unsigned CHCHN:1;
    unsigned CHAED:1;
    unsigned CHEN:1;
    unsigned CHCHNS:1;
    unsigned :6;
    unsigned CHBUSY:1;
  };
  struct {
    unsigned w:32;
  };
} __DCH1CONbits_t;
volatile __DCH1CONbits_t DCH1CONbits __asm__ ("DCH1CON");
volatile unsigned int        DCH1CONCLR;
volatile unsigned int        DCH1CONSET;
volatile unsigned int        DCH1CONINV;
volatile unsigned int        DCH1ECON;
typedef union {
  struct {
    unsigned :3;
    unsigned AIRQEN:1;
    unsigned SIRQEN:1;
    unsigned PATEN:1;
    unsigned CABORT:1;
    unsigned CFORCE:1;
    unsigned CHSIRQ:8;
    unsigned CHAIRQ:8;
  };
  struct {
    unsigned w:32;
  };
} __DCH1ECONbits_t;
volatile __DCH1ECONbits_t DCH1ECONbits __asm__ ("DCH1ECON");
volatile unsigned int        DCH1ECONCLR;
volatile unsigned int        DCH1ECONSET;
volatile unsigned int        DCH1ECONINV;
volatile unsigned int        DCH1INT;
typedef union {
  struct {
    unsigned CHERIF:1;
    unsigned CHTAIF:1;
    unsigned CHCCIF:1;
    unsigned CHBCIF:1;
    unsigned CHDHIF:1;
    unsigned CHDDIF:1;
    unsigned CHSHIF:1;
    unsigned CHSDIF:1;
    unsigned :8;
    unsigned CHERIE:1;
    unsigned CHTAIE:1;
    unsigned CHCCIE:1;
    unsigned CHBCIE:1;
    unsigned CHDHIE:1;
    unsigned CHDDIE:1;
    unsigned CHSHIE:1;
    unsigned CHSDIE:1;
  };
  struct {
    unsigned w:32;
  };
} __DCH1INTbits_t;
volatile __DCH1INTbits_t DCH1INTbits __asm__ ("DCH1INT");
volatile unsigned int        DCH1INTCLR;
volatile unsigned int        DCH1INTSET;
volatile unsigned int        DCH1INTINV;
volatile unsigned int        DCH1SSA;
volatile unsigned int        DCH1SSACLR;
volatile unsigned int        DCH1SSASET;
volatile unsigned int        DCH1SSAINV;
volatile unsigned int        DCH1DSA;
volatile unsigned int        DCH1DSACLR;
volatile unsigned int        DCH1DSASET;
volatile unsigned int        DCH1DSAINV;
volatile unsigned int        DCH1SSIZ;
volatile unsigned int        DCH1SSIZCLR;
volatile unsigned int        DCH1SSIZSET;
volatile unsigned int        DCH1SSIZINV;
volatile unsigned int        DCH1DSIZ;
volatile unsigned int        DCH1DSIZCLR;
volatile unsigned int        DCH1DSIZSET;
volatile unsigned int        DCH1DSIZINV;
volatile unsigned int        DCH1SPTR;
volatile unsigned int        DCH1SPTRCLR;
volatile unsigned int        DCH1SPTRSET;
volatile unsigned int        DCH1SPTRINV;
volatile unsigned int        DCH1DPTR;
volatile unsigned int        DCH1DPTRCLR;
volatile unsigned int        DCH1DPTRSET;
volatile unsigned int        DCH1DPTRINV;
volatile unsigned int        DCH1CSIZ;
volatile unsigned int        DCH1CSIZCLR;
volatile unsigned int        DCH1CSIZSET;
volatile unsigned int        DCH1CSIZINV;
volatile unsigned int        DCH1CPTR;
volatile unsigned int        DCH1CPTRCLR;
volatile unsigned int        DCH1CPTRSET;
volatile unsigned int        DCH1CPTRINV;
volatile unsigned int        DCH1DAT;
volatile unsigned int        DCH1DATCLR;
volatile unsigned int        DCH1DATSET;
volatile unsigned int        DCH1DATINV;
volatile unsigned int        DCH2CON;
typedef union {
  struct {
    unsigned CHPRI:2;
    unsigned CHEDET:1;
    unsigned :1;
    unsigned CHAEN:1;
    unsigned CHCHN:1;
    unsigned CHAED:1;
    unsigned CHEN:1;
    unsigned CHCHNS:1;
    unsigned :6;
    unsigned CHBUSY:1;
  };
  struct {
    unsigned w:32;
  };
} __DCH2CONbits_t;
volatile __DCH2CONbits_t DCH2CONbits __asm__ ("DCH2CON");
volatile unsigned int        DCH2CONCLR;
volatile unsigned int        DCH2CONSET;
volatile unsigned int        DCH2CONINV;
volatile unsigned int        DCH2ECON;
typedef union {
  struct {
    unsigned :3;
    unsigned AIRQEN:1;
    unsigned SIRQEN:1;
    unsigned PATEN:1;
    unsigned CABORT:1;
    unsigned CFORCE:1;
    unsigned CHSIRQ:8;
    unsigned CHAIRQ:8;
  };
  struct {
    unsigned w:32;
  };
} __DCH2ECONbits_t;
