rogermc2/MB_Ada/src/p32mx470f512.h
volatile __DCH2ECONbits_t DCH2ECONbits __asm__ ("DCH2ECON");
volatile unsigned int        DCH2ECONCLR;
volatile unsigned int        DCH2ECONSET;
volatile unsigned int        DCH2ECONINV;
volatile unsigned int        DCH2INT;
typedef union {
  struct {
    unsigned CHERIF:1;
    unsigned CHTAIF:1;
    unsigned CHCCIF:1;
    unsigned CHBCIF:1;
    unsigned CHDHIF:1;
    unsigned CHDDIF:1;
    unsigned CHSHIF:1;
    unsigned CHSDIF:1;
    unsigned :8;
    unsigned CHERIE:1;
    unsigned CHTAIE:1;
    unsigned CHCCIE:1;
    unsigned CHBCIE:1;
    unsigned CHDHIE:1;
    unsigned CHDDIE:1;
    unsigned CHSHIE:1;
    unsigned CHSDIE:1;
  };
  struct {
    unsigned w:32;
  };
} __DCH2INTbits_t;
volatile __DCH2INTbits_t DCH2INTbits __asm__ ("DCH2INT");
volatile unsigned int        DCH2INTCLR;
volatile unsigned int        DCH2INTSET;
volatile unsigned int        DCH2INTINV;
volatile unsigned int        DCH2SSA;
volatile unsigned int        DCH2SSACLR;
volatile unsigned int        DCH2SSASET;
volatile unsigned int        DCH2SSAINV;
volatile unsigned int        DCH2DSA;
volatile unsigned int        DCH2DSACLR;
volatile unsigned int        DCH2DSASET;
volatile unsigned int        DCH2DSAINV;
volatile unsigned int        DCH2SSIZ;
volatile unsigned int        DCH2SSIZCLR;
volatile unsigned int        DCH2SSIZSET;
volatile unsigned int        DCH2SSIZINV;
volatile unsigned int        DCH2DSIZ;
volatile unsigned int        DCH2DSIZCLR;
volatile unsigned int        DCH2DSIZSET;
volatile unsigned int        DCH2DSIZINV;
volatile unsigned int        DCH2SPTR;
volatile unsigned int        DCH2SPTRCLR;
volatile unsigned int        DCH2SPTRSET;
volatile unsigned int        DCH2SPTRINV;
volatile unsigned int        DCH2DPTR;
volatile unsigned int        DCH2DPTRCLR;
volatile unsigned int        DCH2DPTRSET;
volatile unsigned int        DCH2DPTRINV;
volatile unsigned int        DCH2CSIZ;
volatile unsigned int        DCH2CSIZCLR;
volatile unsigned int        DCH2CSIZSET;
volatile unsigned int        DCH2CSIZINV;
volatile unsigned int        DCH2CPTR;
volatile unsigned int        DCH2CPTRCLR;
volatile unsigned int        DCH2CPTRSET;
volatile unsigned int        DCH2CPTRINV;
volatile unsigned int        DCH2DAT;
volatile unsigned int        DCH2DATCLR;
volatile unsigned int        DCH2DATSET;
volatile unsigned int        DCH2DATINV;
volatile unsigned int        DCH3CON;
typedef union {
  struct {
    unsigned CHPRI:2;
    unsigned CHEDET:1;
    unsigned :1;
    unsigned CHAEN:1;
    unsigned CHCHN:1;
    unsigned CHAED:1;
    unsigned CHEN:1;
    unsigned CHCHNS:1;
    unsigned :6;
    unsigned CHBUSY:1;
  };
  struct {
    unsigned w:32;
  };
} __DCH3CONbits_t;
volatile __DCH3CONbits_t DCH3CONbits __asm__ ("DCH3CON");
volatile unsigned int        DCH3CONCLR;
volatile unsigned int        DCH3CONSET;
volatile unsigned int        DCH3CONINV;
volatile unsigned int        DCH3ECON;
typedef union {
  struct {
    unsigned :3;
    unsigned AIRQEN:1;
    unsigned SIRQEN:1;
    unsigned PATEN:1;
    unsigned CABORT:1;
    unsigned CFORCE:1;
    unsigned CHSIRQ:8;
    unsigned CHAIRQ:8;
  };
  struct {
    unsigned w:32;
  };
} __DCH3ECONbits_t;
volatile __DCH3ECONbits_t DCH3ECONbits __asm__ ("DCH3ECON");
volatile unsigned int        DCH3ECONCLR;
volatile unsigned int        DCH3ECONSET;
volatile unsigned int        DCH3ECONINV;
volatile unsigned int        DCH3INT;
typedef union {
  struct {
    unsigned CHERIF:1;
    unsigned CHTAIF:1;
    unsigned CHCCIF:1;
    unsigned CHBCIF:1;
    unsigned CHDHIF:1;
    unsigned CHDDIF:1;
    unsigned CHSHIF:1;
    unsigned CHSDIF:1;
    unsigned :8;
    unsigned CHERIE:1;
    unsigned CHTAIE:1;
    unsigned CHCCIE:1;
    unsigned CHBCIE:1;
    unsigned CHDHIE:1;
    unsigned CHDDIE:1;
    unsigned CHSHIE:1;
    unsigned CHSDIE:1;
  };
  struct {
    unsigned w:32;
  };
} __DCH3INTbits_t;
volatile __DCH3INTbits_t DCH3INTbits __asm__ ("DCH3INT");
volatile unsigned int        DCH3INTCLR;
volatile unsigned int        DCH3INTSET;
volatile unsigned int        DCH3INTINV;
volatile unsigned int        DCH3SSA;
volatile unsigned int        DCH3SSACLR;
volatile unsigned int        DCH3SSASET;
volatile unsigned int        DCH3SSAINV;
volatile unsigned int        DCH3DSA;
volatile unsigned int        DCH3DSACLR;
volatile unsigned int        DCH3DSASET;
volatile unsigned int        DCH3DSAINV;
volatile unsigned int        DCH3SSIZ;
volatile unsigned int        DCH3SSIZCLR;
volatile unsigned int        DCH3SSIZSET;
volatile unsigned int        DCH3SSIZINV;
volatile unsigned int        DCH3DSIZ;
volatile unsigned int        DCH3DSIZCLR;
volatile unsigned int        DCH3DSIZSET;
volatile unsigned int        DCH3DSIZINV;
volatile unsigned int        DCH3SPTR;
volatile unsigned int        DCH3SPTRCLR;
volatile unsigned int        DCH3SPTRSET;
volatile unsigned int        DCH3SPTRINV;
volatile unsigned int        DCH3DPTR;
volatile unsigned int        DCH3DPTRCLR;
volatile unsigned int        DCH3DPTRSET;
volatile unsigned int        DCH3DPTRINV;
volatile unsigned int        DCH3CSIZ;
volatile unsigned int        DCH3CSIZCLR;
volatile unsigned int        DCH3CSIZSET;
volatile unsigned int        DCH3CSIZINV;
volatile unsigned int        DCH3CPTR;
volatile unsigned int        DCH3CPTRCLR;
volatile unsigned int        DCH3CPTRSET;
volatile unsigned int        DCH3CPTRINV;
volatile unsigned int        DCH3DAT;
volatile unsigned int        DCH3DATCLR;
volatile unsigned int        DCH3DATSET;
volatile unsigned int        DCH3DATINV;
volatile unsigned int        CHECON;
typedef union {
  struct {
    unsigned PFMWS:3;
    unsigned :1;
    unsigned PREFEN:2;
    unsigned :2;
    unsigned DCSZ:2;
    unsigned :6;
    unsigned CHECOH:1;
  };
  struct {
    unsigned w:32;
  };
} __CHECONbits_t;
volatile __CHECONbits_t CHECONbits __asm__ ("CHECON");
volatile unsigned int        CHECONCLR;
volatile unsigned int        CHECONSET;
volatile unsigned int        CHECONINV;
volatile unsigned int        CHEACC;
typedef struct {
  unsigned CHEIDX:4;
  unsigned :27;
  unsigned CHEWEN:1;
} __CHEACCbits_t;
volatile __CHEACCbits_t CHEACCbits __asm__ ("CHEACC");
volatile unsigned int        CHEACCCLR;
volatile unsigned int        CHEACCSET;
volatile unsigned int        CHEACCINV;
volatile unsigned int        CHETAG;
typedef union {
  struct {
    unsigned :1;
    unsigned LTYPE:1;
    unsigned LLOCK:1;
    unsigned LVALID:1;
    unsigned LTAG:20;
    unsigned :7;
    unsigned LTAGBOOT:1;
  };
  struct {
    unsigned w:32;
  };
} __CHETAGbits_t;
