rogermc2/MB_Ada/src/p32mx470f512.h
volatile __CHETAGbits_t CHETAGbits __asm__ ("CHETAG");
volatile unsigned int        CHETAGCLR;
volatile unsigned int        CHETAGSET;
volatile unsigned int        CHETAGINV;
volatile unsigned int        CHEMSK;
typedef struct {
  unsigned :5;
  unsigned LMASK:11;
} __CHEMSKbits_t;
volatile __CHEMSKbits_t CHEMSKbits __asm__ ("CHEMSK");
volatile unsigned int        CHEMSKCLR;
volatile unsigned int        CHEMSKSET;
volatile unsigned int        CHEMSKINV;
volatile unsigned int        CHEW0;
typedef struct {
  unsigned CHEW0:32;
} __CHEW0bits_t;
volatile __CHEW0bits_t CHEW0bits __asm__ ("CHEW0");
volatile unsigned int        CHEW1;
typedef struct {
  unsigned CHEW1:32;
} __CHEW1bits_t;
volatile __CHEW1bits_t CHEW1bits __asm__ ("CHEW1");
volatile unsigned int        CHEW2;
typedef struct {
  unsigned CHEW2:32;
} __CHEW2bits_t;
volatile __CHEW2bits_t CHEW2bits __asm__ ("CHEW2");
volatile unsigned int        CHEW3;
typedef struct {
  unsigned CHEW3:32;
} __CHEW3bits_t;
volatile __CHEW3bits_t CHEW3bits __asm__ ("CHEW3");
volatile unsigned int        CHELRU;
typedef struct {
  unsigned CHELRU:25;
} __CHELRUbits_t;
volatile __CHELRUbits_t CHELRUbits __asm__ ("CHELRU");
volatile unsigned int        CHEHIT;
typedef struct {
  unsigned CHEHIT:32;
} __CHEHITbits_t;
volatile __CHEHITbits_t CHEHITbits __asm__ ("CHEHIT");
volatile unsigned int        CHEMIS;
typedef struct {
  unsigned CHEMIS:32;
} __CHEMISbits_t;
volatile __CHEMISbits_t CHEMISbits __asm__ ("CHEMIS");
volatile unsigned int        RESERVED1;
volatile unsigned int        CHEPFABT;
typedef struct {
  unsigned CHEPFABT:32;
} __CHEPFABTbits_t;
volatile __CHEPFABTbits_t CHEPFABTbits __asm__ ("CHEPFABT");
volatile unsigned int        U1OTGIR;
typedef struct {
  unsigned VBUSVDIF:1;
  unsigned :1;
  unsigned SESENDIF:1;
  unsigned SESVDIF:1;
  unsigned ACTVIF:1;
  unsigned LSTATEIF:1;
  unsigned T1MSECIF:1;
  unsigned IDIF:1;
} __U1OTGIRbits_t;
volatile __U1OTGIRbits_t U1OTGIRbits __asm__ ("U1OTGIR");
volatile unsigned int        U1OTGIRCLR;
volatile unsigned int        U1OTGIE;
typedef struct {
  unsigned VBUSVDIE:1;
  unsigned :1;
  unsigned SESENDIE:1;
  unsigned SESVDIE:1;
  unsigned ACTVIE:1;
  unsigned LSTATEIE:1;
  unsigned T1MSECIE:1;
  unsigned IDIE:1;
} __U1OTGIEbits_t;
volatile __U1OTGIEbits_t U1OTGIEbits __asm__ ("U1OTGIE");
volatile unsigned int        U1OTGIECLR;
volatile unsigned int        U1OTGIESET;
volatile unsigned int        U1OTGIEINV;
volatile unsigned int        U1OTGSTAT;
typedef struct {
  unsigned VBUSVD:1;
  unsigned :1;
  unsigned SESEND:1;
  unsigned SESVD:1;
  unsigned :1;
  unsigned LSTATE:1;
  unsigned :1;
  unsigned ID:1;
} __U1OTGSTATbits_t;
volatile __U1OTGSTATbits_t U1OTGSTATbits __asm__ ("U1OTGSTAT");
volatile unsigned int        U1OTGCON;
typedef struct {
  unsigned VBUSDIS:1;
  unsigned VBUSCHG:1;
  unsigned OTGEN:1;
  unsigned VBUSON:1;
  unsigned DMPULDWN:1;
  unsigned DPPULDWN:1;
  unsigned DMPULUP:1;
  unsigned DPPULUP:1;
} __U1OTGCONbits_t;
volatile __U1OTGCONbits_t U1OTGCONbits __asm__ ("U1OTGCON");
volatile unsigned int        U1OTGCONCLR;
volatile unsigned int        U1OTGCONSET;
volatile unsigned int        U1OTGCONINV;
volatile unsigned int        U1PWRC;
typedef struct {
  unsigned USBPWR:1;
  unsigned USUSPEND:1;
  unsigned :1;
  unsigned USBBUSY:1;
  unsigned USLPGRD:1;
  unsigned :2;
  unsigned UACTPND:1;
} __U1PWRCbits_t;
volatile __U1PWRCbits_t U1PWRCbits __asm__ ("U1PWRC");
volatile unsigned int        U1PWRCCLR;
volatile unsigned int        U1PWRCSET;
volatile unsigned int        U1PWRCINV;
volatile unsigned int        U1IR;
typedef union {
  struct {
    unsigned URSTIF_DETACHIF:1;
    unsigned UERRIF:1;
    unsigned SOFIF:1;
    unsigned TRNIF:1;
    unsigned IDLEIF:1;
    unsigned RESUMEIF:1;
    unsigned ATTACHIF:1;
    unsigned STALLIF:1;
  };
  struct {
    unsigned DETACHIF:1;
  };
  struct {
    unsigned URSTIF:1;
  };
} __U1IRbits_t;
volatile __U1IRbits_t U1IRbits __asm__ ("U1IR");
volatile unsigned int        U1IRCLR;
volatile unsigned int        U1IE;
typedef union {
  struct {
    unsigned URSTIE_DETACHIE:1;
    unsigned UERRIE:1;
    unsigned SOFIE:1;
    unsigned TRNIE:1;
    unsigned IDLEIE:1;
    unsigned RESUMEIE:1;
    unsigned ATTACHIE:1;
    unsigned STALLIE:1;
  };
  struct {
    unsigned DETACHIE:1;
  };
  struct {
    unsigned URSTIE:1;
  };
} __U1IEbits_t;
volatile __U1IEbits_t U1IEbits __asm__ ("U1IE");
volatile unsigned int        U1IECLR;
volatile unsigned int        U1IESET;
volatile unsigned int        U1IEINV;
volatile unsigned int        U1EIR;
typedef union {
  struct {
    unsigned PIDEF:1;
    unsigned CRC5EF_EOFEF:1;
    unsigned CRC16EF:1;
    unsigned DFN8EF:1;
    unsigned BTOEF:1;
    unsigned DMAEF:1;
    unsigned BMXEF:1;
    unsigned BTSEF:1;
  };
  struct {
    unsigned :1;
    unsigned CRC5EF:1;
  };
  struct {
    unsigned :1;
    unsigned EOFEF:1;
  };
} __U1EIRbits_t;
volatile __U1EIRbits_t U1EIRbits __asm__ ("U1EIR");
volatile unsigned int        U1EIRCLR;
volatile unsigned int        U1EIE;
typedef union {
  struct {
    unsigned PIDEE:1;
    unsigned CRC5EE_EOFEE:1;
    unsigned CRC16EE:1;
    unsigned DFN8EE:1;
    unsigned BTOEE:1;
    unsigned DMAEE:1;
    unsigned BMXEE:1;
    unsigned BTSEE:1;
  };
  struct {
    unsigned :1;
    unsigned CRC5EE:1;
  };
  struct {
    unsigned :1;
    unsigned EOFEE:1;
  };
} __U1EIEbits_t;
volatile __U1EIEbits_t U1EIEbits __asm__ ("U1EIE");
volatile unsigned int        U1EIECLR;
volatile unsigned int        U1EIESET;
volatile unsigned int        U1EIEINV;
volatile unsigned int        U1STAT;
typedef union {
  struct {
    unsigned :2;
    unsigned PPBI:1;
    unsigned DIR:1;
    unsigned ENDPT:4;
  };
  struct {
    unsigned :4;
    unsigned ENDPT0:1;
    unsigned ENDPT1:1;
    unsigned ENDPT2:1;
    unsigned ENDPT3:1;
  };
} __U1STATbits_t;
volatile __U1STATbits_t U1STATbits __asm__ ("U1STAT");
volatile unsigned int        U1CON;
typedef union {
  struct {
    unsigned USBEN_SOFEN:1;
    unsigned PPBRST:1;
    unsigned RESUME:1;
    unsigned HOSTEN:1;
    unsigned USBRST:1;
    unsigned PKTDIS_TOKBUSY:1;
    unsigned SE0:1;
    unsigned JSTATE:1;
  };
  struct {
    unsigned USBEN:1;
  };
  struct {
    unsigned SOFEN:1;
    unsigned :4;
    unsigned PKTDIS:1;
  };
  struct {
    unsigned :5;
    unsigned TOKBUSY:1;
  };
} __U1CONbits_t;
volatile __U1CONbits_t U1CONbits __asm__ ("U1CON");
volatile unsigned int        U1CONCLR;
volatile unsigned int        U1CONSET;
volatile unsigned int        U1CONINV;
volatile unsigned int        U1ADDR;
typedef union {
  struct {
    unsigned DEVADDR:7;
    unsigned LSPDEN:1;
  };
  struct {
    unsigned DEVADDR0:1;
    unsigned DEVADDR1:1;
    unsigned DEVADDR2:1;
    unsigned DEVADDR3:1;
    unsigned DEVADDR4:1;
    unsigned DEVADDR5:1;
    unsigned DEVADDR6:1;
  };
} __U1ADDRbits_t;
volatile __U1ADDRbits_t U1ADDRbits __asm__ ("U1ADDR");
volatile unsigned int        U1ADDRCLR;
volatile unsigned int        U1ADDRSET;
volatile unsigned int        U1ADDRINV;
volatile unsigned int        U1BDTP1;
typedef struct {
  unsigned :1;
  unsigned BDTPTRL:7;
} __U1BDTP1bits_t;
