rogermc2/MB_Ada/src/p32mx470f512.h
volatile __U1BDTP1bits_t U1BDTP1bits __asm__ ("U1BDTP1");
volatile unsigned int        U1BDTP1CLR;
volatile unsigned int        U1BDTP1SET;
volatile unsigned int        U1BDTP1INV;
volatile unsigned int        U1FRML;
typedef union {
  struct {
    unsigned FRML:8;
  };
  struct {
    unsigned FRM0:1;
    unsigned FRM1:1;
    unsigned FRM2:1;
    unsigned FRM3:1;
    unsigned FRM4:1;
    unsigned FRM5:1;
    unsigned FRM6:1;
    unsigned FRM7:1;
  };
} __U1FRMLbits_t;
volatile __U1FRMLbits_t U1FRMLbits __asm__ ("U1FRML");
volatile unsigned int        U1FRMH;
typedef union {
  struct {
    unsigned FRMH:3;
  };
  struct {
    unsigned FRM8:1;
    unsigned FRM9:1;
    unsigned FRM10:1;
  };
} __U1FRMHbits_t;
volatile __U1FRMHbits_t U1FRMHbits __asm__ ("U1FRMH");
volatile unsigned int        U1TOK;
typedef union {
  struct {
    unsigned EP:4;
    unsigned PID:4;
  };
  struct {
    unsigned EP0:1;
  };
  struct {
    unsigned :1;
    unsigned EP1:1;
    unsigned EP2:1;
    unsigned EP3:1;
    unsigned PID0:1;
  };
  struct {
    unsigned :5;
    unsigned PID1:1;
    unsigned PID2:1;
    unsigned PID3:1;
  };
} __U1TOKbits_t;
volatile __U1TOKbits_t U1TOKbits __asm__ ("U1TOK");
volatile unsigned int        U1TOKCLR;
volatile unsigned int        U1TOKSET;
volatile unsigned int        U1TOKINV;
volatile unsigned int        U1SOF;
typedef struct {
  unsigned CNT:8;
} __U1SOFbits_t;
volatile __U1SOFbits_t U1SOFbits __asm__ ("U1SOF");
volatile unsigned int        U1SOFCLR;
volatile unsigned int        U1SOFSET;
volatile unsigned int        U1SOFINV;
volatile unsigned int        U1BDTP2;
typedef struct {
  unsigned BDTPTRH:8;
} __U1BDTP2bits_t;
volatile __U1BDTP2bits_t U1BDTP2bits __asm__ ("U1BDTP2");
volatile unsigned int        U1BDTP2CLR;
volatile unsigned int        U1BDTP2SET;
volatile unsigned int        U1BDTP2INV;
volatile unsigned int        U1BDTP3;
typedef struct {
  unsigned BDTPTRU:8;
} __U1BDTP3bits_t;
volatile __U1BDTP3bits_t U1BDTP3bits __asm__ ("U1BDTP3");
volatile unsigned int        U1BDTP3CLR;
volatile unsigned int        U1BDTP3SET;
volatile unsigned int        U1BDTP3INV;
volatile unsigned int        U1CNFG1;
typedef struct {
  unsigned UASUSPND:1;
  unsigned :3;
  unsigned USBSIDL:1;
  unsigned :1;
  unsigned UOEMON:1;
  unsigned UTEYE:1;
} __U1CNFG1bits_t;
volatile __U1CNFG1bits_t U1CNFG1bits __asm__ ("U1CNFG1");
volatile unsigned int        U1CNFG1CLR;
volatile unsigned int        U1CNFG1SET;
volatile unsigned int        U1CNFG1INV;
volatile unsigned int        U1EP0;
typedef struct {
  unsigned EPHSHK:1;
  unsigned EPSTALL:1;
  unsigned EPTXEN:1;
  unsigned EPRXEN:1;
  unsigned EPCONDIS:1;
  unsigned :1;
  unsigned RETRYDIS:1;
  unsigned LSPD:1;
} __U1EP0bits_t;
volatile __U1EP0bits_t U1EP0bits __asm__ ("U1EP0");
volatile unsigned int        U1EP0CLR;
volatile unsigned int        U1EP0SET;
volatile unsigned int        U1EP0INV;
volatile unsigned int        U1EP1;
typedef struct {
  unsigned EPHSHK:1;
  unsigned EPSTALL:1;
  unsigned EPTXEN:1;
  unsigned EPRXEN:1;
  unsigned EPCONDIS:1;
} __U1EP1bits_t;
volatile __U1EP1bits_t U1EP1bits __asm__ ("U1EP1");
volatile unsigned int        U1EP1CLR;
volatile unsigned int        U1EP1SET;
volatile unsigned int        U1EP1INV;
volatile unsigned int        U1EP2;
typedef struct {
  unsigned EPHSHK:1;
  unsigned EPSTALL:1;
  unsigned EPTXEN:1;
  unsigned EPRXEN:1;
  unsigned EPCONDIS:1;
} __U1EP2bits_t;
volatile __U1EP2bits_t U1EP2bits __asm__ ("U1EP2");
volatile unsigned int        U1EP2CLR;
volatile unsigned int        U1EP2SET;
volatile unsigned int        U1EP2INV;
volatile unsigned int        U1EP3;
typedef struct {
  unsigned EPHSHK:1;
  unsigned EPSTALL:1;
  unsigned EPTXEN:1;
  unsigned EPRXEN:1;
  unsigned EPCONDIS:1;
} __U1EP3bits_t;
volatile __U1EP3bits_t U1EP3bits __asm__ ("U1EP3");
volatile unsigned int        U1EP3CLR;
volatile unsigned int        U1EP3SET;
volatile unsigned int        U1EP3INV;
volatile unsigned int        U1EP4;
typedef struct {
  unsigned EPHSHK:1;
  unsigned EPSTALL:1;
  unsigned EPTXEN:1;
  unsigned EPRXEN:1;
  unsigned EPCONDIS:1;
} __U1EP4bits_t;
volatile __U1EP4bits_t U1EP4bits __asm__ ("U1EP4");
volatile unsigned int        U1EP4CLR;
volatile unsigned int        U1EP4SET;
volatile unsigned int        U1EP4INV;
volatile unsigned int        U1EP5;
typedef struct {
  unsigned EPHSHK:1;
  unsigned EPSTALL:1;
  unsigned EPTXEN:1;
  unsigned EPRXEN:1;
  unsigned EPCONDIS:1;
} __U1EP5bits_t;
volatile __U1EP5bits_t U1EP5bits __asm__ ("U1EP5");
volatile unsigned int        U1EP5CLR;
volatile unsigned int        U1EP5SET;
volatile unsigned int        U1EP5INV;
volatile unsigned int        U1EP6;
typedef struct {
  unsigned EPHSHK:1;
  unsigned EPSTALL:1;
  unsigned EPTXEN:1;
  unsigned EPRXEN:1;
  unsigned EPCONDIS:1;
} __U1EP6bits_t;
volatile __U1EP6bits_t U1EP6bits __asm__ ("U1EP6");
volatile unsigned int        U1EP6CLR;
volatile unsigned int        U1EP6SET;
volatile unsigned int        U1EP6INV;
volatile unsigned int        U1EP7;
typedef struct {
  unsigned EPHSHK:1;
  unsigned EPSTALL:1;
  unsigned EPTXEN:1;
  unsigned EPRXEN:1;
  unsigned EPCONDIS:1;
} __U1EP7bits_t;
volatile __U1EP7bits_t U1EP7bits __asm__ ("U1EP7");
volatile unsigned int        U1EP7CLR;
volatile unsigned int        U1EP7SET;
volatile unsigned int        U1EP7INV;
volatile unsigned int        U1EP8;
typedef struct {
  unsigned EPHSHK:1;
  unsigned EPSTALL:1;
  unsigned EPTXEN:1;
  unsigned EPRXEN:1;
  unsigned EPCONDIS:1;
} __U1EP8bits_t;
volatile __U1EP8bits_t U1EP8bits __asm__ ("U1EP8");
volatile unsigned int        U1EP8CLR;
volatile unsigned int        U1EP8SET;
volatile unsigned int        U1EP8INV;
volatile unsigned int        U1EP9;
typedef struct {
  unsigned EPHSHK:1;
  unsigned EPSTALL:1;
  unsigned EPTXEN:1;
  unsigned EPRXEN:1;
  unsigned EPCONDIS:1;
} __U1EP9bits_t;
volatile __U1EP9bits_t U1EP9bits __asm__ ("U1EP9");
volatile unsigned int        U1EP9CLR;
volatile unsigned int        U1EP9SET;
volatile unsigned int        U1EP9INV;
volatile unsigned int        U1EP10;
typedef struct {
  unsigned EPHSHK:1;
  unsigned EPSTALL:1;
  unsigned EPTXEN:1;
  unsigned EPRXEN:1;
  unsigned EPCONDIS:1;
} __U1EP10bits_t;
volatile __U1EP10bits_t U1EP10bits __asm__ ("U1EP10");
volatile unsigned int        U1EP10CLR;
volatile unsigned int        U1EP10SET;
volatile unsigned int        U1EP10INV;
volatile unsigned int        U1EP11;
typedef struct {
  unsigned EPHSHK:1;
  unsigned EPSTALL:1;
  unsigned EPTXEN:1;
  unsigned EPRXEN:1;
  unsigned EPCONDIS:1;
} __U1EP11bits_t;
volatile __U1EP11bits_t U1EP11bits __asm__ ("U1EP11");
volatile unsigned int        U1EP11CLR;
volatile unsigned int        U1EP11SET;
volatile unsigned int        U1EP11INV;
volatile unsigned int        U1EP12;
typedef struct {
  unsigned EPHSHK:1;
  unsigned EPSTALL:1;
  unsigned EPTXEN:1;
  unsigned EPRXEN:1;
  unsigned EPCONDIS:1;
} __U1EP12bits_t;
