rogermc2/MB_Ada/src/p32mx470f512.h
volatile __U1EP12bits_t U1EP12bits __asm__ ("U1EP12");
volatile unsigned int        U1EP12CLR;
volatile unsigned int        U1EP12SET;
volatile unsigned int        U1EP12INV;
volatile unsigned int        U1EP13;
typedef struct {
  unsigned EPHSHK:1;
  unsigned EPSTALL:1;
  unsigned EPTXEN:1;
  unsigned EPRXEN:1;
  unsigned EPCONDIS:1;
} __U1EP13bits_t;
volatile __U1EP13bits_t U1EP13bits __asm__ ("U1EP13");
volatile unsigned int        U1EP13CLR;
volatile unsigned int        U1EP13SET;
volatile unsigned int        U1EP13INV;
volatile unsigned int        U1EP14;
typedef struct {
  unsigned EPHSHK:1;
  unsigned EPSTALL:1;
  unsigned EPTXEN:1;
  unsigned EPRXEN:1;
  unsigned EPCONDIS:1;
} __U1EP14bits_t;
volatile __U1EP14bits_t U1EP14bits __asm__ ("U1EP14");
volatile unsigned int        U1EP14CLR;
volatile unsigned int        U1EP14SET;
volatile unsigned int        U1EP14INV;
volatile unsigned int        U1EP15;
typedef struct {
  unsigned EPHSHK:1;
  unsigned EPSTALL:1;
  unsigned EPTXEN:1;
  unsigned EPRXEN:1;
  unsigned EPCONDIS:1;
} __U1EP15bits_t;
volatile __U1EP15bits_t U1EP15bits __asm__ ("U1EP15");
volatile unsigned int        U1EP15CLR;
volatile unsigned int        U1EP15SET;
volatile unsigned int        U1EP15INV;
volatile unsigned int        ANSELB;
typedef union {
  struct {
    unsigned ANSB0:1;
    unsigned ANSB1:1;
    unsigned ANSB2:1;
    unsigned ANSB3:1;
    unsigned ANSB4:1;
    unsigned ANSB5:1;
    unsigned ANSB6:1;
    unsigned ANSB7:1;
    unsigned ANSB8:1;
    unsigned ANSB9:1;
    unsigned ANSB10:1;
    unsigned ANSB11:1;
    unsigned ANSB12:1;
    unsigned ANSB13:1;
    unsigned ANSB14:1;
    unsigned ANSB15:1;
  };
  struct {
    unsigned w:32;
  };
} __ANSELBbits_t;
volatile __ANSELBbits_t ANSELBbits __asm__ ("ANSELB");
volatile unsigned int        ANSELBCLR;
volatile unsigned int        ANSELBSET;
volatile unsigned int        ANSELBINV;
volatile unsigned int        TRISB;
typedef union {
  struct {
    unsigned TRISB0:1;
    unsigned TRISB1:1;
    unsigned TRISB2:1;
    unsigned TRISB3:1;
    unsigned TRISB4:1;
    unsigned TRISB5:1;
    unsigned TRISB6:1;
    unsigned TRISB7:1;
    unsigned TRISB8:1;
    unsigned TRISB9:1;
    unsigned TRISB10:1;
    unsigned TRISB11:1;
    unsigned TRISB12:1;
    unsigned TRISB13:1;
    unsigned TRISB14:1;
    unsigned TRISB15:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISBbits_t;
volatile __TRISBbits_t TRISBbits __asm__ ("TRISB");
volatile unsigned int        TRISBCLR;
volatile unsigned int        TRISBSET;
volatile unsigned int        TRISBINV;
volatile unsigned int        PORTB;
typedef union {
  struct {
    unsigned RB0:1;
    unsigned RB1:1;
    unsigned RB2:1;
    unsigned RB3:1;
    unsigned RB4:1;
    unsigned RB5:1;
    unsigned RB6:1;
    unsigned RB7:1;
    unsigned RB8:1;
    unsigned RB9:1;
    unsigned RB10:1;
    unsigned RB11:1;
    unsigned RB12:1;
    unsigned RB13:1;
    unsigned RB14:1;
    unsigned RB15:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTBbits_t;
volatile __PORTBbits_t PORTBbits __asm__ ("PORTB");
volatile unsigned int        PORTBCLR;
volatile unsigned int        PORTBSET;
volatile unsigned int        PORTBINV;
volatile unsigned int        LATB;
typedef union {
  struct {
    unsigned LATB0:1;
    unsigned LATB1:1;
    unsigned LATB2:1;
    unsigned LATB3:1;
    unsigned LATB4:1;
    unsigned LATB5:1;
    unsigned LATB6:1;
    unsigned LATB7:1;
    unsigned LATB8:1;
    unsigned LATB9:1;
    unsigned LATB10:1;
    unsigned LATB11:1;
    unsigned LATB12:1;
    unsigned LATB13:1;
    unsigned LATB14:1;
    unsigned LATB15:1;
  };
  struct {
    unsigned w:32;
  };
} __LATBbits_t;
extern volatile __LATBbits_t LATBbits __asm__ ("LATB");
volatile unsigned int        LATBCLR;
volatile unsigned int        LATBSET;
volatile unsigned int        LATBINV;
volatile unsigned int        ODCB;
typedef union {
  struct {
    unsigned ODCB0:1;
    unsigned ODCB1:1;
    unsigned ODCB2:1;
    unsigned ODCB3:1;
    unsigned ODCB4:1;
    unsigned ODCB5:1;
    unsigned ODCB6:1;
    unsigned ODCB7:1;
    unsigned ODCB8:1;
    unsigned ODCB9:1;
    unsigned ODCB10:1;
    unsigned ODCB11:1;
    unsigned ODCB12:1;
    unsigned ODCB13:1;
    unsigned ODCB14:1;
    unsigned ODCB15:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCBbits_t;
volatile __ODCBbits_t ODCBbits __asm__ ("ODCB");
volatile unsigned int        ODCBCLR;
volatile unsigned int        ODCBSET;
volatile unsigned int        ODCBINV;
volatile unsigned int        CNPUB;
typedef union {
  struct {
    unsigned CNPUB0:1;
    unsigned CNPUB1:1;
    unsigned CNPUB2:1;
    unsigned CNPUB3:1;
    unsigned CNPUB4:1;
    unsigned CNPUB5:1;
    unsigned CNPUB6:1;
    unsigned CNPUB7:1;
    unsigned CNPUB8:1;
    unsigned CNPUB9:1;
    unsigned CNPUB10:1;
    unsigned CNPUB11:1;
    unsigned CNPUB12:1;
    unsigned CNPUB13:1;
    unsigned CNPUB14:1;
    unsigned CNPUB15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUBbits_t;
volatile __CNPUBbits_t CNPUBbits __asm__ ("CNPUB");
volatile unsigned int        CNPUBCLR;
volatile unsigned int        CNPUBSET;
volatile unsigned int        CNPUBINV;
volatile unsigned int        CNPDB;
typedef union {
  struct {
    unsigned CNPDB0:1;
    unsigned CNPDB1:1;
    unsigned CNPDB2:1;
    unsigned CNPDB3:1;
    unsigned CNPDB4:1;
    unsigned CNPDB5:1;
    unsigned CNPDB6:1;
    unsigned CNPDB7:1;
    unsigned CNPDB8:1;
    unsigned CNPDB9:1;
    unsigned CNPDB10:1;
    unsigned CNPDB11:1;
    unsigned CNPDB12:1;
    unsigned CNPDB13:1;
    unsigned CNPDB14:1;
    unsigned CNPDB15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDBbits_t;
volatile __CNPDBbits_t CNPDBbits __asm__ ("CNPDB");
volatile unsigned int        CNPDBCLR;
volatile unsigned int        CNPDBSET;
volatile unsigned int        CNPDBINV;
volatile unsigned int        CNCONB;
typedef union {
  struct {
    unsigned :13;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONBbits_t;
volatile __CNCONBbits_t CNCONBbits __asm__ ("CNCONB");
volatile unsigned int        CNCONBCLR;
volatile unsigned int        CNCONBSET;
volatile unsigned int        CNCONBINV;
volatile unsigned int        CNENB;
typedef union {
  struct {
    unsigned CNIEB0:1;
    unsigned CNIEB1:1;
    unsigned CNIEB2:1;
    unsigned CNIEB3:1;
    unsigned CNIEB4:1;
    unsigned CNIEB5:1;
    unsigned CNIEB6:1;
    unsigned CNIEB7:1;
    unsigned CNIEB8:1;
    unsigned CNIEB9:1;
    unsigned CNIEB10:1;
    unsigned CNIEB11:1;
    unsigned CNIEB12:1;
    unsigned CNIEB13:1;
    unsigned CNIEB14:1;
    unsigned CNIEB15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENBbits_t;
volatile __CNENBbits_t CNENBbits __asm__ ("CNENB");
volatile unsigned int        CNENBCLR;
volatile unsigned int        CNENBSET;
volatile unsigned int        CNENBINV;
volatile unsigned int        CNSTATB;
typedef union {
  struct {
    unsigned CNSTATB0:1;
    unsigned CNSTATB1:1;
    unsigned CNSTATB2:1;
    unsigned CNSTATB3:1;
    unsigned CNSTATB4:1;
    unsigned CNSTATB5:1;
    unsigned CNSTATB6:1;
    unsigned CNSTATB7:1;
    unsigned CNSTATB8:1;
    unsigned CNSTATB9:1;
    unsigned CNSTATB10:1;
    unsigned CNSTATB11:1;
    unsigned CNSTATB12:1;
    unsigned CNSTATB13:1;
    unsigned CNSTATB14:1;
    unsigned CNSTATB15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATBbits_t;
volatile __CNSTATBbits_t CNSTATBbits __asm__ ("CNSTATB");
volatile unsigned int        CNSTATBCLR;
volatile unsigned int        CNSTATBSET;
volatile unsigned int        CNSTATBINV;
volatile unsigned int        ANSELC;
typedef union {
  struct {
    unsigned :12;
    unsigned ANSC12:1;
    unsigned ANSC13:1;
    unsigned ANSC14:1;
    unsigned ANSC15:1;
  };
  struct {
    unsigned w:32;
  };
} __ANSELCbits_t;
