rogermc2/MB_Ada/src/p32mx470f512.h
volatile __ANSELCbits_t ANSELCbits __asm__ ("ANSELC");
volatile unsigned int        ANSELCCLR;
volatile unsigned int        ANSELCSET;
volatile unsigned int        ANSELCINV;
volatile unsigned int        TRISC;
typedef union {
  struct {
    unsigned :12;
    unsigned TRISC12:1;
    unsigned TRISC13:1;
    unsigned TRISC14:1;
    unsigned TRISC15:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISCbits_t;
volatile __TRISCbits_t TRISCbits __asm__ ("TRISC");
volatile unsigned int        TRISCCLR;
volatile unsigned int        TRISCSET;
volatile unsigned int        TRISCINV;
volatile unsigned int        PORTC;
typedef union {
  struct {
    unsigned :12;
    unsigned RC12:1;
    unsigned RC13:1;
    unsigned RC14:1;
    unsigned RC15:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTCbits_t;
volatile __PORTCbits_t PORTCbits __asm__ ("PORTC");
volatile unsigned int        PORTCCLR;
volatile unsigned int        PORTCSET;
volatile unsigned int        PORTCINV;
volatile unsigned int        LATC;
typedef union {
  struct {
    unsigned :12;
    unsigned LATC12:1;
    unsigned LATC13:1;
    unsigned LATC14:1;
    unsigned LATC15:1;
  };
  struct {
    unsigned w:32;
  };
} __LATCbits_t;
extern volatile __LATCbits_t LATCbits __asm__ ("LATC");
volatile unsigned int        LATCCLR;
volatile unsigned int        LATCSET;
volatile unsigned int        LATCINV;
volatile unsigned int        ODCC;
typedef union {
  struct {
    unsigned :12;
    unsigned ODCC12:1;
    unsigned ODCC13:1;
    unsigned ODCC14:1;
    unsigned ODCC15:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCCbits_t;
volatile __ODCCbits_t ODCCbits __asm__ ("ODCC");
volatile unsigned int        ODCCCLR;
volatile unsigned int        ODCCSET;
volatile unsigned int        ODCCINV;
volatile unsigned int        CNPUC;
typedef union {
  struct {
    unsigned :12;
    unsigned CNPUC12:1;
    unsigned CNPUC13:1;
    unsigned CNPUC14:1;
    unsigned CNPUC15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUCbits_t;
volatile __CNPUCbits_t CNPUCbits __asm__ ("CNPUC");
volatile unsigned int        CNPUCCLR;
volatile unsigned int        CNPUCSET;
volatile unsigned int        CNPUCINV;
volatile unsigned int        CNPDC;
typedef union {
  struct {
    unsigned :12;
    unsigned CNPDC12:1;
    unsigned CNPDC13:1;
    unsigned CNPDC14:1;
    unsigned CNPDC15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDCbits_t;
volatile __CNPDCbits_t CNPDCbits __asm__ ("CNPDC");
volatile unsigned int        CNPDCCLR;
volatile unsigned int        CNPDCSET;
volatile unsigned int        CNPDCINV;
volatile unsigned int        CNCONC;
typedef union {
  struct {
    unsigned :13;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONCbits_t;
volatile __CNCONCbits_t CNCONCbits __asm__ ("CNCONC");
volatile unsigned int        CNCONCCLR;
volatile unsigned int        CNCONCSET;
volatile unsigned int        CNCONCINV;
volatile unsigned int        CNENC;
typedef union {
  struct {
    unsigned :12;
    unsigned CNIEC12:1;
    unsigned CNIEC13:1;
    unsigned CNIEC14:1;
    unsigned CNIEC15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENCbits_t;
volatile __CNENCbits_t CNENCbits __asm__ ("CNENC");
volatile unsigned int        CNENCCLR;
volatile unsigned int        CNENCSET;
volatile unsigned int        CNENCINV;
volatile unsigned int        CNSTATC;
typedef union {
  struct {
    unsigned :12;
    unsigned CNSTATC12:1;
    unsigned CNSTATC13:1;
    unsigned CNSTATC14:1;
    unsigned CNSTATC15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATCbits_t;
volatile __CNSTATCbits_t CNSTATCbits __asm__ ("CNSTATC");
volatile unsigned int        CNSTATCCLR;
volatile unsigned int        CNSTATCSET;
volatile unsigned int        CNSTATCINV;
volatile unsigned int        ANSELD;
typedef union {
  struct {
    unsigned :1;
    unsigned ANSD1:1;
    unsigned ANSD2:1;
    unsigned ANSD3:1;
  };
  struct {
    unsigned w:32;
  };
} __ANSELDbits_t;
volatile __ANSELDbits_t ANSELDbits __asm__ ("ANSELD");
volatile unsigned int        ANSELDCLR;
volatile unsigned int        ANSELDSET;
volatile unsigned int        ANSELDINV;
volatile unsigned int        TRISD;
typedef union {
  struct {
    unsigned TRISD0:1;
    unsigned TRISD1:1;
    unsigned TRISD2:1;
    unsigned TRISD3:1;
    unsigned TRISD4:1;
    unsigned TRISD5:1;
    unsigned TRISD6:1;
    unsigned TRISD7:1;
    unsigned TRISD8:1;
    unsigned TRISD9:1;
    unsigned TRISD10:1;
    unsigned TRISD11:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISDbits_t;
volatile __TRISDbits_t TRISDbits __asm__ ("TRISD");
volatile unsigned int        TRISDCLR;
volatile unsigned int        TRISDSET;
volatile unsigned int        TRISDINV;
volatile unsigned int        PORTD;
typedef union {
  struct {
    unsigned RD0:1;
    unsigned RD1:1;
    unsigned RD2:1;
    unsigned RD3:1;
    unsigned RD4:1;
    unsigned RD5:1;
    unsigned RD6:1;
    unsigned RD7:1;
    unsigned RD8:1;
    unsigned RD9:1;
    unsigned RD10:1;
    unsigned RD11:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTDbits_t;
volatile __PORTDbits_t PORTDbits __asm__ ("PORTD");
volatile unsigned int        PORTDCLR;
volatile unsigned int        PORTDSET;
volatile unsigned int        PORTDINV;
volatile unsigned int        LATD;
typedef union {
  struct {
    unsigned LATD0:1;
    unsigned LATD1:1;
    unsigned LATD2:1;
    unsigned LATD3:1;
    unsigned LATD4:1;
    unsigned LATD5:1;
    unsigned LATD6:1;
    unsigned LATD7:1;
    unsigned LATD8:1;
    unsigned LATD9:1;
    unsigned LATD10:1;
    unsigned LATD11:1;
  };
  struct {
    unsigned w:32;
  };
} __LATDbits_t;
extern volatile __LATDbits_t LATDbits __asm__ ("LATD");
volatile unsigned int        LATDCLR;
volatile unsigned int        LATDSET;
volatile unsigned int        LATDINV;
volatile unsigned int        ODCD;
typedef union {
  struct {
    unsigned ODCD0:1;
    unsigned ODCD1:1;
    unsigned ODCD2:1;
    unsigned ODCD3:1;
    unsigned ODCD4:1;
    unsigned ODCD5:1;
    unsigned ODCD6:1;
    unsigned ODCD7:1;
    unsigned ODCD8:1;
    unsigned ODCD9:1;
    unsigned ODCD10:1;
    unsigned ODCD11:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCDbits_t;
