rogermc2/MB_Ada/src/p32mx470f512.h
volatile __ODCDbits_t ODCDbits __asm__ ("ODCD");
volatile unsigned int        ODCDCLR;
volatile unsigned int        ODCDSET;
volatile unsigned int        ODCDINV;
volatile unsigned int        CNPUD;
typedef union {
  struct {
    unsigned CNPUD0:1;
    unsigned CNPUD1:1;
    unsigned CNPUD2:1;
    unsigned CNPUD3:1;
    unsigned CNPUD4:1;
    unsigned CNPUD5:1;
    unsigned CNPUD6:1;
    unsigned CNPUD7:1;
    unsigned CNPUD8:1;
    unsigned CNPUD9:1;
    unsigned CNPUD10:1;
    unsigned CNPUD11:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUDbits_t;
volatile __CNPUDbits_t CNPUDbits __asm__ ("CNPUD");
volatile unsigned int        CNPUDCLR;
volatile unsigned int        CNPUDSET;
volatile unsigned int        CNPUDINV;
volatile unsigned int        CNPDD;
typedef union {
  struct {
    unsigned CNPDD0:1;
    unsigned CNPDD1:1;
    unsigned CNPDD2:1;
    unsigned CNPDD3:1;
    unsigned CNPDD4:1;
    unsigned CNPDD5:1;
    unsigned CNPDD6:1;
    unsigned CNPDD7:1;
    unsigned CNPDD8:1;
    unsigned CNPDD9:1;
    unsigned CNPDD10:1;
    unsigned CNPDD11:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDDbits_t;
volatile __CNPDDbits_t CNPDDbits __asm__ ("CNPDD");
volatile unsigned int        CNPDDCLR;
volatile unsigned int        CNPDDSET;
volatile unsigned int        CNPDDINV;
volatile unsigned int        CNCOND;
typedef union {
  struct {
    unsigned :13;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONDbits_t;
volatile __CNCONDbits_t CNCONDbits __asm__ ("CNCOND");
volatile unsigned int        CNCONDCLR;
volatile unsigned int        CNCONDSET;
volatile unsigned int        CNCONDINV;
volatile unsigned int        CNEND;
typedef union {
  struct {
    unsigned CNIED0:1;
    unsigned CNIED1:1;
    unsigned CNIED2:1;
    unsigned CNIED3:1;
    unsigned CNIED4:1;
    unsigned CNIED5:1;
    unsigned CNIED6:1;
    unsigned CNIED7:1;
    unsigned CNIED8:1;
    unsigned CNIED9:1;
    unsigned CNIED10:1;
    unsigned CNIED11:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENDbits_t;
volatile __CNENDbits_t CNENDbits __asm__ ("CNEND");
volatile unsigned int        CNENDCLR;
volatile unsigned int        CNENDSET;
volatile unsigned int        CNENDINV;
volatile unsigned int        CNSTATD;
typedef union {
  struct {
    unsigned CNSTATD0:1;
    unsigned CNSTATD1:1;
    unsigned CNSTATD2:1;
    unsigned CNSTATD3:1;
    unsigned CNSTATD4:1;
    unsigned CNSTATD5:1;
    unsigned CNSTATD6:1;
    unsigned CNSTATD7:1;
    unsigned CNSTATD8:1;
    unsigned CNSTATD9:1;
    unsigned CNSTATD10:1;
    unsigned CNSTATD11:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATDbits_t;
volatile __CNSTATDbits_t CNSTATDbits __asm__ ("CNSTATD");
volatile unsigned int        CNSTATDCLR;
volatile unsigned int        CNSTATDSET;
volatile unsigned int        CNSTATDINV;
volatile unsigned int        ANSELE;
typedef union {
  struct {
    unsigned :2;
    unsigned ANSE2:1;
    unsigned :1;
    unsigned ANSE4:1;
    unsigned ANSE5:1;
    unsigned ANSE6:1;
    unsigned ANSE7:1;
  };
  struct {
    unsigned w:32;
  };
} __ANSELEbits_t;
volatile __ANSELEbits_t ANSELEbits __asm__ ("ANSELE");
volatile unsigned int        ANSELECLR;
volatile unsigned int        ANSELESET;
volatile unsigned int        ANSELEINV;
volatile unsigned int        TRISE;
typedef union {
  struct {
    unsigned TRISE0:1;
    unsigned TRISE1:1;
    unsigned TRISE2:1;
    unsigned TRISE3:1;
    unsigned TRISE4:1;
    unsigned TRISE5:1;
    unsigned TRISE6:1;
    unsigned TRISE7:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISEbits_t;
volatile __TRISEbits_t TRISEbits __asm__ ("TRISE");
volatile unsigned int        TRISECLR;
volatile unsigned int        TRISESET;
volatile unsigned int        TRISEINV;
volatile unsigned int        PORTE;
typedef union {
  struct {
    unsigned RE0:1;
    unsigned RE1:1;
    unsigned RE2:1;
    unsigned RE3:1;
    unsigned RE4:1;
    unsigned RE5:1;
    unsigned RE6:1;
    unsigned RE7:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTEbits_t;
volatile __PORTEbits_t PORTEbits __asm__ ("PORTE");
volatile unsigned int        PORTECLR;
volatile unsigned int        PORTESET;
volatile unsigned int        PORTEINV;
volatile unsigned int        LATE;
typedef union {
  struct {
    unsigned LATE0:1;
    unsigned LATE1:1;
    unsigned LATE2:1;
    unsigned LATE3:1;
    unsigned LATE4:1;
    unsigned LATE5:1;
    unsigned LATE6:1;
    unsigned LATE7:1;
  };
  struct {
    unsigned w:32;
  };
} __LATEbits_t;
extern volatile __LATEbits_t LATEbits __asm__ ("LATE");
volatile unsigned int        LATECLR;
volatile unsigned int        LATESET;
volatile unsigned int        LATEINV;
volatile unsigned int        ODCE;
typedef union {
  struct {
    unsigned ODCE0:1;
    unsigned ODCE1:1;
    unsigned ODCE2:1;
    unsigned ODCE3:1;
    unsigned ODCE4:1;
    unsigned ODCE5:1;
    unsigned ODCE6:1;
    unsigned ODCE7:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCEbits_t;
volatile __ODCEbits_t ODCEbits __asm__ ("ODCE");
volatile unsigned int        ODCECLR;
volatile unsigned int        ODCESET;
volatile unsigned int        ODCEINV;
volatile unsigned int        CNPUE;
typedef union {
  struct {
    unsigned CNPUE0:1;
    unsigned CNPUE1:1;
    unsigned CNPUE2:1;
    unsigned CNPUE3:1;
    unsigned CNPUE4:1;
    unsigned CNPUE5:1;
    unsigned CNPUE6:1;
    unsigned CNPUE7:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUEbits_t;
volatile __CNPUEbits_t CNPUEbits __asm__ ("CNPUE");
volatile unsigned int        CNPUECLR;
volatile unsigned int        CNPUESET;
volatile unsigned int        CNPUEINV;
volatile unsigned int        CNPDE;
typedef union {
  struct {
    unsigned CNPDE0:1;
    unsigned CNPDE1:1;
    unsigned CNPDE2:1;
    unsigned CNPDE3:1;
    unsigned CNPDE4:1;
    unsigned CNPDE5:1;
    unsigned CNPDE6:1;
    unsigned CNPDE7:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDEbits_t;
volatile __CNPDEbits_t CNPDEbits __asm__ ("CNPDE");
volatile unsigned int        CNPDECLR;
volatile unsigned int        CNPDESET;
volatile unsigned int        CNPDEINV;
volatile unsigned int        CNCONE;
typedef union {
  struct {
    unsigned :13;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONEbits_t;
volatile __CNCONEbits_t CNCONEbits __asm__ ("CNCONE");
volatile unsigned int        CNCONECLR;
volatile unsigned int        CNCONESET;
volatile unsigned int        CNCONEINV;
volatile unsigned int        CNENE;
typedef union {
  struct {
    unsigned CNIEE0:1;
    unsigned CNIEE1:1;
    unsigned CNIEE2:1;
    unsigned CNIEE3:1;
    unsigned CNIEE4:1;
    unsigned CNIEE5:1;
    unsigned CNIEE6:1;
    unsigned CNIEE7:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENEbits_t;
