rogermc2/MB_Ada/src/p32mx470f512.h
volatile __CNENEbits_t CNENEbits __asm__ ("CNENE");
volatile unsigned int        CNENECLR;
volatile unsigned int        CNENESET;
volatile unsigned int        CNENEINV;
volatile unsigned int        CNSTATE;
typedef union {
  struct {
    unsigned CNSTATE0:1;
    unsigned CNSTATE1:1;
    unsigned CNSTATE2:1;
    unsigned CNSTATE3:1;
    unsigned CNSTATE4:1;
    unsigned CNSTATE5:1;
    unsigned CNSTATE6:1;
    unsigned CNSTATE7:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATEbits_t;
volatile __CNSTATEbits_t CNSTATEbits __asm__ ("CNSTATE");
volatile unsigned int        CNSTATECLR;
volatile unsigned int        CNSTATESET;
volatile unsigned int        CNSTATEINV;
volatile unsigned int        ANSELF;
typedef struct {
  unsigned w:32;
} __ANSELFbits_t;
volatile __ANSELFbits_t ANSELFbits __asm__ ("ANSELF");
volatile unsigned int        ANSELFCLR;
volatile unsigned int        ANSELFSET;
volatile unsigned int        ANSELFINV;
volatile unsigned int        TRISF;
typedef union {
  struct {
    unsigned TRISF0:1;
    unsigned TRISF1:1;
    unsigned :1;
    unsigned TRISF3:1;
    unsigned TRISF4:1;
    unsigned TRISF5:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISFbits_t;
volatile __TRISFbits_t TRISFbits __asm__ ("TRISF");
volatile unsigned int        TRISFCLR;
volatile unsigned int        TRISFSET;
volatile unsigned int        TRISFINV;
volatile unsigned int        PORTF;
typedef union {
  struct {
    unsigned RF0:1;
    unsigned RF1:1;
    unsigned :1;
    unsigned RF3:1;
    unsigned RF4:1;
    unsigned RF5:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTFbits_t;
volatile __PORTFbits_t PORTFbits __asm__ ("PORTF");
volatile unsigned int        PORTFCLR;
volatile unsigned int        PORTFSET;
volatile unsigned int        PORTFINV;
volatile unsigned int        LATF;
typedef union {
  struct {
    unsigned LATF0:1;
    unsigned LATF1:1;
    unsigned :1;
    unsigned LATF3:1;
    unsigned LATF4:1;
    unsigned LATF5:1;
  };
  struct {
    unsigned w:32;
  };
} __LATFbits_t;
extern volatile __LATFbits_t LATFbits __asm__ ("LATF");
volatile unsigned int        LATFCLR;
volatile unsigned int        LATFSET;
volatile unsigned int        LATFINV;
volatile unsigned int        ODCF;
typedef union {
  struct {
    unsigned ODCF0:1;
    unsigned ODCF1:1;
    unsigned :1;
    unsigned ODCF3:1;
    unsigned ODCF4:1;
    unsigned ODCF5:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCFbits_t;
volatile __ODCFbits_t ODCFbits __asm__ ("ODCF");
volatile unsigned int        ODCFCLR;
volatile unsigned int        ODCFSET;
volatile unsigned int        ODCFINV;
volatile unsigned int        CNPUF;
typedef union {
  struct {
    unsigned CNPUF0:1;
    unsigned CNPUF1:1;
    unsigned :1;
    unsigned CNPUF3:1;
    unsigned CNPUF4:1;
    unsigned CNPUF5:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUFbits_t;
volatile __CNPUFbits_t CNPUFbits __asm__ ("CNPUF");
volatile unsigned int        CNPUFCLR;
volatile unsigned int        CNPUFSET;
volatile unsigned int        CNPUFINV;
volatile unsigned int        CNPDF;
typedef union {
  struct {
    unsigned CNPDF0:1;
    unsigned CNPDF1:1;
    unsigned :1;
    unsigned CNPDF3:1;
    unsigned CNPDF4:1;
    unsigned CNPDF5:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDFbits_t;
volatile __CNPDFbits_t CNPDFbits __asm__ ("CNPDF");
volatile unsigned int        CNPDFCLR;
volatile unsigned int        CNPDFSET;
volatile unsigned int        CNPDFINV;
volatile unsigned int        CNCONF;
typedef union {
  struct {
    unsigned :13;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONFbits_t;
volatile __CNCONFbits_t CNCONFbits __asm__ ("CNCONF");
volatile unsigned int        CNCONFCLR;
volatile unsigned int        CNCONFSET;
volatile unsigned int        CNCONFINV;
volatile unsigned int        CNENF;
typedef union {
  struct {
    unsigned CNIEF0:1;
    unsigned CNIEF1:1;
    unsigned :1;
    unsigned CNIEF3:1;
    unsigned CNIEF4:1;
    unsigned CNIEF5:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENFbits_t;
volatile __CNENFbits_t CNENFbits __asm__ ("CNENF");
volatile unsigned int        CNENFCLR;
volatile unsigned int        CNENFSET;
volatile unsigned int        CNENFINV;
volatile unsigned int        CNSTATF;
typedef union {
  struct {
    unsigned CNSTATF0:1;
    unsigned CNSTATF1:1;
    unsigned :1;
    unsigned CNSTATF3:1;
    unsigned CNSTATF4:1;
    unsigned CNSTATF5:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATFbits_t;
volatile __CNSTATFbits_t CNSTATFbits __asm__ ("CNSTATF");
volatile unsigned int        CNSTATFCLR;
volatile unsigned int        CNSTATFSET;
volatile unsigned int        CNSTATFINV;
volatile unsigned int        ANSELG;
typedef union {
  struct {
    unsigned :6;
    unsigned ANSG6:1;
    unsigned ANSG7:1;
    unsigned ANSG8:1;
    unsigned ANSG9:1;
  };
  struct {
    unsigned w:32;
  };
} __ANSELGbits_t;
volatile __ANSELGbits_t ANSELGbits __asm__ ("ANSELG");
volatile unsigned int        ANSELGCLR;
volatile unsigned int        ANSELGSET;
volatile unsigned int        ANSELGINV;
volatile unsigned int        TRISG;
typedef union {
  struct {
    unsigned :2;
    unsigned TRISG2:1;
    unsigned TRISG3:1;
    unsigned :2;
    unsigned TRISG6:1;
    unsigned TRISG7:1;
    unsigned TRISG8:1;
    unsigned TRISG9:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISGbits_t;
volatile __TRISGbits_t TRISGbits __asm__ ("TRISG");
volatile unsigned int        TRISGCLR;
volatile unsigned int        TRISGSET;
volatile unsigned int        TRISGINV;
volatile unsigned int        PORTG;
typedef union {
  struct {
    unsigned :2;
    unsigned RG2:1;
    unsigned RG3:1;
    unsigned :2;
    unsigned RG6:1;
    unsigned RG7:1;
    unsigned RG8:1;
    unsigned RG9:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTGbits_t;
volatile __PORTGbits_t PORTGbits __asm__ ("PORTG");
volatile unsigned int        PORTGCLR;
volatile unsigned int        PORTGSET;
volatile unsigned int        PORTGINV;
volatile unsigned int        LATG;
typedef union {
  struct {
    unsigned :2;
    unsigned LATG2:1;
    unsigned LATG3:1;
    unsigned :2;
    unsigned LATG6:1;
    unsigned LATG7:1;
    unsigned LATG8:1;
    unsigned LATG9:1;
  };
  struct {
    unsigned w:32;
  };
} __LATGbits_t;
extern volatile __LATGbits_t LATGbits __asm__ ("LATG");
volatile unsigned int        LATGCLR;
volatile unsigned int        LATGSET;
volatile unsigned int        LATGINV;
volatile unsigned int        ODCG;
typedef union {
  struct {
    unsigned :2;
    unsigned ODCG2:1;
    unsigned ODCG3:1;
    unsigned :2;
    unsigned ODCG6:1;
    unsigned ODCG7:1;
    unsigned ODCG8:1;
    unsigned ODCG9:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCGbits_t;
volatile __ODCGbits_t ODCGbits __asm__ ("ODCG");
volatile unsigned int        ODCGCLR;
volatile unsigned int        ODCGSET;
volatile unsigned int        ODCGINV;
volatile unsigned int        CNPUG;
typedef union {
  struct {
    unsigned :2;
    unsigned CNPUG2:1;
    unsigned CNPUG3:1;
    unsigned :2;
    unsigned CNPUG6:1;
    unsigned CNPUG7:1;
    unsigned CNPUG8:1;
    unsigned CNPUG9:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUGbits_t;
