rogermc2/MB_Ada/src/p32mx470f512.h
volatile __CNPUGbits_t CNPUGbits __asm__ ("CNPUG");
volatile unsigned int        CNPUGCLR;
volatile unsigned int        CNPUGSET;
volatile unsigned int        CNPUGINV;
volatile unsigned int        CNPDG;
typedef union {
  struct {
    unsigned :2;
    unsigned CNPDG2:1;
    unsigned CNPDG3:1;
    unsigned :2;
    unsigned CNPDG6:1;
    unsigned CNPDG7:1;
    unsigned CNPDG8:1;
    unsigned CNPDG9:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDGbits_t;
volatile __CNPDGbits_t CNPDGbits __asm__ ("CNPDG");
volatile unsigned int        CNPDGCLR;
volatile unsigned int        CNPDGSET;
volatile unsigned int        CNPDGINV;
volatile unsigned int        CNCONG;
typedef union {
  struct {
    unsigned :13;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONGbits_t;
volatile __CNCONGbits_t CNCONGbits __asm__ ("CNCONG");
volatile unsigned int        CNCONGCLR;
volatile unsigned int        CNCONGSET;
volatile unsigned int        CNCONGINV;
volatile unsigned int        CNENG;
typedef union {
  struct {
    unsigned :2;
    unsigned CNIEG2:1;
    unsigned CNIEG3:1;
    unsigned :2;
    unsigned CNIEG6:1;
    unsigned CNIEG7:1;
    unsigned CNIEG8:1;
    unsigned CNIEG9:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENGbits_t;
volatile __CNENGbits_t CNENGbits __asm__ ("CNENG");
volatile unsigned int        CNENGCLR;
volatile unsigned int        CNENGSET;
volatile unsigned int        CNENGINV;
volatile unsigned int        CNSTATG;
typedef union {
  struct {
    unsigned :2;
    unsigned CNSTATG2:1;
    unsigned CNSTATG3:1;
    unsigned :2;
    unsigned CNSTATG6:1;
    unsigned CNSTATG7:1;
    unsigned CNSTATG8:1;
    unsigned CNSTATG9:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATGbits_t;
volatile __CNSTATGbits_t CNSTATGbits __asm__ ("CNSTATG");
volatile unsigned int        CNSTATGCLR;
volatile unsigned int        CNSTATGSET;
volatile unsigned int        CNSTATGINV;
volatile unsigned int        DEVCFG3;
typedef union {
  struct {
    unsigned USERID:16;
    unsigned FSRSSEL:3;
    unsigned :9;
    unsigned PMDL1WAY:1;
    unsigned IOL1WAY:1;
    unsigned FUSBIDIO:1;
    unsigned FVBUSONIO:1;
  };
  struct {
    unsigned w:32;
  };
} __DEVCFG3bits_t;
volatile __DEVCFG3bits_t DEVCFG3bits __asm__ ("DEVCFG3");
volatile unsigned int        DEVCFG2;
typedef union {
  struct {
    unsigned FPLLIDIV:3;
    unsigned :1;
    unsigned FPLLMUL:3;
    unsigned :1;
    unsigned UPLLIDIV:3;
    unsigned :4;
    unsigned UPLLEN:1;
    unsigned FPLLODIV:3;
  };
  struct {
    unsigned w:32;
  };
} __DEVCFG2bits_t;
volatile __DEVCFG2bits_t DEVCFG2bits __asm__ ("DEVCFG2");
volatile unsigned int        DEVCFG1;
typedef union {
  struct {
    unsigned FNOSC:3;
    unsigned :2;
    unsigned FSOSCEN:1;
    unsigned :1;
    unsigned IESO:1;
    unsigned POSCMOD:2;
    unsigned OSCIOFNC:1;
    unsigned :1;
    unsigned FPBDIV:2;
    unsigned FCKSM:2;
    unsigned WDTPS:5;
    unsigned :1;
    unsigned WINDIS:1;
    unsigned FWDTEN:1;
    unsigned FWDTWINSZ:2;
  };
  struct {
    unsigned w:32;
  };
} __DEVCFG1bits_t;
volatile __DEVCFG1bits_t DEVCFG1bits __asm__ ("DEVCFG1");
volatile unsigned int        DEVCFG0;
typedef union {
  struct {
    unsigned DEBUG:2;
    unsigned JTAGEN:1;
    unsigned ICESEL:2;
    unsigned :7;
    unsigned PWP:8;
    unsigned :4;
    unsigned BWP:1;
    unsigned :3;
    unsigned CP:1;
  };
  struct {
    unsigned FDEBUG:2;
  };
  struct {
    unsigned w:32;
  };
} __DEVCFG0bits_t;
volatile __DEVCFG0bits_t DEVCFG0bits __asm__ ("DEVCFG0");


/* #define _WDTCON_WDTCLR_POSITION                  0x00000000 */
/* #define _WDTCON_WDTCLR_MASK                      0x00000001 */
/* #define _WDTCON_WDTCLR_LENGTH                    0x00000001 */

/* #define _WDTCON_WDTWINEN_POSITION                0x00000001 */
/* #define _WDTCON_WDTWINEN_MASK                    0x00000002 */
/* #define _WDTCON_WDTWINEN_LENGTH                  0x00000001 */

/* #define _WDTCON_SWDTPS_POSITION                  0x00000002 */
/* #define _WDTCON_SWDTPS_MASK                      0x0000007C */
/* #define _WDTCON_SWDTPS_LENGTH                    0x00000005 */

/* #define _WDTCON_ON_POSITION                      0x0000000F */
/* #define _WDTCON_ON_MASK                          0x00008000 */
/* #define _WDTCON_ON_LENGTH                        0x00000001 */

/* #define _WDTCON_SWDTPS0_POSITION                 0x00000002 */
/* #define _WDTCON_SWDTPS0_MASK                     0x00000004 */
/* #define _WDTCON_SWDTPS0_LENGTH                   0x00000001 */

/* #define _WDTCON_SWDTPS1_POSITION                 0x00000003 */
/* #define _WDTCON_SWDTPS1_MASK                     0x00000008 */
/* #define _WDTCON_SWDTPS1_LENGTH                   0x00000001 */

/* #define _WDTCON_SWDTPS2_POSITION                 0x00000004 */
/* #define _WDTCON_SWDTPS2_MASK                     0x00000010 */
/* #define _WDTCON_SWDTPS2_LENGTH                   0x00000001 */

/* #define _WDTCON_SWDTPS3_POSITION                 0x00000005 */
/* #define _WDTCON_SWDTPS3_MASK                     0x00000020 */
/* #define _WDTCON_SWDTPS3_LENGTH                   0x00000001 */

/* #define _WDTCON_SWDTPS4_POSITION                 0x00000006 */
/* #define _WDTCON_SWDTPS4_MASK                     0x00000040 */
/* #define _WDTCON_SWDTPS4_LENGTH                   0x00000001 */

/* #define _WDTCON_WDTPSTA_POSITION                 0x00000002 */
/* #define _WDTCON_WDTPSTA_MASK                     0x0000007C */
/* #define _WDTCON_WDTPSTA_LENGTH                   0x00000005 */

/* #define _WDTCON_WDTPS_POSITION                   0x00000002 */
/* #define _WDTCON_WDTPS_MASK                       0x0000007C */
/* #define _WDTCON_WDTPS_LENGTH                     0x00000005 */

/* #define _WDTCON_w_POSITION                       0x00000000 */
/* #define _WDTCON_w_MASK                           0xFFFFFFFF */
/* #define _WDTCON_w_LENGTH                         0x00000020 */

/* #define _RTCCON_RTCOE_POSITION                   0x00000000 */
/* #define _RTCCON_RTCOE_MASK                       0x00000001 */
/* #define _RTCCON_RTCOE_LENGTH                     0x00000001 */

/* #define _RTCCON_HALFSEC_POSITION                 0x00000001 */
/* #define _RTCCON_HALFSEC_MASK                     0x00000002 */
/* #define _RTCCON_HALFSEC_LENGTH                   0x00000001 */

/* #define _RTCCON_RTCSYNC_POSITION                 0x00000002 */
/* #define _RTCCON_RTCSYNC_MASK                     0x00000004 */
/* #define _RTCCON_RTCSYNC_LENGTH                   0x00000001 */

/* #define _RTCCON_RTCWREN_POSITION                 0x00000003 */
/* #define _RTCCON_RTCWREN_MASK                     0x00000008 */
/* #define _RTCCON_RTCWREN_LENGTH                   0x00000001 */

/* #define _RTCCON_RTCCLKON_POSITION                0x00000006 */
/* #define _RTCCON_RTCCLKON_MASK                    0x00000040 */
/* #define _RTCCON_RTCCLKON_LENGTH                  0x00000001 */

/* #define _RTCCON_RTSECSEL_POSITION                0x00000007 */
/* #define _RTCCON_RTSECSEL_MASK                    0x00000080 */
/* #define _RTCCON_RTSECSEL_LENGTH                  0x00000001 */

