rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _RTCCON_SIDL_POSITION                    0x0000000D */
/* #define _RTCCON_SIDL_MASK                        0x00002000 */
/* #define _RTCCON_SIDL_LENGTH                      0x00000001 */

/* #define _RTCCON_ON_POSITION                      0x0000000F */
/* #define _RTCCON_ON_MASK                          0x00008000 */
/* #define _RTCCON_ON_LENGTH                        0x00000001 */

/* #define _RTCCON_CAL_POSITION                     0x00000010 */
/* #define _RTCCON_CAL_MASK                         0x03FF0000 */
/* #define _RTCCON_CAL_LENGTH                       0x0000000A */

/* #define _RTCCON_w_POSITION                       0x00000000 */
/* #define _RTCCON_w_MASK                           0xFFFFFFFF */
/* #define _RTCCON_w_LENGTH                         0x00000020 */

/* #define _RTCALRM_ARPT_POSITION                   0x00000000 */
/* #define _RTCALRM_ARPT_MASK                       0x000000FF */
/* #define _RTCALRM_ARPT_LENGTH                     0x00000008 */

/* #define _RTCALRM_AMASK_POSITION                  0x00000008 */
/* #define _RTCALRM_AMASK_MASK                      0x00000F00 */
/* #define _RTCALRM_AMASK_LENGTH                    0x00000004 */

/* #define _RTCALRM_ALRMSYNC_POSITION               0x0000000C */
/* #define _RTCALRM_ALRMSYNC_MASK                   0x00001000 */
/* #define _RTCALRM_ALRMSYNC_LENGTH                 0x00000001 */

/* #define _RTCALRM_PIV_POSITION                    0x0000000D */
/* #define _RTCALRM_PIV_MASK                        0x00002000 */
/* #define _RTCALRM_PIV_LENGTH                      0x00000001 */

/* #define _RTCALRM_CHIME_POSITION                  0x0000000E */
/* #define _RTCALRM_CHIME_MASK                      0x00004000 */
/* #define _RTCALRM_CHIME_LENGTH                    0x00000001 */

/* #define _RTCALRM_ALRMEN_POSITION                 0x0000000F */
/* #define _RTCALRM_ALRMEN_MASK                     0x00008000 */
/* #define _RTCALRM_ALRMEN_LENGTH                   0x00000001 */

/* #define _RTCALRM_w_POSITION                      0x00000000 */
/* #define _RTCALRM_w_MASK                          0xFFFFFFFF */
/* #define _RTCALRM_w_LENGTH                        0x00000020 */

/* #define _RTCTIME_SEC01_POSITION                  0x00000008 */
/* #define _RTCTIME_SEC01_MASK                      0x00000F00 */
/* #define _RTCTIME_SEC01_LENGTH                    0x00000004 */

/* #define _RTCTIME_SEC10_POSITION                  0x0000000C */
/* #define _RTCTIME_SEC10_MASK                      0x0000F000 */
/* #define _RTCTIME_SEC10_LENGTH                    0x00000004 */

/* #define _RTCTIME_MIN01_POSITION                  0x00000010 */
/* #define _RTCTIME_MIN01_MASK                      0x000F0000 */
/* #define _RTCTIME_MIN01_LENGTH                    0x00000004 */

/* #define _RTCTIME_MIN10_POSITION                  0x00000014 */
/* #define _RTCTIME_MIN10_MASK                      0x00F00000 */
/* #define _RTCTIME_MIN10_LENGTH                    0x00000004 */

/* #define _RTCTIME_HR01_POSITION                   0x00000018 */
/* #define _RTCTIME_HR01_MASK                       0x0F000000 */
/* #define _RTCTIME_HR01_LENGTH                     0x00000004 */

/* #define _RTCTIME_HR10_POSITION                   0x0000001C */
/* #define _RTCTIME_HR10_MASK                       0xF0000000 */
/* #define _RTCTIME_HR10_LENGTH                     0x00000004 */

/* #define _RTCTIME_w_POSITION                      0x00000000 */
/* #define _RTCTIME_w_MASK                          0xFFFFFFFF */
/* #define _RTCTIME_w_LENGTH                        0x00000020 */

/* #define _RTCDATE_WDAY01_POSITION                 0x00000000 */
/* #define _RTCDATE_WDAY01_MASK                     0x0000000F */
/* #define _RTCDATE_WDAY01_LENGTH                   0x00000004 */

/* #define _RTCDATE_DAY01_POSITION                  0x00000008 */
/* #define _RTCDATE_DAY01_MASK                      0x00000F00 */
/* #define _RTCDATE_DAY01_LENGTH                    0x00000004 */

/* #define _RTCDATE_DAY10_POSITION                  0x0000000C */
/* #define _RTCDATE_DAY10_MASK                      0x0000F000 */
/* #define _RTCDATE_DAY10_LENGTH                    0x00000004 */

/* #define _RTCDATE_MONTH01_POSITION                0x00000010 */
/* #define _RTCDATE_MONTH01_MASK                    0x000F0000 */
/* #define _RTCDATE_MONTH01_LENGTH                  0x00000004 */

/* #define _RTCDATE_MONTH10_POSITION                0x00000014 */
/* #define _RTCDATE_MONTH10_MASK                    0x00F00000 */
/* #define _RTCDATE_MONTH10_LENGTH                  0x00000004 */

/* #define _RTCDATE_YEAR01_POSITION                 0x00000018 */
/* #define _RTCDATE_YEAR01_MASK                     0x0F000000 */
/* #define _RTCDATE_YEAR01_LENGTH                   0x00000004 */

/* #define _RTCDATE_YEAR10_POSITION                 0x0000001C */
/* #define _RTCDATE_YEAR10_MASK                     0xF0000000 */
/* #define _RTCDATE_YEAR10_LENGTH                   0x00000004 */

/* #define _RTCDATE_w_POSITION                      0x00000000 */
/* #define _RTCDATE_w_MASK                          0xFFFFFFFF */
/* #define _RTCDATE_w_LENGTH                        0x00000020 */

/* #define _ALRMTIME_SEC01_POSITION                 0x00000008 */
/* #define _ALRMTIME_SEC01_MASK                     0x00000F00 */
/* #define _ALRMTIME_SEC01_LENGTH                   0x00000004 */

/* #define _ALRMTIME_SEC10_POSITION                 0x0000000C */
/* #define _ALRMTIME_SEC10_MASK                     0x0000F000 */
/* #define _ALRMTIME_SEC10_LENGTH                   0x00000004 */

/* #define _ALRMTIME_MIN01_POSITION                 0x00000010 */
/* #define _ALRMTIME_MIN01_MASK                     0x000F0000 */
/* #define _ALRMTIME_MIN01_LENGTH                   0x00000004 */

/* #define _ALRMTIME_MIN10_POSITION                 0x00000014 */
/* #define _ALRMTIME_MIN10_MASK                     0x00F00000 */
/* #define _ALRMTIME_MIN10_LENGTH                   0x00000004 */

/* #define _ALRMTIME_HR01_POSITION                  0x00000018 */
/* #define _ALRMTIME_HR01_MASK                      0x0F000000 */
/* #define _ALRMTIME_HR01_LENGTH                    0x00000004 */

