rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _ALRMTIME_HR10_POSITION                  0x0000001C */
/* #define _ALRMTIME_HR10_MASK                      0xF0000000 */
/* #define _ALRMTIME_HR10_LENGTH                    0x00000004 */

/* #define _ALRMTIME_w_POSITION                     0x00000000 */
/* #define _ALRMTIME_w_MASK                         0xFFFFFFFF */
/* #define _ALRMTIME_w_LENGTH                       0x00000020 */

/* #define _ALRMDATE_WDAY01_POSITION                0x00000000 */
/* #define _ALRMDATE_WDAY01_MASK                    0x0000000F */
/* #define _ALRMDATE_WDAY01_LENGTH                  0x00000004 */

/* #define _ALRMDATE_DAY01_POSITION                 0x00000008 */
/* #define _ALRMDATE_DAY01_MASK                     0x00000F00 */
/* #define _ALRMDATE_DAY01_LENGTH                   0x00000004 */

/* #define _ALRMDATE_DAY10_POSITION                 0x0000000C */
/* #define _ALRMDATE_DAY10_MASK                     0x0000F000 */
/* #define _ALRMDATE_DAY10_LENGTH                   0x00000004 */

/* #define _ALRMDATE_MONTH01_POSITION               0x00000010 */
/* #define _ALRMDATE_MONTH01_MASK                   0x000F0000 */
/* #define _ALRMDATE_MONTH01_LENGTH                 0x00000004 */

/* #define _ALRMDATE_MONTH10_POSITION               0x00000014 */
/* #define _ALRMDATE_MONTH10_MASK                   0x00F00000 */
/* #define _ALRMDATE_MONTH10_LENGTH                 0x00000004 */

/* #define _ALRMDATE_w_POSITION                     0x00000000 */
/* #define _ALRMDATE_w_MASK                         0xFFFFFFFF */
/* #define _ALRMDATE_w_LENGTH                       0x00000020 */

/* #define _T1CON_TCS_POSITION                      0x00000001 */
/* #define _T1CON_TCS_MASK                          0x00000002 */
/* #define _T1CON_TCS_LENGTH                        0x00000001 */

/* #define _T1CON_TSYNC_POSITION                    0x00000002 */
/* #define _T1CON_TSYNC_MASK                        0x00000004 */
/* #define _T1CON_TSYNC_LENGTH                      0x00000001 */

/* #define _T1CON_TCKPS_POSITION                    0x00000004 */
/* #define _T1CON_TCKPS_MASK                        0x00000030 */
/* #define _T1CON_TCKPS_LENGTH                      0x00000002 */

/* #define _T1CON_TGATE_POSITION                    0x00000007 */
/* #define _T1CON_TGATE_MASK                        0x00000080 */
/* #define _T1CON_TGATE_LENGTH                      0x00000001 */

/* #define _T1CON_TWIP_POSITION                     0x0000000B */
/* #define _T1CON_TWIP_MASK                         0x00000800 */
/* #define _T1CON_TWIP_LENGTH                       0x00000001 */

/* #define _T1CON_TWDIS_POSITION                    0x0000000C */
/* #define _T1CON_TWDIS_MASK                        0x00001000 */
/* #define _T1CON_TWDIS_LENGTH                      0x00000001 */

/* #define _T1CON_SIDL_POSITION                     0x0000000D */
/* #define _T1CON_SIDL_MASK                         0x00002000 */
/* #define _T1CON_SIDL_LENGTH                       0x00000001 */

/* #define _T1CON_ON_POSITION                       0x0000000F */
/* #define _T1CON_ON_MASK                           0x00008000 */
/* #define _T1CON_ON_LENGTH                         0x00000001 */

/* #define _T1CON_TCKPS0_POSITION                   0x00000004 */
/* #define _T1CON_TCKPS0_MASK                       0x00000010 */
/* #define _T1CON_TCKPS0_LENGTH                     0x00000001 */

/* #define _T1CON_TCKPS1_POSITION                   0x00000005 */
/* #define _T1CON_TCKPS1_MASK                       0x00000020 */
/* #define _T1CON_TCKPS1_LENGTH                     0x00000001 */

/* #define _T1CON_TSIDL_POSITION                    0x0000000D */
/* #define _T1CON_TSIDL_MASK                        0x00002000 */
/* #define _T1CON_TSIDL_LENGTH                      0x00000001 */

/* #define _T1CON_TON_POSITION                      0x0000000F */
/* #define _T1CON_TON_MASK                          0x00008000 */
/* #define _T1CON_TON_LENGTH                        0x00000001 */

/* #define _T1CON_w_POSITION                        0x00000000 */
/* #define _T1CON_w_MASK                            0xFFFFFFFF */
/* #define _T1CON_w_LENGTH                          0x00000020 */

/* #define _T2CON_TCS_POSITION                      0x00000001 */
/* #define _T2CON_TCS_MASK                          0x00000002 */
/* #define _T2CON_TCS_LENGTH                        0x00000001 */

/* #define _T2CON_T32_POSITION                      0x00000003 */
/* #define _T2CON_T32_MASK                          0x00000008 */
/* #define _T2CON_T32_LENGTH                        0x00000001 */

/* #define _T2CON_TCKPS_POSITION                    0x00000004 */
/* #define _T2CON_TCKPS_MASK                        0x00000070 */
/* #define _T2CON_TCKPS_LENGTH                      0x00000003 */

/* #define _T2CON_TGATE_POSITION                    0x00000007 */
/* #define _T2CON_TGATE_MASK                        0x00000080 */
/* #define _T2CON_TGATE_LENGTH                      0x00000001 */

/* #define _T2CON_SIDL_POSITION                     0x0000000D */
/* #define _T2CON_SIDL_MASK                         0x00002000 */
/* #define _T2CON_SIDL_LENGTH                       0x00000001 */

/* #define _T2CON_ON_POSITION                       0x0000000F */
/* #define _T2CON_ON_MASK                           0x00008000 */
/* #define _T2CON_ON_LENGTH                         0x00000001 */

/* #define _T2CON_TCKPS0_POSITION                   0x00000004 */
/* #define _T2CON_TCKPS0_MASK                       0x00000010 */
/* #define _T2CON_TCKPS0_LENGTH                     0x00000001 */

/* #define _T2CON_TCKPS1_POSITION                   0x00000005 */
/* #define _T2CON_TCKPS1_MASK                       0x00000020 */
/* #define _T2CON_TCKPS1_LENGTH                     0x00000001 */

/* #define _T2CON_TCKPS2_POSITION                   0x00000006 */
/* #define _T2CON_TCKPS2_MASK                       0x00000040 */
/* #define _T2CON_TCKPS2_LENGTH                     0x00000001 */

/* #define _T2CON_TSIDL_POSITION                    0x0000000D */
/* #define _T2CON_TSIDL_MASK                        0x00002000 */
/* #define _T2CON_TSIDL_LENGTH                      0x00000001 */

/* #define _T2CON_TON_POSITION                      0x0000000F */
/* #define _T2CON_TON_MASK                          0x00008000 */
/* #define _T2CON_TON_LENGTH                        0x00000001 */

