rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _T2CON_w_POSITION                        0x00000000 */
/* #define _T2CON_w_MASK                            0xFFFFFFFF */
/* #define _T2CON_w_LENGTH                          0x00000020 */

/* #define _T3CON_TCS_POSITION                      0x00000001 */
/* #define _T3CON_TCS_MASK                          0x00000002 */
/* #define _T3CON_TCS_LENGTH                        0x00000001 */

/* #define _T3CON_T32_POSITION                      0x00000003 */
/* #define _T3CON_T32_MASK                          0x00000008 */
/* #define _T3CON_T32_LENGTH                        0x00000001 */

/* #define _T3CON_TCKPS_POSITION                    0x00000004 */
/* #define _T3CON_TCKPS_MASK                        0x00000070 */
/* #define _T3CON_TCKPS_LENGTH                      0x00000003 */

/* #define _T3CON_TGATE_POSITION                    0x00000007 */
/* #define _T3CON_TGATE_MASK                        0x00000080 */
/* #define _T3CON_TGATE_LENGTH                      0x00000001 */

/* #define _T3CON_SIDL_POSITION                     0x0000000D */
/* #define _T3CON_SIDL_MASK                         0x00002000 */
/* #define _T3CON_SIDL_LENGTH                       0x00000001 */

/* #define _T3CON_ON_POSITION                       0x0000000F */
/* #define _T3CON_ON_MASK                           0x00008000 */
/* #define _T3CON_ON_LENGTH                         0x00000001 */

/* #define _T3CON_TCKPS0_POSITION                   0x00000004 */
/* #define _T3CON_TCKPS0_MASK                       0x00000010 */
/* #define _T3CON_TCKPS0_LENGTH                     0x00000001 */

/* #define _T3CON_TCKPS1_POSITION                   0x00000005 */
/* #define _T3CON_TCKPS1_MASK                       0x00000020 */
/* #define _T3CON_TCKPS1_LENGTH                     0x00000001 */

/* #define _T3CON_TCKPS2_POSITION                   0x00000006 */
/* #define _T3CON_TCKPS2_MASK                       0x00000040 */
/* #define _T3CON_TCKPS2_LENGTH                     0x00000001 */

/* #define _T3CON_TSIDL_POSITION                    0x0000000D */
/* #define _T3CON_TSIDL_MASK                        0x00002000 */
/* #define _T3CON_TSIDL_LENGTH                      0x00000001 */

/* #define _T3CON_TON_POSITION                      0x0000000F */
/* #define _T3CON_TON_MASK                          0x00008000 */
/* #define _T3CON_TON_LENGTH                        0x00000001 */

/* #define _T3CON_w_POSITION                        0x00000000 */
/* #define _T3CON_w_MASK                            0xFFFFFFFF */
/* #define _T3CON_w_LENGTH                          0x00000020 */

/* #define _T4CON_TCS_POSITION                      0x00000001 */
/* #define _T4CON_TCS_MASK                          0x00000002 */
/* #define _T4CON_TCS_LENGTH                        0x00000001 */

/* #define _T4CON_T32_POSITION                      0x00000003 */
/* #define _T4CON_T32_MASK                          0x00000008 */
/* #define _T4CON_T32_LENGTH                        0x00000001 */

/* #define _T4CON_TCKPS_POSITION                    0x00000004 */
/* #define _T4CON_TCKPS_MASK                        0x00000070 */
/* #define _T4CON_TCKPS_LENGTH                      0x00000003 */

/* #define _T4CON_TGATE_POSITION                    0x00000007 */
/* #define _T4CON_TGATE_MASK                        0x00000080 */
/* #define _T4CON_TGATE_LENGTH                      0x00000001 */

/* #define _T4CON_SIDL_POSITION                     0x0000000D */
/* #define _T4CON_SIDL_MASK                         0x00002000 */
/* #define _T4CON_SIDL_LENGTH                       0x00000001 */

/* #define _T4CON_ON_POSITION                       0x0000000F */
/* #define _T4CON_ON_MASK                           0x00008000 */
/* #define _T4CON_ON_LENGTH                         0x00000001 */

/* #define _T4CON_TCKPS0_POSITION                   0x00000004 */
/* #define _T4CON_TCKPS0_MASK                       0x00000010 */
/* #define _T4CON_TCKPS0_LENGTH                     0x00000001 */

/* #define _T4CON_TCKPS1_POSITION                   0x00000005 */
/* #define _T4CON_TCKPS1_MASK                       0x00000020 */
/* #define _T4CON_TCKPS1_LENGTH                     0x00000001 */

/* #define _T4CON_TCKPS2_POSITION                   0x00000006 */
/* #define _T4CON_TCKPS2_MASK                       0x00000040 */
/* #define _T4CON_TCKPS2_LENGTH                     0x00000001 */

/* #define _T4CON_TSIDL_POSITION                    0x0000000D */
/* #define _T4CON_TSIDL_MASK                        0x00002000 */
/* #define _T4CON_TSIDL_LENGTH                      0x00000001 */

/* #define _T4CON_TON_POSITION                      0x0000000F */
/* #define _T4CON_TON_MASK                          0x00008000 */
/* #define _T4CON_TON_LENGTH                        0x00000001 */

/* #define _T4CON_w_POSITION                        0x00000000 */
/* #define _T4CON_w_MASK                            0xFFFFFFFF */
/* #define _T4CON_w_LENGTH                          0x00000020 */

/* #define _T5CON_TCS_POSITION                      0x00000001 */
/* #define _T5CON_TCS_MASK                          0x00000002 */
/* #define _T5CON_TCS_LENGTH                        0x00000001 */

/* #define _T5CON_T32_POSITION                      0x00000003 */
/* #define _T5CON_T32_MASK                          0x00000008 */
/* #define _T5CON_T32_LENGTH                        0x00000001 */

/* #define _T5CON_TCKPS_POSITION                    0x00000004 */
/* #define _T5CON_TCKPS_MASK                        0x00000070 */
/* #define _T5CON_TCKPS_LENGTH                      0x00000003 */

/* #define _T5CON_TGATE_POSITION                    0x00000007 */
/* #define _T5CON_TGATE_MASK                        0x00000080 */
/* #define _T5CON_TGATE_LENGTH                      0x00000001 */

/* #define _T5CON_SIDL_POSITION                     0x0000000D */
/* #define _T5CON_SIDL_MASK                         0x00002000 */
/* #define _T5CON_SIDL_LENGTH                       0x00000001 */

/* #define _T5CON_ON_POSITION                       0x0000000F */
/* #define _T5CON_ON_MASK                           0x00008000 */
/* #define _T5CON_ON_LENGTH                         0x00000001 */

/* #define _T5CON_TCKPS0_POSITION                   0x00000004 */
/* #define _T5CON_TCKPS0_MASK                       0x00000010 */
/* #define _T5CON_TCKPS0_LENGTH                     0x00000001 */

