rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _T5CON_TCKPS1_POSITION                   0x00000005 */
/* #define _T5CON_TCKPS1_MASK                       0x00000020 */
/* #define _T5CON_TCKPS1_LENGTH                     0x00000001 */

/* #define _T5CON_TCKPS2_POSITION                   0x00000006 */
/* #define _T5CON_TCKPS2_MASK                       0x00000040 */
/* #define _T5CON_TCKPS2_LENGTH                     0x00000001 */

/* #define _T5CON_TSIDL_POSITION                    0x0000000D */
/* #define _T5CON_TSIDL_MASK                        0x00002000 */
/* #define _T5CON_TSIDL_LENGTH                      0x00000001 */

/* #define _T5CON_TON_POSITION                      0x0000000F */
/* #define _T5CON_TON_MASK                          0x00008000 */
/* #define _T5CON_TON_LENGTH                        0x00000001 */

/* #define _T5CON_w_POSITION                        0x00000000 */
/* #define _T5CON_w_MASK                            0xFFFFFFFF */
/* #define _T5CON_w_LENGTH                          0x00000020 */

/* #define _IC1CON_ICM_POSITION                     0x00000000 */
/* #define _IC1CON_ICM_MASK                         0x00000007 */
/* #define _IC1CON_ICM_LENGTH                       0x00000003 */

/* #define _IC1CON_ICBNE_POSITION                   0x00000003 */
/* #define _IC1CON_ICBNE_MASK                       0x00000008 */
/* #define _IC1CON_ICBNE_LENGTH                     0x00000001 */

/* #define _IC1CON_ICOV_POSITION                    0x00000004 */
/* #define _IC1CON_ICOV_MASK                        0x00000010 */
/* #define _IC1CON_ICOV_LENGTH                      0x00000001 */

/* #define _IC1CON_ICI_POSITION                     0x00000005 */
/* #define _IC1CON_ICI_MASK                         0x00000060 */
/* #define _IC1CON_ICI_LENGTH                       0x00000002 */

/* #define _IC1CON_ICTMR_POSITION                   0x00000007 */
/* #define _IC1CON_ICTMR_MASK                       0x00000080 */
/* #define _IC1CON_ICTMR_LENGTH                     0x00000001 */

/* #define _IC1CON_C32_POSITION                     0x00000008 */
/* #define _IC1CON_C32_MASK                         0x00000100 */
/* #define _IC1CON_C32_LENGTH                       0x00000001 */

/* #define _IC1CON_FEDGE_POSITION                   0x00000009 */
/* #define _IC1CON_FEDGE_MASK                       0x00000200 */
/* #define _IC1CON_FEDGE_LENGTH                     0x00000001 */

/* #define _IC1CON_SIDL_POSITION                    0x0000000D */
/* #define _IC1CON_SIDL_MASK                        0x00002000 */
/* #define _IC1CON_SIDL_LENGTH                      0x00000001 */

/* #define _IC1CON_ON_POSITION                      0x0000000F */
/* #define _IC1CON_ON_MASK                          0x00008000 */
/* #define _IC1CON_ON_LENGTH                        0x00000001 */

/* #define _IC1CON_ICM0_POSITION                    0x00000000 */
/* #define _IC1CON_ICM0_MASK                        0x00000001 */
/* #define _IC1CON_ICM0_LENGTH                      0x00000001 */

/* #define _IC1CON_ICM1_POSITION                    0x00000001 */
/* #define _IC1CON_ICM1_MASK                        0x00000002 */
/* #define _IC1CON_ICM1_LENGTH                      0x00000001 */

/* #define _IC1CON_ICM2_POSITION                    0x00000002 */
/* #define _IC1CON_ICM2_MASK                        0x00000004 */
/* #define _IC1CON_ICM2_LENGTH                      0x00000001 */

/* #define _IC1CON_ICI0_POSITION                    0x00000005 */
/* #define _IC1CON_ICI0_MASK                        0x00000020 */
/* #define _IC1CON_ICI0_LENGTH                      0x00000001 */

/* #define _IC1CON_ICI1_POSITION                    0x00000006 */
/* #define _IC1CON_ICI1_MASK                        0x00000040 */
/* #define _IC1CON_ICI1_LENGTH                      0x00000001 */

/* #define _IC1CON_ICSIDL_POSITION                  0x0000000D */
/* #define _IC1CON_ICSIDL_MASK                      0x00002000 */
/* #define _IC1CON_ICSIDL_LENGTH                    0x00000001 */

/* #define _IC1CON_w_POSITION                       0x00000000 */
/* #define _IC1CON_w_MASK                           0xFFFFFFFF */
/* #define _IC1CON_w_LENGTH                         0x00000020 */

/* #define _IC2CON_ICM_POSITION                     0x00000000 */
/* #define _IC2CON_ICM_MASK                         0x00000007 */
/* #define _IC2CON_ICM_LENGTH                       0x00000003 */

/* #define _IC2CON_ICBNE_POSITION                   0x00000003 */
/* #define _IC2CON_ICBNE_MASK                       0x00000008 */
/* #define _IC2CON_ICBNE_LENGTH                     0x00000001 */

/* #define _IC2CON_ICOV_POSITION                    0x00000004 */
/* #define _IC2CON_ICOV_MASK                        0x00000010 */
/* #define _IC2CON_ICOV_LENGTH                      0x00000001 */

/* #define _IC2CON_ICI_POSITION                     0x00000005 */
/* #define _IC2CON_ICI_MASK                         0x00000060 */
/* #define _IC2CON_ICI_LENGTH                       0x00000002 */

/* #define _IC2CON_ICTMR_POSITION                   0x00000007 */
/* #define _IC2CON_ICTMR_MASK                       0x00000080 */
/* #define _IC2CON_ICTMR_LENGTH                     0x00000001 */

/* #define _IC2CON_C32_POSITION                     0x00000008 */
/* #define _IC2CON_C32_MASK                         0x00000100 */
/* #define _IC2CON_C32_LENGTH                       0x00000001 */

/* #define _IC2CON_FEDGE_POSITION                   0x00000009 */
/* #define _IC2CON_FEDGE_MASK                       0x00000200 */
/* #define _IC2CON_FEDGE_LENGTH                     0x00000001 */

/* #define _IC2CON_SIDL_POSITION                    0x0000000D */
/* #define _IC2CON_SIDL_MASK                        0x00002000 */
/* #define _IC2CON_SIDL_LENGTH                      0x00000001 */

/* #define _IC2CON_ON_POSITION                      0x0000000F */
/* #define _IC2CON_ON_MASK                          0x00008000 */
/* #define _IC2CON_ON_LENGTH                        0x00000001 */

/* #define _IC2CON_ICM0_POSITION                    0x00000000 */
/* #define _IC2CON_ICM0_MASK                        0x00000001 */
/* #define _IC2CON_ICM0_LENGTH                      0x00000001 */

/* #define _IC2CON_ICM1_POSITION                    0x00000001 */
/* #define _IC2CON_ICM1_MASK                        0x00000002 */
/* #define _IC2CON_ICM1_LENGTH                      0x00000001 */

/* #define _IC2CON_ICM2_POSITION                    0x00000002 */
/* #define _IC2CON_ICM2_MASK                        0x00000004 */
/* #define _IC2CON_ICM2_LENGTH                      0x00000001 */

/* #define _IC2CON_ICI0_POSITION                    0x00000005 */
/* #define _IC2CON_ICI0_MASK                        0x00000020 */
/* #define _IC2CON_ICI0_LENGTH                      0x00000001 */

/* #define _IC2CON_ICI1_POSITION                    0x00000006 */
/* #define _IC2CON_ICI1_MASK                        0x00000040 */
/* #define _IC2CON_ICI1_LENGTH                      0x00000001 */

/* #define _IC2CON_ICSIDL_POSITION                  0x0000000D */
/* #define _IC2CON_ICSIDL_MASK                      0x00002000 */
/* #define _IC2CON_ICSIDL_LENGTH                    0x00000001 */

/* #define _IC2CON_w_POSITION                       0x00000000 */
/* #define _IC2CON_w_MASK                           0xFFFFFFFF */
/* #define _IC2CON_w_LENGTH                         0x00000020 */

/* #define _IC3CON_ICM_POSITION                     0x00000000 */
/* #define _IC3CON_ICM_MASK                         0x00000007 */
/* #define _IC3CON_ICM_LENGTH                       0x00000003 */

