rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _IC5CON_ICOV_POSITION                    0x00000004 */
/* #define _IC5CON_ICOV_MASK                        0x00000010 */
/* #define _IC5CON_ICOV_LENGTH                      0x00000001 */

/* #define _IC5CON_ICI_POSITION                     0x00000005 */
/* #define _IC5CON_ICI_MASK                         0x00000060 */
/* #define _IC5CON_ICI_LENGTH                       0x00000002 */

/* #define _IC5CON_ICTMR_POSITION                   0x00000007 */
/* #define _IC5CON_ICTMR_MASK                       0x00000080 */
/* #define _IC5CON_ICTMR_LENGTH                     0x00000001 */

/* #define _IC5CON_C32_POSITION                     0x00000008 */
/* #define _IC5CON_C32_MASK                         0x00000100 */
/* #define _IC5CON_C32_LENGTH                       0x00000001 */

/* #define _IC5CON_FEDGE_POSITION                   0x00000009 */
/* #define _IC5CON_FEDGE_MASK                       0x00000200 */
/* #define _IC5CON_FEDGE_LENGTH                     0x00000001 */

/* #define _IC5CON_SIDL_POSITION                    0x0000000D */
/* #define _IC5CON_SIDL_MASK                        0x00002000 */
/* #define _IC5CON_SIDL_LENGTH                      0x00000001 */

/* #define _IC5CON_ON_POSITION                      0x0000000F */
/* #define _IC5CON_ON_MASK                          0x00008000 */
/* #define _IC5CON_ON_LENGTH                        0x00000001 */

/* #define _IC5CON_ICM0_POSITION                    0x00000000 */
/* #define _IC5CON_ICM0_MASK                        0x00000001 */
/* #define _IC5CON_ICM0_LENGTH                      0x00000001 */

/* #define _IC5CON_ICM1_POSITION                    0x00000001 */
/* #define _IC5CON_ICM1_MASK                        0x00000002 */
/* #define _IC5CON_ICM1_LENGTH                      0x00000001 */

/* #define _IC5CON_ICM2_POSITION                    0x00000002 */
/* #define _IC5CON_ICM2_MASK                        0x00000004 */
/* #define _IC5CON_ICM2_LENGTH                      0x00000001 */

/* #define _IC5CON_ICI0_POSITION                    0x00000005 */
/* #define _IC5CON_ICI0_MASK                        0x00000020 */
/* #define _IC5CON_ICI0_LENGTH                      0x00000001 */

/* #define _IC5CON_ICI1_POSITION                    0x00000006 */
/* #define _IC5CON_ICI1_MASK                        0x00000040 */
/* #define _IC5CON_ICI1_LENGTH                      0x00000001 */

/* #define _IC5CON_ICSIDL_POSITION                  0x0000000D */
/* #define _IC5CON_ICSIDL_MASK                      0x00002000 */
/* #define _IC5CON_ICSIDL_LENGTH                    0x00000001 */

/* #define _IC5CON_w_POSITION                       0x00000000 */
/* #define _IC5CON_w_MASK                           0xFFFFFFFF */
/* #define _IC5CON_w_LENGTH                         0x00000020 */

/* #define _OC1CON_OCM_POSITION                     0x00000000 */
/* #define _OC1CON_OCM_MASK                         0x00000007 */
/* #define _OC1CON_OCM_LENGTH                       0x00000003 */

/* #define _OC1CON_OCTSEL_POSITION                  0x00000003 */
/* #define _OC1CON_OCTSEL_MASK                      0x00000008 */
/* #define _OC1CON_OCTSEL_LENGTH                    0x00000001 */

/* #define _OC1CON_OCFLT_POSITION                   0x00000004 */
/* #define _OC1CON_OCFLT_MASK                       0x00000010 */
/* #define _OC1CON_OCFLT_LENGTH                     0x00000001 */

/* #define _OC1CON_OC32_POSITION                    0x00000005 */
/* #define _OC1CON_OC32_MASK                        0x00000020 */
/* #define _OC1CON_OC32_LENGTH                      0x00000001 */

/* #define _OC1CON_SIDL_POSITION                    0x0000000D */
/* #define _OC1CON_SIDL_MASK                        0x00002000 */
/* #define _OC1CON_SIDL_LENGTH                      0x00000001 */

/* #define _OC1CON_ON_POSITION                      0x0000000F */
/* #define _OC1CON_ON_MASK                          0x00008000 */
/* #define _OC1CON_ON_LENGTH                        0x00000001 */

/* #define _OC1CON_OCM0_POSITION                    0x00000000 */
/* #define _OC1CON_OCM0_MASK                        0x00000001 */
/* #define _OC1CON_OCM0_LENGTH                      0x00000001 */

/* #define _OC1CON_OCM1_POSITION                    0x00000001 */
/* #define _OC1CON_OCM1_MASK                        0x00000002 */
/* #define _OC1CON_OCM1_LENGTH                      0x00000001 */

/* #define _OC1CON_OCM2_POSITION                    0x00000002 */
/* #define _OC1CON_OCM2_MASK                        0x00000004 */
/* #define _OC1CON_OCM2_LENGTH                      0x00000001 */

/* #define _OC1CON_OCSIDL_POSITION                  0x0000000D */
/* #define _OC1CON_OCSIDL_MASK                      0x00002000 */
/* #define _OC1CON_OCSIDL_LENGTH                    0x00000001 */

/* #define _OC1CON_w_POSITION                       0x00000000 */
/* #define _OC1CON_w_MASK                           0xFFFFFFFF */
/* #define _OC1CON_w_LENGTH                         0x00000020 */

/* #define _OC2CON_OCM_POSITION                     0x00000000 */
/* #define _OC2CON_OCM_MASK                         0x00000007 */
/* #define _OC2CON_OCM_LENGTH                       0x00000003 */

/* #define _OC2CON_OCTSEL_POSITION                  0x00000003 */
/* #define _OC2CON_OCTSEL_MASK                      0x00000008 */
/* #define _OC2CON_OCTSEL_LENGTH                    0x00000001 */

/* #define _OC2CON_OCFLT_POSITION                   0x00000004 */
/* #define _OC2CON_OCFLT_MASK                       0x00000010 */
/* #define _OC2CON_OCFLT_LENGTH                     0x00000001 */

/* #define _OC2CON_OC32_POSITION                    0x00000005 */
/* #define _OC2CON_OC32_MASK                        0x00000020 */
/* #define _OC2CON_OC32_LENGTH                      0x00000001 */

/* #define _OC2CON_SIDL_POSITION                    0x0000000D */
/* #define _OC2CON_SIDL_MASK                        0x00002000 */
/* #define _OC2CON_SIDL_LENGTH                      0x00000001 */

/* #define _OC2CON_ON_POSITION                      0x0000000F */
/* #define _OC2CON_ON_MASK                          0x00008000 */
/* #define _OC2CON_ON_LENGTH                        0x00000001 */

