rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _OC2CON_OCM0_POSITION                    0x00000000 */
/* #define _OC2CON_OCM0_MASK                        0x00000001 */
/* #define _OC2CON_OCM0_LENGTH                      0x00000001 */

/* #define _OC2CON_OCM1_POSITION                    0x00000001 */
/* #define _OC2CON_OCM1_MASK                        0x00000002 */
/* #define _OC2CON_OCM1_LENGTH                      0x00000001 */

/* #define _OC2CON_OCM2_POSITION                    0x00000002 */
/* #define _OC2CON_OCM2_MASK                        0x00000004 */
/* #define _OC2CON_OCM2_LENGTH                      0x00000001 */

/* #define _OC2CON_OCSIDL_POSITION                  0x0000000D */
/* #define _OC2CON_OCSIDL_MASK                      0x00002000 */
/* #define _OC2CON_OCSIDL_LENGTH                    0x00000001 */

/* #define _OC2CON_w_POSITION                       0x00000000 */
/* #define _OC2CON_w_MASK                           0xFFFFFFFF */
/* #define _OC2CON_w_LENGTH                         0x00000020 */

/* #define _OC3CON_OCM_POSITION                     0x00000000 */
/* #define _OC3CON_OCM_MASK                         0x00000007 */
/* #define _OC3CON_OCM_LENGTH                       0x00000003 */

/* #define _OC3CON_OCTSEL_POSITION                  0x00000003 */
/* #define _OC3CON_OCTSEL_MASK                      0x00000008 */
/* #define _OC3CON_OCTSEL_LENGTH                    0x00000001 */

/* #define _OC3CON_OCFLT_POSITION                   0x00000004 */
/* #define _OC3CON_OCFLT_MASK                       0x00000010 */
/* #define _OC3CON_OCFLT_LENGTH                     0x00000001 */

/* #define _OC3CON_OC32_POSITION                    0x00000005 */
/* #define _OC3CON_OC32_MASK                        0x00000020 */
/* #define _OC3CON_OC32_LENGTH                      0x00000001 */

/* #define _OC3CON_SIDL_POSITION                    0x0000000D */
/* #define _OC3CON_SIDL_MASK                        0x00002000 */
/* #define _OC3CON_SIDL_LENGTH                      0x00000001 */

/* #define _OC3CON_ON_POSITION                      0x0000000F */
/* #define _OC3CON_ON_MASK                          0x00008000 */
/* #define _OC3CON_ON_LENGTH                        0x00000001 */

/* #define _OC3CON_OCM0_POSITION                    0x00000000 */
/* #define _OC3CON_OCM0_MASK                        0x00000001 */
/* #define _OC3CON_OCM0_LENGTH                      0x00000001 */

/* #define _OC3CON_OCM1_POSITION                    0x00000001 */
/* #define _OC3CON_OCM1_MASK                        0x00000002 */
/* #define _OC3CON_OCM1_LENGTH                      0x00000001 */

/* #define _OC3CON_OCM2_POSITION                    0x00000002 */
/* #define _OC3CON_OCM2_MASK                        0x00000004 */
/* #define _OC3CON_OCM2_LENGTH                      0x00000001 */

/* #define _OC3CON_OCSIDL_POSITION                  0x0000000D */
/* #define _OC3CON_OCSIDL_MASK                      0x00002000 */
/* #define _OC3CON_OCSIDL_LENGTH                    0x00000001 */

/* #define _OC3CON_w_POSITION                       0x00000000 */
/* #define _OC3CON_w_MASK                           0xFFFFFFFF */
/* #define _OC3CON_w_LENGTH                         0x00000020 */

/* #define _OC4CON_OCM_POSITION                     0x00000000 */
/* #define _OC4CON_OCM_MASK                         0x00000007 */
/* #define _OC4CON_OCM_LENGTH                       0x00000003 */

/* #define _OC4CON_OCTSEL_POSITION                  0x00000003 */
/* #define _OC4CON_OCTSEL_MASK                      0x00000008 */
/* #define _OC4CON_OCTSEL_LENGTH                    0x00000001 */

/* #define _OC4CON_OCFLT_POSITION                   0x00000004 */
/* #define _OC4CON_OCFLT_MASK                       0x00000010 */
/* #define _OC4CON_OCFLT_LENGTH                     0x00000001 */

/* #define _OC4CON_OC32_POSITION                    0x00000005 */
/* #define _OC4CON_OC32_MASK                        0x00000020 */
/* #define _OC4CON_OC32_LENGTH                      0x00000001 */

/* #define _OC4CON_SIDL_POSITION                    0x0000000D */
/* #define _OC4CON_SIDL_MASK                        0x00002000 */
/* #define _OC4CON_SIDL_LENGTH                      0x00000001 */

/* #define _OC4CON_ON_POSITION                      0x0000000F */
/* #define _OC4CON_ON_MASK                          0x00008000 */
/* #define _OC4CON_ON_LENGTH                        0x00000001 */

/* #define _OC4CON_OCM0_POSITION                    0x00000000 */
/* #define _OC4CON_OCM0_MASK                        0x00000001 */
/* #define _OC4CON_OCM0_LENGTH                      0x00000001 */

/* #define _OC4CON_OCM1_POSITION                    0x00000001 */
/* #define _OC4CON_OCM1_MASK                        0x00000002 */
/* #define _OC4CON_OCM1_LENGTH                      0x00000001 */

/* #define _OC4CON_OCM2_POSITION                    0x00000002 */
/* #define _OC4CON_OCM2_MASK                        0x00000004 */
/* #define _OC4CON_OCM2_LENGTH                      0x00000001 */

/* #define _OC4CON_OCSIDL_POSITION                  0x0000000D */
/* #define _OC4CON_OCSIDL_MASK                      0x00002000 */
/* #define _OC4CON_OCSIDL_LENGTH                    0x00000001 */

/* #define _OC4CON_w_POSITION                       0x00000000 */
/* #define _OC4CON_w_MASK                           0xFFFFFFFF */
/* #define _OC4CON_w_LENGTH                         0x00000020 */

/* #define _OC5CON_OCM_POSITION                     0x00000000 */
/* #define _OC5CON_OCM_MASK                         0x00000007 */
/* #define _OC5CON_OCM_LENGTH                       0x00000003 */

/* #define _OC5CON_OCTSEL_POSITION                  0x00000003 */
/* #define _OC5CON_OCTSEL_MASK                      0x00000008 */
/* #define _OC5CON_OCTSEL_LENGTH                    0x00000001 */

/* #define _OC5CON_OCFLT_POSITION                   0x00000004 */
/* #define _OC5CON_OCFLT_MASK                       0x00000010 */
/* #define _OC5CON_OCFLT_LENGTH                     0x00000001 */

/* #define _OC5CON_OC32_POSITION                    0x00000005 */
/* #define _OC5CON_OC32_MASK                        0x00000020 */
/* #define _OC5CON_OC32_LENGTH                      0x00000001 */

/* #define _OC5CON_SIDL_POSITION                    0x0000000D */
/* #define _OC5CON_SIDL_MASK                        0x00002000 */
/* #define _OC5CON_SIDL_LENGTH                      0x00000001 */

/* #define _OC5CON_ON_POSITION                      0x0000000F */
/* #define _OC5CON_ON_MASK                          0x00008000 */
/* #define _OC5CON_ON_LENGTH                        0x00000001 */

/* #define _OC5CON_OCM0_POSITION                    0x00000000 */
/* #define _OC5CON_OCM0_MASK                        0x00000001 */
/* #define _OC5CON_OCM0_LENGTH                      0x00000001 */

