rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _OC5CON_OCM1_POSITION                    0x00000001 */
/* #define _OC5CON_OCM1_MASK                        0x00000002 */
/* #define _OC5CON_OCM1_LENGTH                      0x00000001 */

/* #define _OC5CON_OCM2_POSITION                    0x00000002 */
/* #define _OC5CON_OCM2_MASK                        0x00000004 */
/* #define _OC5CON_OCM2_LENGTH                      0x00000001 */

/* #define _OC5CON_OCSIDL_POSITION                  0x0000000D */
/* #define _OC5CON_OCSIDL_MASK                      0x00002000 */
/* #define _OC5CON_OCSIDL_LENGTH                    0x00000001 */

/* #define _OC5CON_w_POSITION                       0x00000000 */
/* #define _OC5CON_w_MASK                           0xFFFFFFFF */
/* #define _OC5CON_w_LENGTH                         0x00000020 */

/* #define _I2C1111CON_SEN_POSITION                 0x00000000 */
/* #define _I2C1111CON_SEN_MASK                     0x00000001 */
/* #define _I2C1111CON_SEN_LENGTH                   0x00000001 */

/* #define _I2C1111CON_RSEN_POSITION                0x00000001 */
/* #define _I2C1111CON_RSEN_MASK                    0x00000002 */
/* #define _I2C1111CON_RSEN_LENGTH                  0x00000001 */

/* #define _I2C1111CON_PEN_POSITION                 0x00000002 */
/* #define _I2C1111CON_PEN_MASK                     0x00000004 */
/* #define _I2C1111CON_PEN_LENGTH                   0x00000001 */

/* #define _I2C1111CON_RCEN_POSITION                0x00000003 */
/* #define _I2C1111CON_RCEN_MASK                    0x00000008 */
/* #define _I2C1111CON_RCEN_LENGTH                  0x00000001 */

/* #define _I2C1111CON_ACKEN_POSITION               0x00000004 */
/* #define _I2C1111CON_ACKEN_MASK                   0x00000010 */
/* #define _I2C1111CON_ACKEN_LENGTH                 0x00000001 */

/* #define _I2C1111CON_ACKDT_POSITION               0x00000005 */
/* #define _I2C1111CON_ACKDT_MASK                   0x00000020 */
/* #define _I2C1111CON_ACKDT_LENGTH                 0x00000001 */

/* #define _I2C1111CON_STREN_POSITION               0x00000006 */
/* #define _I2C1111CON_STREN_MASK                   0x00000040 */
/* #define _I2C1111CON_STREN_LENGTH                 0x00000001 */

/* #define _I2C1111CON_GCEN_POSITION                0x00000007 */
/* #define _I2C1111CON_GCEN_MASK                    0x00000080 */
/* #define _I2C1111CON_GCEN_LENGTH                  0x00000001 */

/* #define _I2C1111CON_SMEN_POSITION                0x00000008 */
/* #define _I2C1111CON_SMEN_MASK                    0x00000100 */
/* #define _I2C1111CON_SMEN_LENGTH                  0x00000001 */

/* #define _I2C1111CON_DISSLW_POSITION              0x00000009 */
/* #define _I2C1111CON_DISSLW_MASK                  0x00000200 */
/* #define _I2C1111CON_DISSLW_LENGTH                0x00000001 */

/* #define _I2C1111CON_A10M_POSITION                0x0000000A */
/* #define _I2C1111CON_A10M_MASK                    0x00000400 */
/* #define _I2C1111CON_A10M_LENGTH                  0x00000001 */

/* #define _I2C1111CON_STRICT_POSITION              0x0000000B */
/* #define _I2C1111CON_STRICT_MASK                  0x00000800 */
/* #define _I2C1111CON_STRICT_LENGTH                0x00000001 */

/* #define _I2C1111CON_SCLREL_POSITION              0x0000000C */
/* #define _I2C1111CON_SCLREL_MASK                  0x00001000 */
/* #define _I2C1111CON_SCLREL_LENGTH                0x00000001 */

/* #define _I2C1111CON_SIDL_POSITION                0x0000000D */
/* #define _I2C1111CON_SIDL_MASK                    0x00002000 */
/* #define _I2C1111CON_SIDL_LENGTH                  0x00000001 */

/* #define _I2C1111CON_ON_POSITION                  0x0000000F */
/* #define _I2C1111CON_ON_MASK                      0x00008000 */
/* #define _I2C1111CON_ON_LENGTH                    0x00000001 */

/* #define _I2C1111CON_IPMIEN_POSITION              0x0000000B */
/* #define _I2C1111CON_IPMIEN_MASK                  0x00000800 */
/* #define _I2C1111CON_IPMIEN_LENGTH                0x00000001 */

/* #define _I2C1111CON_I2CSIDL_POSITION             0x0000000D */
/* #define _I2C1111CON_I2CSIDL_MASK                 0x00002000 */
/* #define _I2C1111CON_I2CSIDL_LENGTH               0x00000001 */

/* #define _I2C1111CON_I2CEN_POSITION               0x0000000F */
/* #define _I2C1111CON_I2CEN_MASK                   0x00008000 */
/* #define _I2C1111CON_I2CEN_LENGTH                 0x00000001 */

/* #define _I2C1111CON_w_POSITION                   0x00000000 */
/* #define _I2C1111CON_w_MASK                       0xFFFFFFFF */
/* #define _I2C1111CON_w_LENGTH                     0x00000020 */

/* #define _I2C1CON_SEN_POSITION                    0x00000000 */
/* #define _I2C1CON_SEN_MASK                        0x00000001 */
/* #define _I2C1CON_SEN_LENGTH                      0x00000001 */

/* #define _I2C1CON_RSEN_POSITION                   0x00000001 */
/* #define _I2C1CON_RSEN_MASK                       0x00000002 */
/* #define _I2C1CON_RSEN_LENGTH                     0x00000001 */

/* #define _I2C1CON_PEN_POSITION                    0x00000002 */
/* #define _I2C1CON_PEN_MASK                        0x00000004 */
/* #define _I2C1CON_PEN_LENGTH                      0x00000001 */

/* #define _I2C1CON_RCEN_POSITION                   0x00000003 */
/* #define _I2C1CON_RCEN_MASK                       0x00000008 */
/* #define _I2C1CON_RCEN_LENGTH                     0x00000001 */

/* #define _I2C1CON_ACKEN_POSITION                  0x00000004 */
/* #define _I2C1CON_ACKEN_MASK                      0x00000010 */
/* #define _I2C1CON_ACKEN_LENGTH                    0x00000001 */

/* #define _I2C1CON_ACKDT_POSITION                  0x00000005 */
/* #define _I2C1CON_ACKDT_MASK                      0x00000020 */
/* #define _I2C1CON_ACKDT_LENGTH                    0x00000001 */

/* #define _I2C1CON_STREN_POSITION                  0x00000006 */
/* #define _I2C1CON_STREN_MASK                      0x00000040 */
/* #define _I2C1CON_STREN_LENGTH                    0x00000001 */

/* #define _I2C1CON_GCEN_POSITION                   0x00000007 */
/* #define _I2C1CON_GCEN_MASK                       0x00000080 */
/* #define _I2C1CON_GCEN_LENGTH                     0x00000001 */

/* #define _I2C1CON_SMEN_POSITION                   0x00000008 */
/* #define _I2C1CON_SMEN_MASK                       0x00000100 */
/* #define _I2C1CON_SMEN_LENGTH                     0x00000001 */

/* #define _I2C1CON_DISSLW_POSITION                 0x00000009 */
/* #define _I2C1CON_DISSLW_MASK                     0x00000200 */
/* #define _I2C1CON_DISSLW_LENGTH                   0x00000001 */

