rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _I2C1CON_A10M_POSITION                   0x0000000A */
/* #define _I2C1CON_A10M_MASK                       0x00000400 */
/* #define _I2C1CON_A10M_LENGTH                     0x00000001 */

/* #define _I2C1CON_STRICT_POSITION                 0x0000000B */
/* #define _I2C1CON_STRICT_MASK                     0x00000800 */
/* #define _I2C1CON_STRICT_LENGTH                   0x00000001 */

/* #define _I2C1CON_SCLREL_POSITION                 0x0000000C */
/* #define _I2C1CON_SCLREL_MASK                     0x00001000 */
/* #define _I2C1CON_SCLREL_LENGTH                   0x00000001 */

/* #define _I2C1CON_SIDL_POSITION                   0x0000000D */
/* #define _I2C1CON_SIDL_MASK                       0x00002000 */
/* #define _I2C1CON_SIDL_LENGTH                     0x00000001 */

/* #define _I2C1CON_ON_POSITION                     0x0000000F */
/* #define _I2C1CON_ON_MASK                         0x00008000 */
/* #define _I2C1CON_ON_LENGTH                       0x00000001 */

/* #define _I2C1CON_IPMIEN_POSITION                 0x0000000B */
/* #define _I2C1CON_IPMIEN_MASK                     0x00000800 */
/* #define _I2C1CON_IPMIEN_LENGTH                   0x00000001 */

/* #define _I2C1CON_I2CSIDL_POSITION                0x0000000D */
/* #define _I2C1CON_I2CSIDL_MASK                    0x00002000 */
/* #define _I2C1CON_I2CSIDL_LENGTH                  0x00000001 */

/* #define _I2C1CON_I2CEN_POSITION                  0x0000000F */
/* #define _I2C1CON_I2CEN_MASK                      0x00008000 */
/* #define _I2C1CON_I2CEN_LENGTH                    0x00000001 */

/* #define _I2C1CON_w_POSITION                      0x00000000 */
/* #define _I2C1CON_w_MASK                          0xFFFFFFFF */
/* #define _I2C1CON_w_LENGTH                        0x00000020 */

/* #define _I2C1111STAT_TBF_POSITION                0x00000000 */
/* #define _I2C1111STAT_TBF_MASK                    0x00000001 */
/* #define _I2C1111STAT_TBF_LENGTH                  0x00000001 */

/* #define _I2C1111STAT_RBF_POSITION                0x00000001 */
/* #define _I2C1111STAT_RBF_MASK                    0x00000002 */
/* #define _I2C1111STAT_RBF_LENGTH                  0x00000001 */

/* #define _I2C1111STAT_R_W_POSITION                0x00000002 */
/* #define _I2C1111STAT_R_W_MASK                    0x00000004 */
/* #define _I2C1111STAT_R_W_LENGTH                  0x00000001 */

/* #define _I2C1111STAT_S_POSITION                  0x00000003 */
/* #define _I2C1111STAT_S_MASK                      0x00000008 */
/* #define _I2C1111STAT_S_LENGTH                    0x00000001 */

/* #define _I2C1111STAT_P_POSITION                  0x00000004 */
/* #define _I2C1111STAT_P_MASK                      0x00000010 */
/* #define _I2C1111STAT_P_LENGTH                    0x00000001 */

/* #define _I2C1111STAT_D_A_POSITION                0x00000005 */
/* #define _I2C1111STAT_D_A_MASK                    0x00000020 */
/* #define _I2C1111STAT_D_A_LENGTH                  0x00000001 */

/* #define _I2C1111STAT_I2COV_POSITION              0x00000006 */
/* #define _I2C1111STAT_I2COV_MASK                  0x00000040 */
/* #define _I2C1111STAT_I2COV_LENGTH                0x00000001 */

/* #define _I2C1111STAT_IWCOL_POSITION              0x00000007 */
/* #define _I2C1111STAT_IWCOL_MASK                  0x00000080 */
/* #define _I2C1111STAT_IWCOL_LENGTH                0x00000001 */

/* #define _I2C1111STAT_ADD10_POSITION              0x00000008 */
/* #define _I2C1111STAT_ADD10_MASK                  0x00000100 */
/* #define _I2C1111STAT_ADD10_LENGTH                0x00000001 */

/* #define _I2C1111STAT_GCSTAT_POSITION             0x00000009 */
/* #define _I2C1111STAT_GCSTAT_MASK                 0x00000200 */
/* #define _I2C1111STAT_GCSTAT_LENGTH               0x00000001 */

/* #define _I2C1111STAT_BCL_POSITION                0x0000000A */
/* #define _I2C1111STAT_BCL_MASK                    0x00000400 */
/* #define _I2C1111STAT_BCL_LENGTH                  0x00000001 */

/* #define _I2C1111STAT_TRSTAT_POSITION             0x0000000E */
/* #define _I2C1111STAT_TRSTAT_MASK                 0x00004000 */
/* #define _I2C1111STAT_TRSTAT_LENGTH               0x00000001 */

/* #define _I2C1111STAT_ACKSTAT_POSITION            0x0000000F */
/* #define _I2C1111STAT_ACKSTAT_MASK                0x00008000 */
/* #define _I2C1111STAT_ACKSTAT_LENGTH              0x00000001 */

/* #define _I2C1111STAT_I2CPOV_POSITION             0x00000006 */
/* #define _I2C1111STAT_I2CPOV_MASK                 0x00000040 */
/* #define _I2C1111STAT_I2CPOV_LENGTH               0x00000001 */

/* #define _I2C1111STAT_w_POSITION                  0x00000000 */
/* #define _I2C1111STAT_w_MASK                      0xFFFFFFFF */
/* #define _I2C1111STAT_w_LENGTH                    0x00000020 */

/* #define _I2C1STAT_TBF_POSITION                   0x00000000 */
/* #define _I2C1STAT_TBF_MASK                       0x00000001 */
/* #define _I2C1STAT_TBF_LENGTH                     0x00000001 */

/* #define _I2C1STAT_RBF_POSITION                   0x00000001 */
/* #define _I2C1STAT_RBF_MASK                       0x00000002 */
/* #define _I2C1STAT_RBF_LENGTH                     0x00000001 */

/* #define _I2C1STAT_R_W_POSITION                   0x00000002 */
/* #define _I2C1STAT_R_W_MASK                       0x00000004 */
/* #define _I2C1STAT_R_W_LENGTH                     0x00000001 */

/* #define _I2C1STAT_S_POSITION                     0x00000003 */
/* #define _I2C1STAT_S_MASK                         0x00000008 */
/* #define _I2C1STAT_S_LENGTH                       0x00000001 */

/* #define _I2C1STAT_P_POSITION                     0x00000004 */
/* #define _I2C1STAT_P_MASK                         0x00000010 */
/* #define _I2C1STAT_P_LENGTH                       0x00000001 */

/* #define _I2C1STAT_D_A_POSITION                   0x00000005 */
/* #define _I2C1STAT_D_A_MASK                       0x00000020 */
/* #define _I2C1STAT_D_A_LENGTH                     0x00000001 */

/* #define _I2C1STAT_I2COV_POSITION                 0x00000006 */
/* #define _I2C1STAT_I2COV_MASK                     0x00000040 */
/* #define _I2C1STAT_I2COV_LENGTH                   0x00000001 */

/* #define _I2C1STAT_IWCOL_POSITION                 0x00000007 */
/* #define _I2C1STAT_IWCOL_MASK                     0x00000080 */
/* #define _I2C1STAT_IWCOL_LENGTH                   0x00000001 */

/* #define _I2C1STAT_ADD10_POSITION                 0x00000008 */
/* #define _I2C1STAT_ADD10_MASK                     0x00000100 */
/* #define _I2C1STAT_ADD10_LENGTH                   0x00000001 */

/* #define _I2C1STAT_GCSTAT_POSITION                0x00000009 */
/* #define _I2C1STAT_GCSTAT_MASK                    0x00000200 */
/* #define _I2C1STAT_GCSTAT_LENGTH                  0x00000001 */

/* #define _I2C1STAT_BCL_POSITION                   0x0000000A */
/* #define _I2C1STAT_BCL_MASK                       0x00000400 */
/* #define _I2C1STAT_BCL_LENGTH                     0x00000001 */

/* #define _I2C1STAT_TRSTAT_POSITION                0x0000000E */
/* #define _I2C1STAT_TRSTAT_MASK                    0x00004000 */
/* #define _I2C1STAT_TRSTAT_LENGTH                  0x00000001 */

/* #define _I2C1STAT_ACKSTAT_POSITION               0x0000000F */
/* #define _I2C1STAT_ACKSTAT_MASK                   0x00008000 */
/* #define _I2C1STAT_ACKSTAT_LENGTH                 0x00000001 */

/* #define _I2C1STAT_I2CPOV_POSITION                0x00000006 */
/* #define _I2C1STAT_I2CPOV_MASK                    0x00000040 */
/* #define _I2C1STAT_I2CPOV_LENGTH                  0x00000001 */

/* #define _I2C1STAT_w_POSITION                     0x00000000 */
/* #define _I2C1STAT_w_MASK                         0xFFFFFFFF */
/* #define _I2C1STAT_w_LENGTH                       0x00000020 */

/* #define _I2C2CON_SEN_POSITION                    0x00000000 */
/* #define _I2C2CON_SEN_MASK                        0x00000001 */
/* #define _I2C2CON_SEN_LENGTH                      0x00000001 */

/* #define _I2C2CON_RSEN_POSITION                   0x00000001 */
/* #define _I2C2CON_RSEN_MASK                       0x00000002 */
/* #define _I2C2CON_RSEN_LENGTH                     0x00000001 */

/* #define _I2C2CON_PEN_POSITION                    0x00000002 */
/* #define _I2C2CON_PEN_MASK                        0x00000004 */
/* #define _I2C2CON_PEN_LENGTH                      0x00000001 */

/* #define _I2C2CON_RCEN_POSITION                   0x00000003 */
/* #define _I2C2CON_RCEN_MASK                       0x00000008 */
/* #define _I2C2CON_RCEN_LENGTH                     0x00000001 */

/* #define _I2C2CON_ACKEN_POSITION                  0x00000004 */
/* #define _I2C2CON_ACKEN_MASK                      0x00000010 */
/* #define _I2C2CON_ACKEN_LENGTH                    0x00000001 */

/* #define _I2C2CON_ACKDT_POSITION                  0x00000005 */
/* #define _I2C2CON_ACKDT_MASK                      0x00000020 */
/* #define _I2C2CON_ACKDT_LENGTH                    0x00000001 */

