rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _I2C2CON_STREN_POSITION                  0x00000006 */
/* #define _I2C2CON_STREN_MASK                      0x00000040 */
/* #define _I2C2CON_STREN_LENGTH                    0x00000001 */

/* #define _I2C2CON_GCEN_POSITION                   0x00000007 */
/* #define _I2C2CON_GCEN_MASK                       0x00000080 */
/* #define _I2C2CON_GCEN_LENGTH                     0x00000001 */

/* #define _I2C2CON_SMEN_POSITION                   0x00000008 */
/* #define _I2C2CON_SMEN_MASK                       0x00000100 */
/* #define _I2C2CON_SMEN_LENGTH                     0x00000001 */

/* #define _I2C2CON_DISSLW_POSITION                 0x00000009 */
/* #define _I2C2CON_DISSLW_MASK                     0x00000200 */
/* #define _I2C2CON_DISSLW_LENGTH                   0x00000001 */

/* #define _I2C2CON_A10M_POSITION                   0x0000000A */
/* #define _I2C2CON_A10M_MASK                       0x00000400 */
/* #define _I2C2CON_A10M_LENGTH                     0x00000001 */

/* #define _I2C2CON_STRICT_POSITION                 0x0000000B */
/* #define _I2C2CON_STRICT_MASK                     0x00000800 */
/* #define _I2C2CON_STRICT_LENGTH                   0x00000001 */

/* #define _I2C2CON_SCLREL_POSITION                 0x0000000C */
/* #define _I2C2CON_SCLREL_MASK                     0x00001000 */
/* #define _I2C2CON_SCLREL_LENGTH                   0x00000001 */

/* #define _I2C2CON_SIDL_POSITION                   0x0000000D */
/* #define _I2C2CON_SIDL_MASK                       0x00002000 */
/* #define _I2C2CON_SIDL_LENGTH                     0x00000001 */

/* #define _I2C2CON_ON_POSITION                     0x0000000F */
/* #define _I2C2CON_ON_MASK                         0x00008000 */
/* #define _I2C2CON_ON_LENGTH                       0x00000001 */

/* #define _I2C2CON_IPMIEN_POSITION                 0x0000000B */
/* #define _I2C2CON_IPMIEN_MASK                     0x00000800 */
/* #define _I2C2CON_IPMIEN_LENGTH                   0x00000001 */

/* #define _I2C2CON_I2CSIDL_POSITION                0x0000000D */
/* #define _I2C2CON_I2CSIDL_MASK                    0x00002000 */
/* #define _I2C2CON_I2CSIDL_LENGTH                  0x00000001 */

/* #define _I2C2CON_I2CEN_POSITION                  0x0000000F */
/* #define _I2C2CON_I2CEN_MASK                      0x00008000 */
/* #define _I2C2CON_I2CEN_LENGTH                    0x00000001 */

/* #define _I2C2CON_w_POSITION                      0x00000000 */
/* #define _I2C2CON_w_MASK                          0xFFFFFFFF */
/* #define _I2C2CON_w_LENGTH                        0x00000020 */

/* #define _I2CABCON_SEN_POSITION                   0x00000000 */
/* #define _I2CABCON_SEN_MASK                       0x00000001 */
/* #define _I2CABCON_SEN_LENGTH                     0x00000001 */

/* #define _I2CABCON_RSEN_POSITION                  0x00000001 */
/* #define _I2CABCON_RSEN_MASK                      0x00000002 */
/* #define _I2CABCON_RSEN_LENGTH                    0x00000001 */

/* #define _I2CABCON_PEN_POSITION                   0x00000002 */
/* #define _I2CABCON_PEN_MASK                       0x00000004 */
/* #define _I2CABCON_PEN_LENGTH                     0x00000001 */

/* #define _I2CABCON_RCEN_POSITION                  0x00000003 */
/* #define _I2CABCON_RCEN_MASK                      0x00000008 */
/* #define _I2CABCON_RCEN_LENGTH                    0x00000001 */

/* #define _I2CABCON_ACKEN_POSITION                 0x00000004 */
/* #define _I2CABCON_ACKEN_MASK                     0x00000010 */
/* #define _I2CABCON_ACKEN_LENGTH                   0x00000001 */

/* #define _I2CABCON_ACKDT_POSITION                 0x00000005 */
/* #define _I2CABCON_ACKDT_MASK                     0x00000020 */
/* #define _I2CABCON_ACKDT_LENGTH                   0x00000001 */

/* #define _I2CABCON_STREN_POSITION                 0x00000006 */
/* #define _I2CABCON_STREN_MASK                     0x00000040 */
/* #define _I2CABCON_STREN_LENGTH                   0x00000001 */

/* #define _I2CABCON_GCEN_POSITION                  0x00000007 */
/* #define _I2CABCON_GCEN_MASK                      0x00000080 */
/* #define _I2CABCON_GCEN_LENGTH                    0x00000001 */

/* #define _I2CABCON_SMEN_POSITION                  0x00000008 */
/* #define _I2CABCON_SMEN_MASK                      0x00000100 */
/* #define _I2CABCON_SMEN_LENGTH                    0x00000001 */

/* #define _I2CABCON_DISSLW_POSITION                0x00000009 */
/* #define _I2CABCON_DISSLW_MASK                    0x00000200 */
/* #define _I2CABCON_DISSLW_LENGTH                  0x00000001 */

/* #define _I2CABCON_A10M_POSITION                  0x0000000A */
/* #define _I2CABCON_A10M_MASK                      0x00000400 */
/* #define _I2CABCON_A10M_LENGTH                    0x00000001 */

/* #define _I2CABCON_STRICT_POSITION                0x0000000B */
/* #define _I2CABCON_STRICT_MASK                    0x00000800 */
/* #define _I2CABCON_STRICT_LENGTH                  0x00000001 */

/* #define _I2CABCON_SCLREL_POSITION                0x0000000C */
/* #define _I2CABCON_SCLREL_MASK                    0x00001000 */
/* #define _I2CABCON_SCLREL_LENGTH                  0x00000001 */

/* #define _I2CABCON_SIDL_POSITION                  0x0000000D */
/* #define _I2CABCON_SIDL_MASK                      0x00002000 */
/* #define _I2CABCON_SIDL_LENGTH                    0x00000001 */

/* #define _I2CABCON_ON_POSITION                    0x0000000F */
/* #define _I2CABCON_ON_MASK                        0x00008000 */
/* #define _I2CABCON_ON_LENGTH                      0x00000001 */

/* #define _I2CABCON_IPMIEN_POSITION                0x0000000B */
/* #define _I2CABCON_IPMIEN_MASK                    0x00000800 */
/* #define _I2CABCON_IPMIEN_LENGTH                  0x00000001 */

/* #define _I2CABCON_I2CSIDL_POSITION               0x0000000D */
/* #define _I2CABCON_I2CSIDL_MASK                   0x00002000 */
/* #define _I2CABCON_I2CSIDL_LENGTH                 0x00000001 */

/* #define _I2CABCON_I2CEN_POSITION                 0x0000000F */
/* #define _I2CABCON_I2CEN_MASK                     0x00008000 */
/* #define _I2CABCON_I2CEN_LENGTH                   0x00000001 */

/* #define _I2CABCON_w_POSITION                     0x00000000 */
/* #define _I2CABCON_w_MASK                         0xFFFFFFFF */
/* #define _I2CABCON_w_LENGTH                       0x00000020 */

