rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _I2C2STAT_TBF_POSITION                   0x00000000 */
/* #define _I2C2STAT_TBF_MASK                       0x00000001 */
/* #define _I2C2STAT_TBF_LENGTH                     0x00000001 */

/* #define _I2C2STAT_RBF_POSITION                   0x00000001 */
/* #define _I2C2STAT_RBF_MASK                       0x00000002 */
/* #define _I2C2STAT_RBF_LENGTH                     0x00000001 */

/* #define _I2C2STAT_R_W_POSITION                   0x00000002 */
/* #define _I2C2STAT_R_W_MASK                       0x00000004 */
/* #define _I2C2STAT_R_W_LENGTH                     0x00000001 */

/* #define _I2C2STAT_S_POSITION                     0x00000003 */
/* #define _I2C2STAT_S_MASK                         0x00000008 */
/* #define _I2C2STAT_S_LENGTH                       0x00000001 */

/* #define _I2C2STAT_P_POSITION                     0x00000004 */
/* #define _I2C2STAT_P_MASK                         0x00000010 */
/* #define _I2C2STAT_P_LENGTH                       0x00000001 */

/* #define _I2C2STAT_D_A_POSITION                   0x00000005 */
/* #define _I2C2STAT_D_A_MASK                       0x00000020 */
/* #define _I2C2STAT_D_A_LENGTH                     0x00000001 */

/* #define _I2C2STAT_I2COV_POSITION                 0x00000006 */
/* #define _I2C2STAT_I2COV_MASK                     0x00000040 */
/* #define _I2C2STAT_I2COV_LENGTH                   0x00000001 */

/* #define _I2C2STAT_IWCOL_POSITION                 0x00000007 */
/* #define _I2C2STAT_IWCOL_MASK                     0x00000080 */
/* #define _I2C2STAT_IWCOL_LENGTH                   0x00000001 */

/* #define _I2C2STAT_ADD10_POSITION                 0x00000008 */
/* #define _I2C2STAT_ADD10_MASK                     0x00000100 */
/* #define _I2C2STAT_ADD10_LENGTH                   0x00000001 */

/* #define _I2C2STAT_GCSTAT_POSITION                0x00000009 */
/* #define _I2C2STAT_GCSTAT_MASK                    0x00000200 */
/* #define _I2C2STAT_GCSTAT_LENGTH                  0x00000001 */

/* #define _I2C2STAT_BCL_POSITION                   0x0000000A */
/* #define _I2C2STAT_BCL_MASK                       0x00000400 */
/* #define _I2C2STAT_BCL_LENGTH                     0x00000001 */

/* #define _I2C2STAT_TRSTAT_POSITION                0x0000000E */
/* #define _I2C2STAT_TRSTAT_MASK                    0x00004000 */
/* #define _I2C2STAT_TRSTAT_LENGTH                  0x00000001 */

/* #define _I2C2STAT_ACKSTAT_POSITION               0x0000000F */
/* #define _I2C2STAT_ACKSTAT_MASK                   0x00008000 */
/* #define _I2C2STAT_ACKSTAT_LENGTH                 0x00000001 */

/* #define _I2C2STAT_I2CPOV_POSITION                0x00000006 */
/* #define _I2C2STAT_I2CPOV_MASK                    0x00000040 */
/* #define _I2C2STAT_I2CPOV_LENGTH                  0x00000001 */

/* #define _I2C2STAT_w_POSITION                     0x00000000 */
/* #define _I2C2STAT_w_MASK                         0xFFFFFFFF */
/* #define _I2C2STAT_w_LENGTH                       0x00000020 */

/* #define _I2CABSTAT_TBF_POSITION                  0x00000000 */
/* #define _I2CABSTAT_TBF_MASK                      0x00000001 */
/* #define _I2CABSTAT_TBF_LENGTH                    0x00000001 */

/* #define _I2CABSTAT_RBF_POSITION                  0x00000001 */
/* #define _I2CABSTAT_RBF_MASK                      0x00000002 */
/* #define _I2CABSTAT_RBF_LENGTH                    0x00000001 */

/* #define _I2CABSTAT_R_W_POSITION                  0x00000002 */
/* #define _I2CABSTAT_R_W_MASK                      0x00000004 */
/* #define _I2CABSTAT_R_W_LENGTH                    0x00000001 */

/* #define _I2CABSTAT_S_POSITION                    0x00000003 */
/* #define _I2CABSTAT_S_MASK                        0x00000008 */
/* #define _I2CABSTAT_S_LENGTH                      0x00000001 */

/* #define _I2CABSTAT_P_POSITION                    0x00000004 */
/* #define _I2CABSTAT_P_MASK                        0x00000010 */
/* #define _I2CABSTAT_P_LENGTH                      0x00000001 */

/* #define _I2CABSTAT_D_A_POSITION                  0x00000005 */
/* #define _I2CABSTAT_D_A_MASK                      0x00000020 */
/* #define _I2CABSTAT_D_A_LENGTH                    0x00000001 */

/* #define _I2CABSTAT_I2COV_POSITION                0x00000006 */
/* #define _I2CABSTAT_I2COV_MASK                    0x00000040 */
/* #define _I2CABSTAT_I2COV_LENGTH                  0x00000001 */

/* #define _I2CABSTAT_IWCOL_POSITION                0x00000007 */
/* #define _I2CABSTAT_IWCOL_MASK                    0x00000080 */
/* #define _I2CABSTAT_IWCOL_LENGTH                  0x00000001 */

/* #define _I2CABSTAT_ADD10_POSITION                0x00000008 */
/* #define _I2CABSTAT_ADD10_MASK                    0x00000100 */
/* #define _I2CABSTAT_ADD10_LENGTH                  0x00000001 */

/* #define _I2CABSTAT_GCSTAT_POSITION               0x00000009 */
/* #define _I2CABSTAT_GCSTAT_MASK                   0x00000200 */
/* #define _I2CABSTAT_GCSTAT_LENGTH                 0x00000001 */

/* #define _I2CABSTAT_BCL_POSITION                  0x0000000A */
/* #define _I2CABSTAT_BCL_MASK                      0x00000400 */
/* #define _I2CABSTAT_BCL_LENGTH                    0x00000001 */

/* #define _I2CABSTAT_TRSTAT_POSITION               0x0000000E */
/* #define _I2CABSTAT_TRSTAT_MASK                   0x00004000 */
/* #define _I2CABSTAT_TRSTAT_LENGTH                 0x00000001 */

/* #define _I2CABSTAT_ACKSTAT_POSITION              0x0000000F */
/* #define _I2CABSTAT_ACKSTAT_MASK                  0x00008000 */
/* #define _I2CABSTAT_ACKSTAT_LENGTH                0x00000001 */

/* #define _I2CABSTAT_I2CPOV_POSITION               0x00000006 */
/* #define _I2CABSTAT_I2CPOV_MASK                   0x00000040 */
/* #define _I2CABSTAT_I2CPOV_LENGTH                 0x00000001 */

/* #define _I2CABSTAT_w_POSITION                    0x00000000 */
/* #define _I2CABSTAT_w_MASK                        0xFFFFFFFF */
/* #define _I2CABSTAT_w_LENGTH                      0x00000020 */

/* #define _SPI1CON_SRXISEL_POSITION                0x00000000 */
/* #define _SPI1CON_SRXISEL_MASK                    0x00000003 */
/* #define _SPI1CON_SRXISEL_LENGTH                  0x00000002 */

/* #define _SPI1CON_STXISEL_POSITION                0x00000002 */
/* #define _SPI1CON_STXISEL_MASK                    0x0000000C */
/* #define _SPI1CON_STXISEL_LENGTH                  0x00000002 */

/* #define _SPI1CON_DISSDI_POSITION                 0x00000004 */
/* #define _SPI1CON_DISSDI_MASK                     0x00000010 */
/* #define _SPI1CON_DISSDI_LENGTH                   0x00000001 */

