rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _SPI1CON2_SPITUREN_POSITION              0x0000000A */
/* #define _SPI1CON2_SPITUREN_MASK                  0x00000400 */
/* #define _SPI1CON2_SPITUREN_LENGTH                0x00000001 */

/* #define _SPI1CON2_SPIROVEN_POSITION              0x0000000B */
/* #define _SPI1CON2_SPIROVEN_MASK                  0x00000800 */
/* #define _SPI1CON2_SPIROVEN_LENGTH                0x00000001 */

/* #define _SPI1CON2_FRMERREN_POSITION              0x0000000C */
/* #define _SPI1CON2_FRMERREN_MASK                  0x00001000 */
/* #define _SPI1CON2_FRMERREN_LENGTH                0x00000001 */

/* #define _SPI1CON2_SPISGNEXT_POSITION             0x0000000F */
/* #define _SPI1CON2_SPISGNEXT_MASK                 0x00008000 */
/* #define _SPI1CON2_SPISGNEXT_LENGTH               0x00000001 */

/* #define _SPI1CON2_AUDMOD0_POSITION               0x00000000 */
/* #define _SPI1CON2_AUDMOD0_MASK                   0x00000001 */
/* #define _SPI1CON2_AUDMOD0_LENGTH                 0x00000001 */

/* #define _SPI1CON2_AUDMOD1_POSITION               0x00000001 */
/* #define _SPI1CON2_AUDMOD1_MASK                   0x00000002 */
/* #define _SPI1CON2_AUDMOD1_LENGTH                 0x00000001 */

/* #define _SPI1CON2_w_POSITION                     0x00000000 */
/* #define _SPI1CON2_w_MASK                         0xFFFFFFFF */
/* #define _SPI1CON2_w_LENGTH                       0x00000020 */

/* #define _SPI2CON_SRXISEL_POSITION                0x00000000 */
/* #define _SPI2CON_SRXISEL_MASK                    0x00000003 */
/* #define _SPI2CON_SRXISEL_LENGTH                  0x00000002 */

/* #define _SPI2CON_STXISEL_POSITION                0x00000002 */
/* #define _SPI2CON_STXISEL_MASK                    0x0000000C */
/* #define _SPI2CON_STXISEL_LENGTH                  0x00000002 */

/* #define _SPI2CON_DISSDI_POSITION                 0x00000004 */
/* #define _SPI2CON_DISSDI_MASK                     0x00000010 */
/* #define _SPI2CON_DISSDI_LENGTH                   0x00000001 */

/* #define _SPI2CON_MSTEN_POSITION                  0x00000005 */
/* #define _SPI2CON_MSTEN_MASK                      0x00000020 */
/* #define _SPI2CON_MSTEN_LENGTH                    0x00000001 */

/* #define _SPI2CON_CKP_POSITION                    0x00000006 */
/* #define _SPI2CON_CKP_MASK                        0x00000040 */
/* #define _SPI2CON_CKP_LENGTH                      0x00000001 */

/* #define _SPI2CON_SSEN_POSITION                   0x00000007 */
/* #define _SPI2CON_SSEN_MASK                       0x00000080 */
/* #define _SPI2CON_SSEN_LENGTH                     0x00000001 */

/* #define _SPI2CON_CKE_POSITION                    0x00000008 */
/* #define _SPI2CON_CKE_MASK                        0x00000100 */
/* #define _SPI2CON_CKE_LENGTH                      0x00000001 */

/* #define _SPI2CON_SMP_POSITION                    0x00000009 */
/* #define _SPI2CON_SMP_MASK                        0x00000200 */
/* #define _SPI2CON_SMP_LENGTH                      0x00000001 */

/* #define _SPI2CON_MODE16_POSITION                 0x0000000A */
/* #define _SPI2CON_MODE16_MASK                     0x00000400 */
/* #define _SPI2CON_MODE16_LENGTH                   0x00000001 */

/* #define _SPI2CON_MODE32_POSITION                 0x0000000B */
/* #define _SPI2CON_MODE32_MASK                     0x00000800 */
/* #define _SPI2CON_MODE32_LENGTH                   0x00000001 */

/* #define _SPI2CON_DISSDO_POSITION                 0x0000000C */
/* #define _SPI2CON_DISSDO_MASK                     0x00001000 */
/* #define _SPI2CON_DISSDO_LENGTH                   0x00000001 */

/* #define _SPI2CON_SIDL_POSITION                   0x0000000D */
/* #define _SPI2CON_SIDL_MASK                       0x00002000 */
/* #define _SPI2CON_SIDL_LENGTH                     0x00000001 */

/* #define _SPI2CON_ON_POSITION                     0x0000000F */
/* #define _SPI2CON_ON_MASK                         0x00008000 */
/* #define _SPI2CON_ON_LENGTH                       0x00000001 */

/* #define _SPI2CON_ENHBUF_POSITION                 0x00000010 */
/* #define _SPI2CON_ENHBUF_MASK                     0x00010000 */
/* #define _SPI2CON_ENHBUF_LENGTH                   0x00000001 */

/* #define _SPI2CON_SPIFE_POSITION                  0x00000011 */
/* #define _SPI2CON_SPIFE_MASK                      0x00020000 */
/* #define _SPI2CON_SPIFE_LENGTH                    0x00000001 */

/* #define _SPI2CON_MCLKSEL_POSITION                0x00000017 */
/* #define _SPI2CON_MCLKSEL_MASK                    0x00800000 */
/* #define _SPI2CON_MCLKSEL_LENGTH                  0x00000001 */

/* #define _SPI2CON_FRMCNT_POSITION                 0x00000018 */
/* #define _SPI2CON_FRMCNT_MASK                     0x07000000 */
/* #define _SPI2CON_FRMCNT_LENGTH                   0x00000003 */

/* #define _SPI2CON_FRMSYPW_POSITION                0x0000001B */
/* #define _SPI2CON_FRMSYPW_MASK                    0x08000000 */
/* #define _SPI2CON_FRMSYPW_LENGTH                  0x00000001 */

/* #define _SPI2CON_MSSEN_POSITION                  0x0000001C */
/* #define _SPI2CON_MSSEN_MASK                      0x10000000 */
/* #define _SPI2CON_MSSEN_LENGTH                    0x00000001 */

/* #define _SPI2CON_FRMPOL_POSITION                 0x0000001D */
/* #define _SPI2CON_FRMPOL_MASK                     0x20000000 */
/* #define _SPI2CON_FRMPOL_LENGTH                   0x00000001 */

/* #define _SPI2CON_FRMSYNC_POSITION                0x0000001E */
/* #define _SPI2CON_FRMSYNC_MASK                    0x40000000 */
/* #define _SPI2CON_FRMSYNC_LENGTH                  0x00000001 */

/* #define _SPI2CON_FRMEN_POSITION                  0x0000001F */
/* #define _SPI2CON_FRMEN_MASK                      0x80000000 */
/* #define _SPI2CON_FRMEN_LENGTH                    0x00000001 */

/* #define _SPI2CON_w_POSITION                      0x00000000 */
/* #define _SPI2CON_w_MASK                          0xFFFFFFFF */
/* #define _SPI2CON_w_LENGTH                        0x00000020 */

/* #define _SPI2STAT_SPIRBF_POSITION                0x00000000 */
/* #define _SPI2STAT_SPIRBF_MASK                    0x00000001 */
/* #define _SPI2STAT_SPIRBF_LENGTH                  0x00000001 */

