rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _U3MODE_SIDL_POSITION                    0x0000000D */
/* #define _U3MODE_SIDL_MASK                        0x00002000 */
/* #define _U3MODE_SIDL_LENGTH                      0x00000001 */

/* #define _U3MODE_ON_POSITION                      0x0000000F */
/* #define _U3MODE_ON_MASK                          0x00008000 */
/* #define _U3MODE_ON_LENGTH                        0x00000001 */

/* #define _U3MODE_PDSEL0_POSITION                  0x00000001 */
/* #define _U3MODE_PDSEL0_MASK                      0x00000002 */
/* #define _U3MODE_PDSEL0_LENGTH                    0x00000001 */

/* #define _U3MODE_PDSEL1_POSITION                  0x00000002 */
/* #define _U3MODE_PDSEL1_MASK                      0x00000004 */
/* #define _U3MODE_PDSEL1_LENGTH                    0x00000001 */

/* #define _U3MODE_UEN0_POSITION                    0x00000008 */
/* #define _U3MODE_UEN0_MASK                        0x00000100 */
/* #define _U3MODE_UEN0_LENGTH                      0x00000001 */

/* #define _U3MODE_UEN1_POSITION                    0x00000009 */
/* #define _U3MODE_UEN1_MASK                        0x00000200 */
/* #define _U3MODE_UEN1_LENGTH                      0x00000001 */

/* #define _U3MODE_USIDL_POSITION                   0x0000000D */
/* #define _U3MODE_USIDL_MASK                       0x00002000 */
/* #define _U3MODE_USIDL_LENGTH                     0x00000001 */

/* #define _U3MODE_UARTEN_POSITION                  0x0000000F */
/* #define _U3MODE_UARTEN_MASK                      0x00008000 */
/* #define _U3MODE_UARTEN_LENGTH                    0x00000001 */

/* #define _U3MODE_w_POSITION                       0x00000000 */
/* #define _U3MODE_w_MASK                           0xFFFFFFFF */
/* #define _U3MODE_w_LENGTH                         0x00000020 */

/* #define _U39STA_URXDA_POSITION                   0x00000000 */
/* #define _U39STA_URXDA_MASK                       0x00000001 */
/* #define _U39STA_URXDA_LENGTH                     0x00000001 */

/* #define _U39STA_OERR_POSITION                    0x00000001 */
/* #define _U39STA_OERR_MASK                        0x00000002 */
/* #define _U39STA_OERR_LENGTH                      0x00000001 */

/* #define _U39STA_FERR_POSITION                    0x00000002 */
/* #define _U39STA_FERR_MASK                        0x00000004 */
/* #define _U39STA_FERR_LENGTH                      0x00000001 */

/* #define _U39STA_PERR_POSITION                    0x00000003 */
/* #define _U39STA_PERR_MASK                        0x00000008 */
/* #define _U39STA_PERR_LENGTH                      0x00000001 */

/* #define _U39STA_RIDLE_POSITION                   0x00000004 */
/* #define _U39STA_RIDLE_MASK                       0x00000010 */
/* #define _U39STA_RIDLE_LENGTH                     0x00000001 */

/* #define _U39STA_ADDEN_POSITION                   0x00000005 */
/* #define _U39STA_ADDEN_MASK                       0x00000020 */
/* #define _U39STA_ADDEN_LENGTH                     0x00000001 */

/* #define _U39STA_URXISEL_POSITION                 0x00000006 */
/* #define _U39STA_URXISEL_MASK                     0x000000C0 */
/* #define _U39STA_URXISEL_LENGTH                   0x00000002 */

/* #define _U39STA_TRMT_POSITION                    0x00000008 */
/* #define _U39STA_TRMT_MASK                        0x00000100 */
/* #define _U39STA_TRMT_LENGTH                      0x00000001 */

/* #define _U39STA_UTXBF_POSITION                   0x00000009 */
/* #define _U39STA_UTXBF_MASK                       0x00000200 */
/* #define _U39STA_UTXBF_LENGTH                     0x00000001 */

/* #define _U39STA_UTXEN_POSITION                   0x0000000A */
/* #define _U39STA_UTXEN_MASK                       0x00000400 */
/* #define _U39STA_UTXEN_LENGTH                     0x00000001 */

/* #define _U39STA_UTXBRK_POSITION                  0x0000000B */
/* #define _U39STA_UTXBRK_MASK                      0x00000800 */
/* #define _U39STA_UTXBRK_LENGTH                    0x00000001 */

/* #define _U39STA_URXEN_POSITION                   0x0000000C */
/* #define _U39STA_URXEN_MASK                       0x00001000 */
/* #define _U39STA_URXEN_LENGTH                     0x00000001 */

/* #define _U39STA_UTXINV_POSITION                  0x0000000D */
/* #define _U39STA_UTXINV_MASK                      0x00002000 */
/* #define _U39STA_UTXINV_LENGTH                    0x00000001 */

/* #define _U39STA_UTXISEL_POSITION                 0x0000000E */
/* #define _U39STA_UTXISEL_MASK                     0x0000C000 */
/* #define _U39STA_UTXISEL_LENGTH                   0x00000002 */

/* #define _U39STA_ADDR_POSITION                    0x00000010 */
/* #define _U39STA_ADDR_MASK                        0x00FF0000 */
/* #define _U39STA_ADDR_LENGTH                      0x00000008 */

/* #define _U39STA_ADM_EN_POSITION                  0x00000018 */
/* #define _U39STA_ADM_EN_MASK                      0x01000000 */
/* #define _U39STA_ADM_EN_LENGTH                    0x00000001 */

/* #define _U39STA_URXISEL0_POSITION                0x00000006 */
/* #define _U39STA_URXISEL0_MASK                    0x00000040 */
/* #define _U39STA_URXISEL0_LENGTH                  0x00000001 */

/* #define _U39STA_URXISEL1_POSITION                0x00000007 */
/* #define _U39STA_URXISEL1_MASK                    0x00000080 */
/* #define _U39STA_URXISEL1_LENGTH                  0x00000001 */

/* #define _U39STA_UTXISEL0_POSITION                0x0000000E */
/* #define _U39STA_UTXISEL0_MASK                    0x00004000 */
/* #define _U39STA_UTXISEL0_LENGTH                  0x00000001 */

/* #define _U39STA_UTXISEL1_POSITION                0x0000000F */
/* #define _U39STA_UTXISEL1_MASK                    0x00008000 */
/* #define _U39STA_UTXISEL1_LENGTH                  0x00000001 */

/* #define _U39STA_UTXSEL_POSITION                  0x0000000E */
/* #define _U39STA_UTXSEL_MASK                      0x0000C000 */
/* #define _U39STA_UTXSEL_LENGTH                    0x00000002 */

/* #define _U39STA_w_POSITION                       0x00000000 */
/* #define _U39STA_w_MASK                           0xFFFFFFFF */
/* #define _U39STA_w_LENGTH                         0x00000020 */

/* #define _U3STA_URXDA_POSITION                    0x00000000 */
/* #define _U3STA_URXDA_MASK                        0x00000001 */
/* #define _U3STA_URXDA_LENGTH                      0x00000001 */

/* #define _U3STA_OERR_POSITION                     0x00000001 */
/* #define _U3STA_OERR_MASK                         0x00000002 */
/* #define _U3STA_OERR_LENGTH                       0x00000001 */

