rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _PMCON_ALP_POSITION                      0x00000005 */
/* #define _PMCON_ALP_MASK                          0x00000020 */
/* #define _PMCON_ALP_LENGTH                        0x00000001 */

/* #define _PMCON_CSF_POSITION                      0x00000006 */
/* #define _PMCON_CSF_MASK                          0x000000C0 */
/* #define _PMCON_CSF_LENGTH                        0x00000002 */

/* #define _PMCON_PTRDEN_POSITION                   0x00000008 */
/* #define _PMCON_PTRDEN_MASK                       0x00000100 */
/* #define _PMCON_PTRDEN_LENGTH                     0x00000001 */

/* #define _PMCON_PTWREN_POSITION                   0x00000009 */
/* #define _PMCON_PTWREN_MASK                       0x00000200 */
/* #define _PMCON_PTWREN_LENGTH                     0x00000001 */

/* #define _PMCON_PMPTTL_POSITION                   0x0000000A */
/* #define _PMCON_PMPTTL_MASK                       0x00000400 */
/* #define _PMCON_PMPTTL_LENGTH                     0x00000001 */

/* #define _PMCON_ADRMUX_POSITION                   0x0000000B */
/* #define _PMCON_ADRMUX_MASK                       0x00001800 */
/* #define _PMCON_ADRMUX_LENGTH                     0x00000002 */

/* #define _PMCON_SIDL_POSITION                     0x0000000D */
/* #define _PMCON_SIDL_MASK                         0x00002000 */
/* #define _PMCON_SIDL_LENGTH                       0x00000001 */

/* #define _PMCON_ON_POSITION                       0x0000000F */
/* #define _PMCON_ON_MASK                           0x00008000 */
/* #define _PMCON_ON_LENGTH                         0x00000001 */

/* #define _PMCON_CSF0_POSITION                     0x00000006 */
/* #define _PMCON_CSF0_MASK                         0x00000040 */
/* #define _PMCON_CSF0_LENGTH                       0x00000001 */

/* #define _PMCON_CSF1_POSITION                     0x00000007 */
/* #define _PMCON_CSF1_MASK                         0x00000080 */
/* #define _PMCON_CSF1_LENGTH                       0x00000001 */

/* #define _PMCON_ADRMUX0_POSITION                  0x0000000B */
/* #define _PMCON_ADRMUX0_MASK                      0x00000800 */
/* #define _PMCON_ADRMUX0_LENGTH                    0x00000001 */

/* #define _PMCON_ADRMUX1_POSITION                  0x0000000C */
/* #define _PMCON_ADRMUX1_MASK                      0x00001000 */
/* #define _PMCON_ADRMUX1_LENGTH                    0x00000001 */

/* #define _PMCON_PSIDL_POSITION                    0x0000000D */
/* #define _PMCON_PSIDL_MASK                        0x00002000 */
/* #define _PMCON_PSIDL_LENGTH                      0x00000001 */

/* #define _PMCON_PMPEN_POSITION                    0x0000000F */
/* #define _PMCON_PMPEN_MASK                        0x00008000 */
/* #define _PMCON_PMPEN_LENGTH                      0x00000001 */

/* #define _PMCON_w_POSITION                        0x00000000 */
/* #define _PMCON_w_MASK                            0xFFFFFFFF */
/* #define _PMCON_w_LENGTH                          0x00000020 */

/* #define _PMMODE_WAITE_POSITION                   0x00000000 */
/* #define _PMMODE_WAITE_MASK                       0x00000003 */
/* #define _PMMODE_WAITE_LENGTH                     0x00000002 */

/* #define _PMMODE_WAITM_POSITION                   0x00000002 */
/* #define _PMMODE_WAITM_MASK                       0x0000003C */
/* #define _PMMODE_WAITM_LENGTH                     0x00000004 */

/* #define _PMMODE_WAITB_POSITION                   0x00000006 */
/* #define _PMMODE_WAITB_MASK                       0x000000C0 */
/* #define _PMMODE_WAITB_LENGTH                     0x00000002 */

/* #define _PMMODE_MODE_POSITION                    0x00000008 */
/* #define _PMMODE_MODE_MASK                        0x00000300 */
/* #define _PMMODE_MODE_LENGTH                      0x00000002 */

/* #define _PMMODE_MODE16_POSITION                  0x0000000A */
/* #define _PMMODE_MODE16_MASK                      0x00000400 */
/* #define _PMMODE_MODE16_LENGTH                    0x00000001 */

/* #define _PMMODE_INCM_POSITION                    0x0000000B */
/* #define _PMMODE_INCM_MASK                        0x00001800 */
/* #define _PMMODE_INCM_LENGTH                      0x00000002 */

/* #define _PMMODE_IRQM_POSITION                    0x0000000D */
/* #define _PMMODE_IRQM_MASK                        0x00006000 */
/* #define _PMMODE_IRQM_LENGTH                      0x00000002 */

/* #define _PMMODE_BUSY_POSITION                    0x0000000F */
/* #define _PMMODE_BUSY_MASK                        0x00008000 */
/* #define _PMMODE_BUSY_LENGTH                      0x00000001 */

/* #define _PMMODE_WAITE0_POSITION                  0x00000000 */
/* #define _PMMODE_WAITE0_MASK                      0x00000001 */
/* #define _PMMODE_WAITE0_LENGTH                    0x00000001 */

/* #define _PMMODE_WAITE1_POSITION                  0x00000001 */
/* #define _PMMODE_WAITE1_MASK                      0x00000002 */
/* #define _PMMODE_WAITE1_LENGTH                    0x00000001 */

/* #define _PMMODE_WAITM0_POSITION                  0x00000002 */
/* #define _PMMODE_WAITM0_MASK                      0x00000004 */
/* #define _PMMODE_WAITM0_LENGTH                    0x00000001 */

/* #define _PMMODE_WAITM1_POSITION                  0x00000003 */
/* #define _PMMODE_WAITM1_MASK                      0x00000008 */
/* #define _PMMODE_WAITM1_LENGTH                    0x00000001 */

/* #define _PMMODE_WAITM2_POSITION                  0x00000004 */
/* #define _PMMODE_WAITM2_MASK                      0x00000010 */
/* #define _PMMODE_WAITM2_LENGTH                    0x00000001 */

/* #define _PMMODE_WAITM3_POSITION                  0x00000005 */
/* #define _PMMODE_WAITM3_MASK                      0x00000020 */
/* #define _PMMODE_WAITM3_LENGTH                    0x00000001 */

/* #define _PMMODE_WAITB0_POSITION                  0x00000006 */
/* #define _PMMODE_WAITB0_MASK                      0x00000040 */
/* #define _PMMODE_WAITB0_LENGTH                    0x00000001 */

/* #define _PMMODE_WAITB1_POSITION                  0x00000007 */
/* #define _PMMODE_WAITB1_MASK                      0x00000080 */
/* #define _PMMODE_WAITB1_LENGTH                    0x00000001 */

