rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _PMMODE_MODE0_POSITION                   0x00000008 */
/* #define _PMMODE_MODE0_MASK                       0x00000100 */
/* #define _PMMODE_MODE0_LENGTH                     0x00000001 */

/* #define _PMMODE_MODE1_POSITION                   0x00000009 */
/* #define _PMMODE_MODE1_MASK                       0x00000200 */
/* #define _PMMODE_MODE1_LENGTH                     0x00000001 */

/* #define _PMMODE_INCM0_POSITION                   0x0000000B */
/* #define _PMMODE_INCM0_MASK                       0x00000800 */
/* #define _PMMODE_INCM0_LENGTH                     0x00000001 */

/* #define _PMMODE_INCM1_POSITION                   0x0000000C */
/* #define _PMMODE_INCM1_MASK                       0x00001000 */
/* #define _PMMODE_INCM1_LENGTH                     0x00000001 */

/* #define _PMMODE_IRQM0_POSITION                   0x0000000D */
/* #define _PMMODE_IRQM0_MASK                       0x00002000 */
/* #define _PMMODE_IRQM0_LENGTH                     0x00000001 */

/* #define _PMMODE_IRQM1_POSITION                   0x0000000E */
/* #define _PMMODE_IRQM1_MASK                       0x00004000 */
/* #define _PMMODE_IRQM1_LENGTH                     0x00000001 */

/* #define _PMMODE_w_POSITION                       0x00000000 */
/* #define _PMMODE_w_MASK                           0xFFFFFFFF */
/* #define _PMMODE_w_LENGTH                         0x00000020 */

/* #define _PMADDR_ADDR_POSITION                    0x00000000 */
/* #define _PMADDR_ADDR_MASK                        0x00003FFF */
/* #define _PMADDR_ADDR_LENGTH                      0x0000000E */

/* #define _PMADDR_CS_POSITION                      0x0000000E */
/* #define _PMADDR_CS_MASK                          0x0000C000 */
/* #define _PMADDR_CS_LENGTH                        0x00000002 */

/* #define _PMADDR_PADDR_POSITION                   0x00000000 */
/* #define _PMADDR_PADDR_MASK                       0x00003FFF */
/* #define _PMADDR_PADDR_LENGTH                     0x0000000E */

/* #define _PMADDR_CS1_POSITION                     0x0000000E */
/* #define _PMADDR_CS1_MASK                         0x00004000 */
/* #define _PMADDR_CS1_LENGTH                       0x00000001 */

/* #define _PMADDR_CS2_POSITION                     0x0000000F */
/* #define _PMADDR_CS2_MASK                         0x00008000 */
/* #define _PMADDR_CS2_LENGTH                       0x00000001 */

/* #define _PMADDR_w_POSITION                       0x00000000 */
/* #define _PMADDR_w_MASK                           0xFFFFFFFF */
/* #define _PMADDR_w_LENGTH                         0x00000020 */

/* #define _PMDOUT_DATAOUT_POSITION                 0x00000000 */
/* #define _PMDOUT_DATAOUT_MASK                     0xFFFFFFFF */
/* #define _PMDOUT_DATAOUT_LENGTH                   0x00000020 */

/* #define _PMDOUT_w_POSITION                       0x00000000 */
/* #define _PMDOUT_w_MASK                           0xFFFFFFFF */
/* #define _PMDOUT_w_LENGTH                         0x00000020 */

/* #define _PMDIN_DATAIN_POSITION                   0x00000000 */
/* #define _PMDIN_DATAIN_MASK                       0xFFFFFFFF */
/* #define _PMDIN_DATAIN_LENGTH                     0x00000020 */

/* #define _PMDIN_w_POSITION                        0x00000000 */
/* #define _PMDIN_w_MASK                            0xFFFFFFFF */
/* #define _PMDIN_w_LENGTH                          0x00000020 */

/* #define _PMAEN_PTEN_POSITION                     0x00000000 */
/* #define _PMAEN_PTEN_MASK                         0x0000FFFF */
/* #define _PMAEN_PTEN_LENGTH                       0x00000010 */

/* #define _PMAEN_PTEN0_POSITION                    0x00000000 */
/* #define _PMAEN_PTEN0_MASK                        0x00000001 */
/* #define _PMAEN_PTEN0_LENGTH                      0x00000001 */

/* #define _PMAEN_PTEN1_POSITION                    0x00000001 */
/* #define _PMAEN_PTEN1_MASK                        0x00000002 */
/* #define _PMAEN_PTEN1_LENGTH                      0x00000001 */

/* #define _PMAEN_PTEN2_POSITION                    0x00000002 */
/* #define _PMAEN_PTEN2_MASK                        0x00000004 */
/* #define _PMAEN_PTEN2_LENGTH                      0x00000001 */

/* #define _PMAEN_PTEN3_POSITION                    0x00000003 */
/* #define _PMAEN_PTEN3_MASK                        0x00000008 */
/* #define _PMAEN_PTEN3_LENGTH                      0x00000001 */

/* #define _PMAEN_PTEN4_POSITION                    0x00000004 */
/* #define _PMAEN_PTEN4_MASK                        0x00000010 */
/* #define _PMAEN_PTEN4_LENGTH                      0x00000001 */

/* #define _PMAEN_PTEN5_POSITION                    0x00000005 */
/* #define _PMAEN_PTEN5_MASK                        0x00000020 */
/* #define _PMAEN_PTEN5_LENGTH                      0x00000001 */

/* #define _PMAEN_PTEN6_POSITION                    0x00000006 */
/* #define _PMAEN_PTEN6_MASK                        0x00000040 */
/* #define _PMAEN_PTEN6_LENGTH                      0x00000001 */

/* #define _PMAEN_PTEN7_POSITION                    0x00000007 */
/* #define _PMAEN_PTEN7_MASK                        0x00000080 */
/* #define _PMAEN_PTEN7_LENGTH                      0x00000001 */

/* #define _PMAEN_PTEN8_POSITION                    0x00000008 */
/* #define _PMAEN_PTEN8_MASK                        0x00000100 */
/* #define _PMAEN_PTEN8_LENGTH                      0x00000001 */

/* #define _PMAEN_PTEN9_POSITION                    0x00000009 */
/* #define _PMAEN_PTEN9_MASK                        0x00000200 */
/* #define _PMAEN_PTEN9_LENGTH                      0x00000001 */

/* #define _PMAEN_PTEN10_POSITION                   0x0000000A */
/* #define _PMAEN_PTEN10_MASK                       0x00000400 */
/* #define _PMAEN_PTEN10_LENGTH                     0x00000001 */

/* #define _PMAEN_PTEN11_POSITION                   0x0000000B */
/* #define _PMAEN_PTEN11_MASK                       0x00000800 */
/* #define _PMAEN_PTEN11_LENGTH                     0x00000001 */

/* #define _PMAEN_PTEN12_POSITION                   0x0000000C */
/* #define _PMAEN_PTEN12_MASK                       0x00001000 */
/* #define _PMAEN_PTEN12_LENGTH                     0x00000001 */

