rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _PMAEN_PTEN13_POSITION                   0x0000000D */
/* #define _PMAEN_PTEN13_MASK                       0x00002000 */
/* #define _PMAEN_PTEN13_LENGTH                     0x00000001 */

/* #define _PMAEN_PTEN14_POSITION                   0x0000000E */
/* #define _PMAEN_PTEN14_MASK                       0x00004000 */
/* #define _PMAEN_PTEN14_LENGTH                     0x00000001 */

/* #define _PMAEN_PTEN15_POSITION                   0x0000000F */
/* #define _PMAEN_PTEN15_MASK                       0x00008000 */
/* #define _PMAEN_PTEN15_LENGTH                     0x00000001 */

/* #define _PMAEN_w_POSITION                        0x00000000 */
/* #define _PMAEN_w_MASK                            0xFFFFFFFF */
/* #define _PMAEN_w_LENGTH                          0x00000020 */

/* #define _PMSTAT_OB0E_POSITION                    0x00000000 */
/* #define _PMSTAT_OB0E_MASK                        0x00000001 */
/* #define _PMSTAT_OB0E_LENGTH                      0x00000001 */

/* #define _PMSTAT_OB1E_POSITION                    0x00000001 */
/* #define _PMSTAT_OB1E_MASK                        0x00000002 */
/* #define _PMSTAT_OB1E_LENGTH                      0x00000001 */

/* #define _PMSTAT_OB2E_POSITION                    0x00000002 */
/* #define _PMSTAT_OB2E_MASK                        0x00000004 */
/* #define _PMSTAT_OB2E_LENGTH                      0x00000001 */

/* #define _PMSTAT_OB3E_POSITION                    0x00000003 */
/* #define _PMSTAT_OB3E_MASK                        0x00000008 */
/* #define _PMSTAT_OB3E_LENGTH                      0x00000001 */

/* #define _PMSTAT_OBUF_POSITION                    0x00000006 */
/* #define _PMSTAT_OBUF_MASK                        0x00000040 */
/* #define _PMSTAT_OBUF_LENGTH                      0x00000001 */

/* #define _PMSTAT_OBE_POSITION                     0x00000007 */
/* #define _PMSTAT_OBE_MASK                         0x00000080 */
/* #define _PMSTAT_OBE_LENGTH                       0x00000001 */

/* #define _PMSTAT_IB0F_POSITION                    0x00000008 */
/* #define _PMSTAT_IB0F_MASK                        0x00000100 */
/* #define _PMSTAT_IB0F_LENGTH                      0x00000001 */

/* #define _PMSTAT_IB1F_POSITION                    0x00000009 */
/* #define _PMSTAT_IB1F_MASK                        0x00000200 */
/* #define _PMSTAT_IB1F_LENGTH                      0x00000001 */

/* #define _PMSTAT_IB2F_POSITION                    0x0000000A */
/* #define _PMSTAT_IB2F_MASK                        0x00000400 */
/* #define _PMSTAT_IB2F_LENGTH                      0x00000001 */

/* #define _PMSTAT_IB3F_POSITION                    0x0000000B */
/* #define _PMSTAT_IB3F_MASK                        0x00000800 */
/* #define _PMSTAT_IB3F_LENGTH                      0x00000001 */

/* #define _PMSTAT_IBOV_POSITION                    0x0000000E */
/* #define _PMSTAT_IBOV_MASK                        0x00004000 */
/* #define _PMSTAT_IBOV_LENGTH                      0x00000001 */

/* #define _PMSTAT_IBF_POSITION                     0x0000000F */
/* #define _PMSTAT_IBF_MASK                         0x00008000 */
/* #define _PMSTAT_IBF_LENGTH                       0x00000001 */

/* #define _PMSTAT_w_POSITION                       0x00000000 */
/* #define _PMSTAT_w_MASK                           0xFFFFFFFF */
/* #define _PMSTAT_w_LENGTH                         0x00000020 */

/* #define _AD1CON1_DONE_POSITION                   0x00000000 */
/* #define _AD1CON1_DONE_MASK                       0x00000001 */
/* #define _AD1CON1_DONE_LENGTH                     0x00000001 */

/* #define _AD1CON1_SAMP_POSITION                   0x00000001 */
/* #define _AD1CON1_SAMP_MASK                       0x00000002 */
/* #define _AD1CON1_SAMP_LENGTH                     0x00000001 */

/* #define _AD1CON1_ASAM_POSITION                   0x00000002 */
/* #define _AD1CON1_ASAM_MASK                       0x00000004 */
/* #define _AD1CON1_ASAM_LENGTH                     0x00000001 */

/* #define _AD1CON1_CLRASAM_POSITION                0x00000004 */
/* #define _AD1CON1_CLRASAM_MASK                    0x00000010 */
/* #define _AD1CON1_CLRASAM_LENGTH                  0x00000001 */

/* #define _AD1CON1_SSRC_POSITION                   0x00000005 */
/* #define _AD1CON1_SSRC_MASK                       0x000000E0 */
/* #define _AD1CON1_SSRC_LENGTH                     0x00000003 */

/* #define _AD1CON1_FORM_POSITION                   0x00000008 */
/* #define _AD1CON1_FORM_MASK                       0x00000700 */
/* #define _AD1CON1_FORM_LENGTH                     0x00000003 */

/* #define _AD1CON1_SIDL_POSITION                   0x0000000D */
/* #define _AD1CON1_SIDL_MASK                       0x00002000 */
/* #define _AD1CON1_SIDL_LENGTH                     0x00000001 */

/* #define _AD1CON1_ON_POSITION                     0x0000000F */
/* #define _AD1CON1_ON_MASK                         0x00008000 */
/* #define _AD1CON1_ON_LENGTH                       0x00000001 */

/* #define _AD1CON1_SSRC0_POSITION                  0x00000005 */
/* #define _AD1CON1_SSRC0_MASK                      0x00000020 */
/* #define _AD1CON1_SSRC0_LENGTH                    0x00000001 */

/* #define _AD1CON1_SSRC1_POSITION                  0x00000006 */
/* #define _AD1CON1_SSRC1_MASK                      0x00000040 */
/* #define _AD1CON1_SSRC1_LENGTH                    0x00000001 */

/* #define _AD1CON1_SSRC2_POSITION                  0x00000007 */
/* #define _AD1CON1_SSRC2_MASK                      0x00000080 */
/* #define _AD1CON1_SSRC2_LENGTH                    0x00000001 */

/* #define _AD1CON1_FORM0_POSITION                  0x00000008 */
/* #define _AD1CON1_FORM0_MASK                      0x00000100 */
/* #define _AD1CON1_FORM0_LENGTH                    0x00000001 */

/* #define _AD1CON1_FORM1_POSITION                  0x00000009 */
/* #define _AD1CON1_FORM1_MASK                      0x00000200 */
/* #define _AD1CON1_FORM1_LENGTH                    0x00000001 */

/* #define _AD1CON1_FORM2_POSITION                  0x0000000A */
/* #define _AD1CON1_FORM2_MASK                      0x00000400 */
/* #define _AD1CON1_FORM2_LENGTH                    0x00000001 */

/* #define _AD1CON1_ADSIDL_POSITION                 0x0000000D */
/* #define _AD1CON1_ADSIDL_MASK                     0x00002000 */
/* #define _AD1CON1_ADSIDL_LENGTH                   0x00000001 */

/* #define _AD1CON1_ADON_POSITION                   0x0000000F */
/* #define _AD1CON1_ADON_MASK                       0x00008000 */
/* #define _AD1CON1_ADON_LENGTH                     0x00000001 */

/* #define _AD1CON1_w_POSITION                      0x00000000 */
/* #define _AD1CON1_w_MASK                          0xFFFFFFFF */
/* #define _AD1CON1_w_LENGTH                        0x00000020 */

/* #define _AD1CON2_ALTS_POSITION                   0x00000000 */
/* #define _AD1CON2_ALTS_MASK                       0x00000001 */
/* #define _AD1CON2_ALTS_LENGTH                     0x00000001 */

/* #define _AD1CON2_BUFM_POSITION                   0x00000001 */
/* #define _AD1CON2_BUFM_MASK                       0x00000002 */
/* #define _AD1CON2_BUFM_LENGTH                     0x00000001 */

/* #define _AD1CON2_SMPI_POSITION                   0x00000002 */
/* #define _AD1CON2_SMPI_MASK                       0x0000003C */
/* #define _AD1CON2_SMPI_LENGTH                     0x00000004 */

/* #define _AD1CON2_BUFS_POSITION                   0x00000007 */
/* #define _AD1CON2_BUFS_MASK                       0x00000080 */
/* #define _AD1CON2_BUFS_LENGTH                     0x00000001 */

/* #define _AD1CON2_CSCNA_POSITION                  0x0000000A */
/* #define _AD1CON2_CSCNA_MASK                      0x00000400 */
/* #define _AD1CON2_CSCNA_LENGTH                    0x00000001 */

/* #define _AD1CON2_OFFCAL_POSITION                 0x0000000C */
/* #define _AD1CON2_OFFCAL_MASK                     0x00001000 */
/* #define _AD1CON2_OFFCAL_LENGTH                   0x00000001 */

