rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _AD1CON2_VCFG_POSITION                   0x0000000D */
/* #define _AD1CON2_VCFG_MASK                       0x0000E000 */
/* #define _AD1CON2_VCFG_LENGTH                     0x00000003 */

/* #define _AD1CON2_SMPI0_POSITION                  0x00000002 */
/* #define _AD1CON2_SMPI0_MASK                      0x00000004 */
/* #define _AD1CON2_SMPI0_LENGTH                    0x00000001 */

/* #define _AD1CON2_SMPI1_POSITION                  0x00000003 */
/* #define _AD1CON2_SMPI1_MASK                      0x00000008 */
/* #define _AD1CON2_SMPI1_LENGTH                    0x00000001 */

/* #define _AD1CON2_SMPI2_POSITION                  0x00000004 */
/* #define _AD1CON2_SMPI2_MASK                      0x00000010 */
/* #define _AD1CON2_SMPI2_LENGTH                    0x00000001 */

/* #define _AD1CON2_SMPI3_POSITION                  0x00000005 */
/* #define _AD1CON2_SMPI3_MASK                      0x00000020 */
/* #define _AD1CON2_SMPI3_LENGTH                    0x00000001 */

/* #define _AD1CON2_VCFG0_POSITION                  0x0000000D */
/* #define _AD1CON2_VCFG0_MASK                      0x00002000 */
/* #define _AD1CON2_VCFG0_LENGTH                    0x00000001 */

/* #define _AD1CON2_VCFG1_POSITION                  0x0000000E */
/* #define _AD1CON2_VCFG1_MASK                      0x00004000 */
/* #define _AD1CON2_VCFG1_LENGTH                    0x00000001 */

/* #define _AD1CON2_VCFG2_POSITION                  0x0000000F */
/* #define _AD1CON2_VCFG2_MASK                      0x00008000 */
/* #define _AD1CON2_VCFG2_LENGTH                    0x00000001 */

/* #define _AD1CON2_w_POSITION                      0x00000000 */
/* #define _AD1CON2_w_MASK                          0xFFFFFFFF */
/* #define _AD1CON2_w_LENGTH                        0x00000020 */

/* #define _AD1CON3_ADCS_POSITION                   0x00000000 */
/* #define _AD1CON3_ADCS_MASK                       0x000000FF */
/* #define _AD1CON3_ADCS_LENGTH                     0x00000008 */

/* #define _AD1CON3_SAMC_POSITION                   0x00000008 */
/* #define _AD1CON3_SAMC_MASK                       0x00001F00 */
/* #define _AD1CON3_SAMC_LENGTH                     0x00000005 */

/* #define _AD1CON3_ADRC_POSITION                   0x0000000F */
/* #define _AD1CON3_ADRC_MASK                       0x00008000 */
/* #define _AD1CON3_ADRC_LENGTH                     0x00000001 */

/* #define _AD1CON3_ADCS0_POSITION                  0x00000000 */
/* #define _AD1CON3_ADCS0_MASK                      0x00000001 */
/* #define _AD1CON3_ADCS0_LENGTH                    0x00000001 */

/* #define _AD1CON3_ADCS1_POSITION                  0x00000001 */
/* #define _AD1CON3_ADCS1_MASK                      0x00000002 */
/* #define _AD1CON3_ADCS1_LENGTH                    0x00000001 */

/* #define _AD1CON3_ADCS2_POSITION                  0x00000002 */
/* #define _AD1CON3_ADCS2_MASK                      0x00000004 */
/* #define _AD1CON3_ADCS2_LENGTH                    0x00000001 */

/* #define _AD1CON3_ADCS3_POSITION                  0x00000003 */
/* #define _AD1CON3_ADCS3_MASK                      0x00000008 */
/* #define _AD1CON3_ADCS3_LENGTH                    0x00000001 */

/* #define _AD1CON3_ADCS4_POSITION                  0x00000004 */
/* #define _AD1CON3_ADCS4_MASK                      0x00000010 */
/* #define _AD1CON3_ADCS4_LENGTH                    0x00000001 */

/* #define _AD1CON3_ADCS5_POSITION                  0x00000005 */
/* #define _AD1CON3_ADCS5_MASK                      0x00000020 */
/* #define _AD1CON3_ADCS5_LENGTH                    0x00000001 */

/* #define _AD1CON3_ADCS6_POSITION                  0x00000006 */
/* #define _AD1CON3_ADCS6_MASK                      0x00000040 */
/* #define _AD1CON3_ADCS6_LENGTH                    0x00000001 */

/* #define _AD1CON3_ADCS7_POSITION                  0x00000007 */
/* #define _AD1CON3_ADCS7_MASK                      0x00000080 */
/* #define _AD1CON3_ADCS7_LENGTH                    0x00000001 */

/* #define _AD1CON3_SAMC0_POSITION                  0x00000008 */
/* #define _AD1CON3_SAMC0_MASK                      0x00000100 */
/* #define _AD1CON3_SAMC0_LENGTH                    0x00000001 */

/* #define _AD1CON3_SAMC1_POSITION                  0x00000009 */
/* #define _AD1CON3_SAMC1_MASK                      0x00000200 */
/* #define _AD1CON3_SAMC1_LENGTH                    0x00000001 */

/* #define _AD1CON3_SAMC2_POSITION                  0x0000000A */
/* #define _AD1CON3_SAMC2_MASK                      0x00000400 */
/* #define _AD1CON3_SAMC2_LENGTH                    0x00000001 */

/* #define _AD1CON3_SAMC3_POSITION                  0x0000000B */
/* #define _AD1CON3_SAMC3_MASK                      0x00000800 */
/* #define _AD1CON3_SAMC3_LENGTH                    0x00000001 */

/* #define _AD1CON3_SAMC4_POSITION                  0x0000000C */
/* #define _AD1CON3_SAMC4_MASK                      0x00001000 */
/* #define _AD1CON3_SAMC4_LENGTH                    0x00000001 */

/* #define _AD1CON3_w_POSITION                      0x00000000 */
/* #define _AD1CON3_w_MASK                          0xFFFFFFFF */
/* #define _AD1CON3_w_LENGTH                        0x00000020 */

/* #define _AD1CHS_CH0SA_POSITION                   0x00000010 */
/* #define _AD1CHS_CH0SA_MASK                       0x000F0000 */
/* #define _AD1CHS_CH0SA_LENGTH                     0x00000004 */

/* #define _AD1CHS_CH0NA_POSITION                   0x00000017 */
/* #define _AD1CHS_CH0NA_MASK                       0x00800000 */
/* #define _AD1CHS_CH0NA_LENGTH                     0x00000001 */

/* #define _AD1CHS_CH0SB_POSITION                   0x00000018 */
/* #define _AD1CHS_CH0SB_MASK                       0x0F000000 */
/* #define _AD1CHS_CH0SB_LENGTH                     0x00000004 */

/* #define _AD1CHS_CH0NB_POSITION                   0x0000001F */
/* #define _AD1CHS_CH0NB_MASK                       0x80000000 */
/* #define _AD1CHS_CH0NB_LENGTH                     0x00000001 */

/* #define _AD1CHS_CH0SA0_POSITION                  0x00000010 */
/* #define _AD1CHS_CH0SA0_MASK                      0x00010000 */
/* #define _AD1CHS_CH0SA0_LENGTH                    0x00000001 */

/* #define _AD1CHS_CH0SA1_POSITION                  0x00000011 */
/* #define _AD1CHS_CH0SA1_MASK                      0x00020000 */
/* #define _AD1CHS_CH0SA1_LENGTH                    0x00000001 */

/* #define _AD1CHS_CH0SA2_POSITION                  0x00000012 */
/* #define _AD1CHS_CH0SA2_MASK                      0x00040000 */
/* #define _AD1CHS_CH0SA2_LENGTH                    0x00000001 */

/* #define _AD1CHS_CH0SA3_POSITION                  0x00000013 */
/* #define _AD1CHS_CH0SA3_MASK                      0x00080000 */
/* #define _AD1CHS_CH0SA3_LENGTH                    0x00000001 */

/* #define _AD1CHS_CH0SB0_POSITION                  0x00000018 */
/* #define _AD1CHS_CH0SB0_MASK                      0x01000000 */
/* #define _AD1CHS_CH0SB0_LENGTH                    0x00000001 */

/* #define _AD1CHS_CH0SB1_POSITION                  0x00000019 */
/* #define _AD1CHS_CH0SB1_MASK                      0x02000000 */
/* #define _AD1CHS_CH0SB1_LENGTH                    0x00000001 */

