rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _AD1CHS_CH0SB2_POSITION                  0x0000001A */
/* #define _AD1CHS_CH0SB2_MASK                      0x04000000 */
/* #define _AD1CHS_CH0SB2_LENGTH                    0x00000001 */

/* #define _AD1CHS_CH0SB3_POSITION                  0x0000001B */
/* #define _AD1CHS_CH0SB3_MASK                      0x08000000 */
/* #define _AD1CHS_CH0SB3_LENGTH                    0x00000001 */

/* #define _AD1CHS_w_POSITION                       0x00000000 */
/* #define _AD1CHS_w_MASK                           0xFFFFFFFF */
/* #define _AD1CHS_w_LENGTH                         0x00000020 */

/* #define _AD1CSSL_CSSL_POSITION                   0x00000000 */
/* #define _AD1CSSL_CSSL_MASK                       0x7FFFFFFF */
/* #define _AD1CSSL_CSSL_LENGTH                     0x0000001F */

/* #define _AD1CSSL_CSSL0_POSITION                  0x00000000 */
/* #define _AD1CSSL_CSSL0_MASK                      0x00000001 */
/* #define _AD1CSSL_CSSL0_LENGTH                    0x00000001 */

/* #define _AD1CSSL_CSSL1_POSITION                  0x00000001 */
/* #define _AD1CSSL_CSSL1_MASK                      0x00000002 */
/* #define _AD1CSSL_CSSL1_LENGTH                    0x00000001 */

/* #define _AD1CSSL_CSSL2_POSITION                  0x00000002 */
/* #define _AD1CSSL_CSSL2_MASK                      0x00000004 */
/* #define _AD1CSSL_CSSL2_LENGTH                    0x00000001 */

/* #define _AD1CSSL_CSSL3_POSITION                  0x00000003 */
/* #define _AD1CSSL_CSSL3_MASK                      0x00000008 */
/* #define _AD1CSSL_CSSL3_LENGTH                    0x00000001 */

/* #define _AD1CSSL_CSSL4_POSITION                  0x00000004 */
/* #define _AD1CSSL_CSSL4_MASK                      0x00000010 */
/* #define _AD1CSSL_CSSL4_LENGTH                    0x00000001 */

/* #define _AD1CSSL_CSSL5_POSITION                  0x00000005 */
/* #define _AD1CSSL_CSSL5_MASK                      0x00000020 */
/* #define _AD1CSSL_CSSL5_LENGTH                    0x00000001 */

/* #define _AD1CSSL_CSSL6_POSITION                  0x00000006 */
/* #define _AD1CSSL_CSSL6_MASK                      0x00000040 */
/* #define _AD1CSSL_CSSL6_LENGTH                    0x00000001 */

/* #define _AD1CSSL_CSSL7_POSITION                  0x00000007 */
/* #define _AD1CSSL_CSSL7_MASK                      0x00000080 */
/* #define _AD1CSSL_CSSL7_LENGTH                    0x00000001 */

/* #define _AD1CSSL_CSSL8_POSITION                  0x00000008 */
/* #define _AD1CSSL_CSSL8_MASK                      0x00000100 */
/* #define _AD1CSSL_CSSL8_LENGTH                    0x00000001 */

/* #define _AD1CSSL_CSSL9_POSITION                  0x00000009 */
/* #define _AD1CSSL_CSSL9_MASK                      0x00000200 */
/* #define _AD1CSSL_CSSL9_LENGTH                    0x00000001 */

/* #define _AD1CSSL_CSSL10_POSITION                 0x0000000A */
/* #define _AD1CSSL_CSSL10_MASK                     0x00000400 */
/* #define _AD1CSSL_CSSL10_LENGTH                   0x00000001 */

/* #define _AD1CSSL_CSSL11_POSITION                 0x0000000B */
/* #define _AD1CSSL_CSSL11_MASK                     0x00000800 */
/* #define _AD1CSSL_CSSL11_LENGTH                   0x00000001 */

/* #define _AD1CSSL_CSSL12_POSITION                 0x0000000C */
/* #define _AD1CSSL_CSSL12_MASK                     0x00001000 */
/* #define _AD1CSSL_CSSL12_LENGTH                   0x00000001 */

/* #define _AD1CSSL_CSSL13_POSITION                 0x0000000D */
/* #define _AD1CSSL_CSSL13_MASK                     0x00002000 */
/* #define _AD1CSSL_CSSL13_LENGTH                   0x00000001 */

/* #define _AD1CSSL_CSSL14_POSITION                 0x0000000E */
/* #define _AD1CSSL_CSSL14_MASK                     0x00004000 */
/* #define _AD1CSSL_CSSL14_LENGTH                   0x00000001 */

/* #define _AD1CSSL_CSSL15_POSITION                 0x0000000F */
/* #define _AD1CSSL_CSSL15_MASK                     0x00008000 */
/* #define _AD1CSSL_CSSL15_LENGTH                   0x00000001 */

/* #define _AD1CSSL_CSSL16_POSITION                 0x00000010 */
/* #define _AD1CSSL_CSSL16_MASK                     0x00010000 */
/* #define _AD1CSSL_CSSL16_LENGTH                   0x00000001 */

/* #define _AD1CSSL_CSSL17_POSITION                 0x00000011 */
/* #define _AD1CSSL_CSSL17_MASK                     0x00020000 */
/* #define _AD1CSSL_CSSL17_LENGTH                   0x00000001 */

/* #define _AD1CSSL_CSSL18_POSITION                 0x00000012 */
/* #define _AD1CSSL_CSSL18_MASK                     0x00040000 */
/* #define _AD1CSSL_CSSL18_LENGTH                   0x00000001 */

/* #define _AD1CSSL_CSSL19_POSITION                 0x00000013 */
/* #define _AD1CSSL_CSSL19_MASK                     0x00080000 */
/* #define _AD1CSSL_CSSL19_LENGTH                   0x00000001 */

/* #define _AD1CSSL_CSSL20_POSITION                 0x00000014 */
/* #define _AD1CSSL_CSSL20_MASK                     0x00100000 */
/* #define _AD1CSSL_CSSL20_LENGTH                   0x00000001 */

/* #define _AD1CSSL_CSSL21_POSITION                 0x00000015 */
/* #define _AD1CSSL_CSSL21_MASK                     0x00200000 */
/* #define _AD1CSSL_CSSL21_LENGTH                   0x00000001 */

/* #define _AD1CSSL_CSSL22_POSITION                 0x00000016 */
/* #define _AD1CSSL_CSSL22_MASK                     0x00400000 */
/* #define _AD1CSSL_CSSL22_LENGTH                   0x00000001 */

/* #define _AD1CSSL_CSSL23_POSITION                 0x00000017 */
/* #define _AD1CSSL_CSSL23_MASK                     0x00800000 */
/* #define _AD1CSSL_CSSL23_LENGTH                   0x00000001 */

/* #define _AD1CSSL_CSSL24_POSITION                 0x00000018 */
/* #define _AD1CSSL_CSSL24_MASK                     0x01000000 */
/* #define _AD1CSSL_CSSL24_LENGTH                   0x00000001 */

/* #define _AD1CSSL_CSSL25_POSITION                 0x00000019 */
/* #define _AD1CSSL_CSSL25_MASK                     0x02000000 */
/* #define _AD1CSSL_CSSL25_LENGTH                   0x00000001 */

/* #define _AD1CSSL_CSSL26_POSITION                 0x0000001A */
/* #define _AD1CSSL_CSSL26_MASK                     0x04000000 */
/* #define _AD1CSSL_CSSL26_LENGTH                   0x00000001 */

/* #define _AD1CSSL_CSSL27_POSITION                 0x0000001B */
/* #define _AD1CSSL_CSSL27_MASK                     0x08000000 */
/* #define _AD1CSSL_CSSL27_LENGTH                   0x00000001 */

/* #define _AD1CSSL_CSSL28_POSITION                 0x0000001C */
/* #define _AD1CSSL_CSSL28_MASK                     0x10000000 */
/* #define _AD1CSSL_CSSL28_LENGTH                   0x00000001 */

/* #define _AD1CSSL_CSSL29_POSITION                 0x0000001D */
/* #define _AD1CSSL_CSSL29_MASK                     0x20000000 */
/* #define _AD1CSSL_CSSL29_LENGTH                   0x00000001 */

/* #define _AD1CSSL_CSSL30_POSITION                 0x0000001E */
/* #define _AD1CSSL_CSSL30_MASK                     0x40000000 */
/* #define _AD1CSSL_CSSL30_LENGTH                   0x00000001 */

