rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _AD1CSSL_w_POSITION                      0x00000000 */
/* #define _AD1CSSL_w_MASK                          0xFFFFFFFF */
/* #define _AD1CSSL_w_LENGTH                        0x00000020 */

/* #define _CVRCON_CVR_POSITION                     0x00000000 */
/* #define _CVRCON_CVR_MASK                         0x0000000F */
/* #define _CVRCON_CVR_LENGTH                       0x00000004 */

/* #define _CVRCON_CVRSS_POSITION                   0x00000004 */
/* #define _CVRCON_CVRSS_MASK                       0x00000010 */
/* #define _CVRCON_CVRSS_LENGTH                     0x00000001 */

/* #define _CVRCON_CVRR_POSITION                    0x00000005 */
/* #define _CVRCON_CVRR_MASK                        0x00000020 */
/* #define _CVRCON_CVRR_LENGTH                      0x00000001 */

/* #define _CVRCON_CVROE_POSITION                   0x00000006 */
/* #define _CVRCON_CVROE_MASK                       0x00000040 */
/* #define _CVRCON_CVROE_LENGTH                     0x00000001 */

/* #define _CVRCON_BGSEL_POSITION                   0x00000008 */
/* #define _CVRCON_BGSEL_MASK                       0x00000300 */
/* #define _CVRCON_BGSEL_LENGTH                     0x00000002 */

/* #define _CVRCON_VREFSEL_POSITION                 0x0000000A */
/* #define _CVRCON_VREFSEL_MASK                     0x00000400 */
/* #define _CVRCON_VREFSEL_LENGTH                   0x00000001 */

/* #define _CVRCON_ON_POSITION                      0x0000000F */
/* #define _CVRCON_ON_MASK                          0x00008000 */
/* #define _CVRCON_ON_LENGTH                        0x00000001 */

/* #define _CVRCON_CVR0_POSITION                    0x00000000 */
/* #define _CVRCON_CVR0_MASK                        0x00000001 */
/* #define _CVRCON_CVR0_LENGTH                      0x00000001 */

/* #define _CVRCON_CVR1_POSITION                    0x00000001 */
/* #define _CVRCON_CVR1_MASK                        0x00000002 */
/* #define _CVRCON_CVR1_LENGTH                      0x00000001 */

/* #define _CVRCON_CVR2_POSITION                    0x00000002 */
/* #define _CVRCON_CVR2_MASK                        0x00000004 */
/* #define _CVRCON_CVR2_LENGTH                      0x00000001 */

/* #define _CVRCON_CVR3_POSITION                    0x00000003 */
/* #define _CVRCON_CVR3_MASK                        0x00000008 */
/* #define _CVRCON_CVR3_LENGTH                      0x00000001 */

/* #define _CVRCON_BGSEL0_POSITION                  0x00000008 */
/* #define _CVRCON_BGSEL0_MASK                      0x00000100 */
/* #define _CVRCON_BGSEL0_LENGTH                    0x00000001 */

/* #define _CVRCON_BGSEL1_POSITION                  0x00000009 */
/* #define _CVRCON_BGSEL1_MASK                      0x00000200 */
/* #define _CVRCON_BGSEL1_LENGTH                    0x00000001 */

/* #define _CVRCON_w_POSITION                       0x00000000 */
/* #define _CVRCON_w_MASK                           0xFFFFFFFF */
/* #define _CVRCON_w_LENGTH                         0x00000020 */

/* #define _CM1CON_CCH_POSITION                     0x00000000 */
/* #define _CM1CON_CCH_MASK                         0x00000003 */
/* #define _CM1CON_CCH_LENGTH                       0x00000002 */

/* #define _CM1CON_CREF_POSITION                    0x00000004 */
/* #define _CM1CON_CREF_MASK                        0x00000010 */
/* #define _CM1CON_CREF_LENGTH                      0x00000001 */

/* #define _CM1CON_EVPOL_POSITION                   0x00000006 */
/* #define _CM1CON_EVPOL_MASK                       0x000000C0 */
/* #define _CM1CON_EVPOL_LENGTH                     0x00000002 */

/* #define _CM1CON_COUT_POSITION                    0x00000008 */
/* #define _CM1CON_COUT_MASK                        0x00000100 */
/* #define _CM1CON_COUT_LENGTH                      0x00000001 */

/* #define _CM1CON_CLPWR_POSITION                   0x0000000C */
/* #define _CM1CON_CLPWR_MASK                       0x00001000 */
/* #define _CM1CON_CLPWR_LENGTH                     0x00000001 */

/* #define _CM1CON_CPOL_POSITION                    0x0000000D */
/* #define _CM1CON_CPOL_MASK                        0x00002000 */
/* #define _CM1CON_CPOL_LENGTH                      0x00000001 */

/* #define _CM1CON_COE_POSITION                     0x0000000E */
/* #define _CM1CON_COE_MASK                         0x00004000 */
/* #define _CM1CON_COE_LENGTH                       0x00000001 */

/* #define _CM1CON_ON_POSITION                      0x0000000F */
/* #define _CM1CON_ON_MASK                          0x00008000 */
/* #define _CM1CON_ON_LENGTH                        0x00000001 */

/* #define _CM1CON_CCH0_POSITION                    0x00000000 */
/* #define _CM1CON_CCH0_MASK                        0x00000001 */
/* #define _CM1CON_CCH0_LENGTH                      0x00000001 */

/* #define _CM1CON_CCH1_POSITION                    0x00000001 */
/* #define _CM1CON_CCH1_MASK                        0x00000002 */
/* #define _CM1CON_CCH1_LENGTH                      0x00000001 */

/* #define _CM1CON_EVPOL0_POSITION                  0x00000006 */
/* #define _CM1CON_EVPOL0_MASK                      0x00000040 */
/* #define _CM1CON_EVPOL0_LENGTH                    0x00000001 */

/* #define _CM1CON_EVPOL1_POSITION                  0x00000007 */
/* #define _CM1CON_EVPOL1_MASK                      0x00000080 */
/* #define _CM1CON_EVPOL1_LENGTH                    0x00000001 */

/* #define _CM1CON_w_POSITION                       0x00000000 */
/* #define _CM1CON_w_MASK                           0xFFFFFFFF */
/* #define _CM1CON_w_LENGTH                         0x00000020 */

/* #define _CM2CON_CCH_POSITION                     0x00000000 */
/* #define _CM2CON_CCH_MASK                         0x00000003 */
/* #define _CM2CON_CCH_LENGTH                       0x00000002 */

/* #define _CM2CON_CREF_POSITION                    0x00000004 */
/* #define _CM2CON_CREF_MASK                        0x00000010 */
/* #define _CM2CON_CREF_LENGTH                      0x00000001 */

/* #define _CM2CON_EVPOL_POSITION                   0x00000006 */
/* #define _CM2CON_EVPOL_MASK                       0x000000C0 */
/* #define _CM2CON_EVPOL_LENGTH                     0x00000002 */

/* #define _CM2CON_COUT_POSITION                    0x00000008 */
/* #define _CM2CON_COUT_MASK                        0x00000100 */
/* #define _CM2CON_COUT_LENGTH                      0x00000001 */

