rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _CM2CON_CLPWR_POSITION                   0x0000000C */
/* #define _CM2CON_CLPWR_MASK                       0x00001000 */
/* #define _CM2CON_CLPWR_LENGTH                     0x00000001 */

/* #define _CM2CON_CPOL_POSITION                    0x0000000D */
/* #define _CM2CON_CPOL_MASK                        0x00002000 */
/* #define _CM2CON_CPOL_LENGTH                      0x00000001 */

/* #define _CM2CON_COE_POSITION                     0x0000000E */
/* #define _CM2CON_COE_MASK                         0x00004000 */
/* #define _CM2CON_COE_LENGTH                       0x00000001 */

/* #define _CM2CON_ON_POSITION                      0x0000000F */
/* #define _CM2CON_ON_MASK                          0x00008000 */
/* #define _CM2CON_ON_LENGTH                        0x00000001 */

/* #define _CM2CON_CCH0_POSITION                    0x00000000 */
/* #define _CM2CON_CCH0_MASK                        0x00000001 */
/* #define _CM2CON_CCH0_LENGTH                      0x00000001 */

/* #define _CM2CON_CCH1_POSITION                    0x00000001 */
/* #define _CM2CON_CCH1_MASK                        0x00000002 */
/* #define _CM2CON_CCH1_LENGTH                      0x00000001 */

/* #define _CM2CON_EVPOL0_POSITION                  0x00000006 */
/* #define _CM2CON_EVPOL0_MASK                      0x00000040 */
/* #define _CM2CON_EVPOL0_LENGTH                    0x00000001 */

/* #define _CM2CON_EVPOL1_POSITION                  0x00000007 */
/* #define _CM2CON_EVPOL1_MASK                      0x00000080 */
/* #define _CM2CON_EVPOL1_LENGTH                    0x00000001 */

/* #define _CM2CON_w_POSITION                       0x00000000 */
/* #define _CM2CON_w_MASK                           0xFFFFFFFF */
/* #define _CM2CON_w_LENGTH                         0x00000020 */

/* #define _CMSTAT_C1OUT_POSITION                   0x00000000 */
/* #define _CMSTAT_C1OUT_MASK                       0x00000001 */
/* #define _CMSTAT_C1OUT_LENGTH                     0x00000001 */

/* #define _CMSTAT_C2OUT_POSITION                   0x00000001 */
/* #define _CMSTAT_C2OUT_MASK                       0x00000002 */
/* #define _CMSTAT_C2OUT_LENGTH                     0x00000001 */

/* #define _CMSTAT_C3OUT_POSITION                   0x00000002 */
/* #define _CMSTAT_C3OUT_MASK                       0x00000004 */
/* #define _CMSTAT_C3OUT_LENGTH                     0x00000001 */

/* #define _CMSTAT_C4OUT_POSITION                   0x00000003 */
/* #define _CMSTAT_C4OUT_MASK                       0x00000008 */
/* #define _CMSTAT_C4OUT_LENGTH                     0x00000001 */

/* #define _CMSTAT_C5OUT_POSITION                   0x00000004 */
/* #define _CMSTAT_C5OUT_MASK                       0x00000010 */
/* #define _CMSTAT_C5OUT_LENGTH                     0x00000001 */

/* #define _CMSTAT_C6OUT_POSITION                   0x00000005 */
/* #define _CMSTAT_C6OUT_MASK                       0x00000020 */
/* #define _CMSTAT_C6OUT_LENGTH                     0x00000001 */

/* #define _CMSTAT_SIDL_POSITION                    0x0000000D */
/* #define _CMSTAT_SIDL_MASK                        0x00002000 */
/* #define _CMSTAT_SIDL_LENGTH                      0x00000001 */

/* #define _CMSTAT_w_POSITION                       0x00000000 */
/* #define _CMSTAT_w_MASK                           0xFFFFFFFF */
/* #define _CMSTAT_w_LENGTH                         0x00000020 */

/* #define _CTMUCON_IRNG_POSITION                   0x00000000 */
/* #define _CTMUCON_IRNG_MASK                       0x00000003 */
/* #define _CTMUCON_IRNG_LENGTH                     0x00000002 */

/* #define _CTMUCON_ITRIM_POSITION                  0x00000002 */
/* #define _CTMUCON_ITRIM_MASK                      0x000000FC */
/* #define _CTMUCON_ITRIM_LENGTH                    0x00000006 */

/* #define _CTMUCON_CTTRIG_POSITION                 0x00000008 */
/* #define _CTMUCON_CTTRIG_MASK                     0x00000100 */
/* #define _CTMUCON_CTTRIG_LENGTH                   0x00000001 */

/* #define _CTMUCON_IDISSEN_POSITION                0x00000009 */
/* #define _CTMUCON_IDISSEN_MASK                    0x00000200 */
/* #define _CTMUCON_IDISSEN_LENGTH                  0x00000001 */

/* #define _CTMUCON_EDGSEQEN_POSITION               0x0000000A */
/* #define _CTMUCON_EDGSEQEN_MASK                   0x00000400 */
/* #define _CTMUCON_EDGSEQEN_LENGTH                 0x00000001 */

/* #define _CTMUCON_EDGEN_POSITION                  0x0000000B */
/* #define _CTMUCON_EDGEN_MASK                      0x00000800 */
/* #define _CTMUCON_EDGEN_LENGTH                    0x00000001 */

/* #define _CTMUCON_TGEN_POSITION                   0x0000000C */
/* #define _CTMUCON_TGEN_MASK                       0x00001000 */
/* #define _CTMUCON_TGEN_LENGTH                     0x00000001 */

/* #define _CTMUCON_CTMUSIDL_POSITION               0x0000000D */
/* #define _CTMUCON_CTMUSIDL_MASK                   0x00002000 */
/* #define _CTMUCON_CTMUSIDL_LENGTH                 0x00000001 */

/* #define _CTMUCON_ON_POSITION                     0x0000000F */
/* #define _CTMUCON_ON_MASK                         0x00008000 */
/* #define _CTMUCON_ON_LENGTH                       0x00000001 */

/* #define _CTMUCON_EDG2SEL_POSITION                0x00000012 */
/* #define _CTMUCON_EDG2SEL_MASK                    0x003C0000 */
/* #define _CTMUCON_EDG2SEL_LENGTH                  0x00000004 */

/* #define _CTMUCON_EDG2POL_POSITION                0x00000016 */
/* #define _CTMUCON_EDG2POL_MASK                    0x00400000 */
/* #define _CTMUCON_EDG2POL_LENGTH                  0x00000001 */

/* #define _CTMUCON_EDG2MOD_POSITION                0x00000017 */
/* #define _CTMUCON_EDG2MOD_MASK                    0x00800000 */
/* #define _CTMUCON_EDG2MOD_LENGTH                  0x00000001 */

/* #define _CTMUCON_EDG1STAT_POSITION               0x00000018 */
/* #define _CTMUCON_EDG1STAT_MASK                   0x01000000 */
/* #define _CTMUCON_EDG1STAT_LENGTH                 0x00000001 */

/* #define _CTMUCON_EDG2STAT_POSITION               0x00000019 */
/* #define _CTMUCON_EDG2STAT_MASK                   0x02000000 */
/* #define _CTMUCON_EDG2STAT_LENGTH                 0x00000001 */

/* #define _CTMUCON_EDG1SEL_POSITION                0x0000001A */
/* #define _CTMUCON_EDG1SEL_MASK                    0x3C000000 */
/* #define _CTMUCON_EDG1SEL_LENGTH                  0x00000004 */

