rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _CTMUCON_EDG1POL_POSITION                0x0000001E */
/* #define _CTMUCON_EDG1POL_MASK                    0x40000000 */
/* #define _CTMUCON_EDG1POL_LENGTH                  0x00000001 */

/* #define _CTMUCON_EDG1MOD_POSITION                0x0000001F */
/* #define _CTMUCON_EDG1MOD_MASK                    0x80000000 */
/* #define _CTMUCON_EDG1MOD_LENGTH                  0x00000001 */

/* #define _CTMUCON_w_POSITION                      0x00000000 */
/* #define _CTMUCON_w_MASK                          0xFFFFFFFF */
/* #define _CTMUCON_w_LENGTH                        0x00000020 */

/* #define _OSCCON_OSWEN_POSITION                   0x00000000 */
/* #define _OSCCON_OSWEN_MASK                       0x00000001 */
/* #define _OSCCON_OSWEN_LENGTH                     0x00000001 */

/* #define _OSCCON_SOSCEN_POSITION                  0x00000001 */
/* #define _OSCCON_SOSCEN_MASK                      0x00000002 */
/* #define _OSCCON_SOSCEN_LENGTH                    0x00000001 */

/* #define _OSCCON_UFRCEN_POSITION                  0x00000002 */
/* #define _OSCCON_UFRCEN_MASK                      0x00000004 */
/* #define _OSCCON_UFRCEN_LENGTH                    0x00000001 */

/* #define _OSCCON_CF_POSITION                      0x00000003 */
/* #define _OSCCON_CF_MASK                          0x00000008 */
/* #define _OSCCON_CF_LENGTH                        0x00000001 */

/* #define _OSCCON_SLPEN_POSITION                   0x00000004 */
/* #define _OSCCON_SLPEN_MASK                       0x00000010 */
/* #define _OSCCON_SLPEN_LENGTH                     0x00000001 */

/* #define _OSCCON_SLOCK_POSITION                   0x00000005 */
/* #define _OSCCON_SLOCK_MASK                       0x00000020 */
/* #define _OSCCON_SLOCK_LENGTH                     0x00000001 */

/* #define _OSCCON_ULOCK_POSITION                   0x00000006 */
/* #define _OSCCON_ULOCK_MASK                       0x00000040 */
/* #define _OSCCON_ULOCK_LENGTH                     0x00000001 */

/* #define _OSCCON_CLKLOCK_POSITION                 0x00000007 */
/* #define _OSCCON_CLKLOCK_MASK                     0x00000080 */
/* #define _OSCCON_CLKLOCK_LENGTH                   0x00000001 */

/* #define _OSCCON_NOSC_POSITION                    0x00000008 */
/* #define _OSCCON_NOSC_MASK                        0x00000700 */
/* #define _OSCCON_NOSC_LENGTH                      0x00000003 */

/* #define _OSCCON_COSC_POSITION                    0x0000000C */
/* #define _OSCCON_COSC_MASK                        0x00007000 */
/* #define _OSCCON_COSC_LENGTH                      0x00000003 */

/* #define _OSCCON_PLLMULT_POSITION                 0x00000010 */
/* #define _OSCCON_PLLMULT_MASK                     0x00070000 */
/* #define _OSCCON_PLLMULT_LENGTH                   0x00000003 */

/* #define _OSCCON_PBDIV_POSITION                   0x00000013 */
/* #define _OSCCON_PBDIV_MASK                       0x00180000 */
/* #define _OSCCON_PBDIV_LENGTH                     0x00000002 */

/* #define _OSCCON_PBDIVRDY_POSITION                0x00000015 */
/* #define _OSCCON_PBDIVRDY_MASK                    0x00200000 */
/* #define _OSCCON_PBDIVRDY_LENGTH                  0x00000001 */

/* #define _OSCCON_SOSCRDY_POSITION                 0x00000016 */
/* #define _OSCCON_SOSCRDY_MASK                     0x00400000 */
/* #define _OSCCON_SOSCRDY_LENGTH                   0x00000001 */

/* #define _OSCCON_FRCDIV_POSITION                  0x00000018 */
/* #define _OSCCON_FRCDIV_MASK                      0x07000000 */
/* #define _OSCCON_FRCDIV_LENGTH                    0x00000003 */

/* #define _OSCCON_PLLODIV_POSITION                 0x0000001B */
/* #define _OSCCON_PLLODIV_MASK                     0x38000000 */
/* #define _OSCCON_PLLODIV_LENGTH                   0x00000003 */

/* #define _OSCCON_NOSC0_POSITION                   0x00000008 */
/* #define _OSCCON_NOSC0_MASK                       0x00000100 */
/* #define _OSCCON_NOSC0_LENGTH                     0x00000001 */

/* #define _OSCCON_NOSC1_POSITION                   0x00000009 */
/* #define _OSCCON_NOSC1_MASK                       0x00000200 */
/* #define _OSCCON_NOSC1_LENGTH                     0x00000001 */

/* #define _OSCCON_NOSC2_POSITION                   0x0000000A */
/* #define _OSCCON_NOSC2_MASK                       0x00000400 */
/* #define _OSCCON_NOSC2_LENGTH                     0x00000001 */

/* #define _OSCCON_COSC0_POSITION                   0x0000000C */
/* #define _OSCCON_COSC0_MASK                       0x00001000 */
/* #define _OSCCON_COSC0_LENGTH                     0x00000001 */

/* #define _OSCCON_COSC1_POSITION                   0x0000000D */
/* #define _OSCCON_COSC1_MASK                       0x00002000 */
/* #define _OSCCON_COSC1_LENGTH                     0x00000001 */

/* #define _OSCCON_COSC2_POSITION                   0x0000000E */
/* #define _OSCCON_COSC2_MASK                       0x00004000 */
/* #define _OSCCON_COSC2_LENGTH                     0x00000001 */

/* #define _OSCCON_PLLMULT0_POSITION                0x00000010 */
/* #define _OSCCON_PLLMULT0_MASK                    0x00010000 */
/* #define _OSCCON_PLLMULT0_LENGTH                  0x00000001 */

/* #define _OSCCON_PLLMULT1_POSITION                0x00000011 */
/* #define _OSCCON_PLLMULT1_MASK                    0x00020000 */
/* #define _OSCCON_PLLMULT1_LENGTH                  0x00000001 */

/* #define _OSCCON_PLLMULT2_POSITION                0x00000012 */
/* #define _OSCCON_PLLMULT2_MASK                    0x00040000 */
/* #define _OSCCON_PLLMULT2_LENGTH                  0x00000001 */

/* #define _OSCCON_PBDIV0_POSITION                  0x00000013 */
/* #define _OSCCON_PBDIV0_MASK                      0x00080000 */
/* #define _OSCCON_PBDIV0_LENGTH                    0x00000001 */

/* #define _OSCCON_PBDIV1_POSITION                  0x00000014 */
/* #define _OSCCON_PBDIV1_MASK                      0x00100000 */
/* #define _OSCCON_PBDIV1_LENGTH                    0x00000001 */

/* #define _OSCCON_FRCDIV0_POSITION                 0x00000018 */
/* #define _OSCCON_FRCDIV0_MASK                     0x01000000 */
/* #define _OSCCON_FRCDIV0_LENGTH                   0x00000001 */

/* #define _OSCCON_FRCDIV1_POSITION                 0x00000019 */
/* #define _OSCCON_FRCDIV1_MASK                     0x02000000 */
/* #define _OSCCON_FRCDIV1_LENGTH                   0x00000001 */

/* #define _OSCCON_FRCDIV2_POSITION                 0x0000001A */
/* #define _OSCCON_FRCDIV2_MASK                     0x04000000 */
/* #define _OSCCON_FRCDIV2_LENGTH                   0x00000001 */

/* #define _OSCCON_PLLODIV0_POSITION                0x0000001B */
/* #define _OSCCON_PLLODIV0_MASK                    0x08000000 */
/* #define _OSCCON_PLLODIV0_LENGTH                  0x00000001 */

/* #define _OSCCON_PLLODIV1_POSITION                0x0000001C */
/* #define _OSCCON_PLLODIV1_MASK                    0x10000000 */
/* #define _OSCCON_PLLODIV1_LENGTH                  0x00000001 */

/* #define _OSCCON_PLLODIV2_POSITION                0x0000001D */
/* #define _OSCCON_PLLODIV2_MASK                    0x20000000 */
/* #define _OSCCON_PLLODIV2_LENGTH                  0x00000001 */

/* #define _OSCCON_w_POSITION                       0x00000000 */
/* #define _OSCCON_w_MASK                           0xFFFFFFFF */
/* #define _OSCCON_w_LENGTH                         0x00000020 */

/* #define _OSCTUN_TUN_POSITION                     0x00000000 */
/* #define _OSCTUN_TUN_MASK                         0x0000003F */
/* #define _OSCTUN_TUN_LENGTH                       0x00000006 */

/* #define _OSCTUN_TUN0_POSITION                    0x00000000 */
/* #define _OSCTUN_TUN0_MASK                        0x00000001 */
/* #define _OSCTUN_TUN0_LENGTH                      0x00000001 */

