rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _OSCTUN_TUN1_POSITION                    0x00000001 */
/* #define _OSCTUN_TUN1_MASK                        0x00000002 */
/* #define _OSCTUN_TUN1_LENGTH                      0x00000001 */

/* #define _OSCTUN_TUN2_POSITION                    0x00000002 */
/* #define _OSCTUN_TUN2_MASK                        0x00000004 */
/* #define _OSCTUN_TUN2_LENGTH                      0x00000001 */

/* #define _OSCTUN_TUN3_POSITION                    0x00000003 */
/* #define _OSCTUN_TUN3_MASK                        0x00000008 */
/* #define _OSCTUN_TUN3_LENGTH                      0x00000001 */

/* #define _OSCTUN_TUN4_POSITION                    0x00000004 */
/* #define _OSCTUN_TUN4_MASK                        0x00000010 */
/* #define _OSCTUN_TUN4_LENGTH                      0x00000001 */

/* #define _OSCTUN_TUN5_POSITION                    0x00000005 */
/* #define _OSCTUN_TUN5_MASK                        0x00000020 */
/* #define _OSCTUN_TUN5_LENGTH                      0x00000001 */

/* #define _OSCTUN_w_POSITION                       0x00000000 */
/* #define _OSCTUN_w_MASK                           0xFFFFFFFF */
/* #define _OSCTUN_w_LENGTH                         0x00000020 */

/* #define _REFOCON_ROSEL_POSITION                  0x00000000 */
/* #define _REFOCON_ROSEL_MASK                      0x0000000F */
/* #define _REFOCON_ROSEL_LENGTH                    0x00000004 */

/* #define _REFOCON_ACTIVE_POSITION                 0x00000008 */
/* #define _REFOCON_ACTIVE_MASK                     0x00000100 */
/* #define _REFOCON_ACTIVE_LENGTH                   0x00000001 */

/* #define _REFOCON_DIVSWEN_POSITION                0x00000009 */
/* #define _REFOCON_DIVSWEN_MASK                    0x00000200 */
/* #define _REFOCON_DIVSWEN_LENGTH                  0x00000001 */

/* #define _REFOCON_RSLP_POSITION                   0x0000000B */
/* #define _REFOCON_RSLP_MASK                       0x00000800 */
/* #define _REFOCON_RSLP_LENGTH                     0x00000001 */

/* #define _REFOCON_OE_POSITION                     0x0000000C */
/* #define _REFOCON_OE_MASK                         0x00001000 */
/* #define _REFOCON_OE_LENGTH                       0x00000001 */

/* #define _REFOCON_SIDL_POSITION                   0x0000000D */
/* #define _REFOCON_SIDL_MASK                       0x00002000 */
/* #define _REFOCON_SIDL_LENGTH                     0x00000001 */

/* #define _REFOCON_ON_POSITION                     0x0000000F */
/* #define _REFOCON_ON_MASK                         0x00008000 */
/* #define _REFOCON_ON_LENGTH                       0x00000001 */

/* #define _REFOCON_RODIV_POSITION                  0x00000010 */
/* #define _REFOCON_RODIV_MASK                      0x7FFF0000 */
/* #define _REFOCON_RODIV_LENGTH                    0x0000000F */

/* #define _REFOCON_w_POSITION                      0x00000000 */
/* #define _REFOCON_w_MASK                          0xFFFFFFFF */
/* #define _REFOCON_w_LENGTH                        0x00000020 */

/* #define _REFOTRIM_ROTRIM_POSITION                0x00000017 */
/* #define _REFOTRIM_ROTRIM_MASK                    0xFF800000 */
/* #define _REFOTRIM_ROTRIM_LENGTH                  0x00000009 */

/* #define _REFOTRIM_w_POSITION                     0x00000000 */
/* #define _REFOTRIM_w_MASK                         0xFFFFFFFF */
/* #define _REFOTRIM_w_LENGTH                       0x00000020 */

/* #define _CFGCON_TDOEN_POSITION                   0x00000000 */
/* #define _CFGCON_TDOEN_MASK                       0x00000001 */
/* #define _CFGCON_TDOEN_LENGTH                     0x00000001 */

/* #define _CFGCON_TROEN_POSITION                   0x00000002 */
/* #define _CFGCON_TROEN_MASK                       0x00000004 */
/* #define _CFGCON_TROEN_LENGTH                     0x00000001 */

/* #define _CFGCON_JTAGEN_POSITION                  0x00000003 */
/* #define _CFGCON_JTAGEN_MASK                      0x00000008 */
/* #define _CFGCON_JTAGEN_LENGTH                    0x00000001 */

/* #define _CFGCON_PMDLOCK_POSITION                 0x0000000C */
/* #define _CFGCON_PMDLOCK_MASK                     0x00001000 */
/* #define _CFGCON_PMDLOCK_LENGTH                   0x00000001 */

/* #define _CFGCON_IOLOCK_POSITION                  0x0000000D */
/* #define _CFGCON_IOLOCK_MASK                      0x00002000 */
/* #define _CFGCON_IOLOCK_LENGTH                    0x00000001 */

/* #define _DDPCON_TDOEN_POSITION                   0x00000000 */
/* #define _DDPCON_TDOEN_MASK                       0x00000001 */
/* #define _DDPCON_TDOEN_LENGTH                     0x00000001 */

/* #define _DDPCON_TROEN_POSITION                   0x00000002 */
/* #define _DDPCON_TROEN_MASK                       0x00000004 */
/* #define _DDPCON_TROEN_LENGTH                     0x00000001 */

/* #define _DDPCON_JTAGEN_POSITION                  0x00000003 */
/* #define _DDPCON_JTAGEN_MASK                      0x00000008 */
/* #define _DDPCON_JTAGEN_LENGTH                    0x00000001 */

/* #define _DDPCON_PMDLOCK_POSITION                 0x0000000C */
/* #define _DDPCON_PMDLOCK_MASK                     0x00001000 */
/* #define _DDPCON_PMDLOCK_LENGTH                   0x00000001 */

/* #define _DDPCON_IOLOCK_POSITION                  0x0000000D */
/* #define _DDPCON_IOLOCK_MASK                      0x00002000 */
/* #define _DDPCON_IOLOCK_LENGTH                    0x00000001 */

/* #define _DEVID_DEVID_POSITION                    0x00000000 */
/* #define _DEVID_DEVID_MASK                        0x0FFFFFFF */
/* #define _DEVID_DEVID_LENGTH                      0x0000001C */

/* #define _DEVID_VER_POSITION                      0x0000001C */
/* #define _DEVID_VER_MASK                          0xF0000000 */
/* #define _DEVID_VER_LENGTH                        0x00000004 */

/* #define _PMD1_AD1MD_POSITION                     0x00000000 */
/* #define _PMD1_AD1MD_MASK                         0x00000001 */
/* #define _PMD1_AD1MD_LENGTH                       0x00000001 */

/* #define _PMD1_CTMUMD_POSITION                    0x00000008 */
/* #define _PMD1_CTMUMD_MASK                        0x00000100 */
/* #define _PMD1_CTMUMD_LENGTH                      0x00000001 */

/* #define _PMD1_CVRMD_POSITION                     0x0000000C */
/* #define _PMD1_CVRMD_MASK                         0x00001000 */
/* #define _PMD1_CVRMD_LENGTH                       0x00000001 */

