rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _PMD2_CMP1MD_POSITION                    0x00000000 */
/* #define _PMD2_CMP1MD_MASK                        0x00000001 */
/* #define _PMD2_CMP1MD_LENGTH                      0x00000001 */

/* #define _PMD2_CMP2MD_POSITION                    0x00000001 */
/* #define _PMD2_CMP2MD_MASK                        0x00000002 */
/* #define _PMD2_CMP2MD_LENGTH                      0x00000001 */

/* #define _PMD3_IC1MD_POSITION                     0x00000000 */
/* #define _PMD3_IC1MD_MASK                         0x00000001 */
/* #define _PMD3_IC1MD_LENGTH                       0x00000001 */

/* #define _PMD3_IC2MD_POSITION                     0x00000001 */
/* #define _PMD3_IC2MD_MASK                         0x00000002 */
/* #define _PMD3_IC2MD_LENGTH                       0x00000001 */

/* #define _PMD3_IC3MD_POSITION                     0x00000002 */
/* #define _PMD3_IC3MD_MASK                         0x00000004 */
/* #define _PMD3_IC3MD_LENGTH                       0x00000001 */

/* #define _PMD3_IC4MD_POSITION                     0x00000003 */
/* #define _PMD3_IC4MD_MASK                         0x00000008 */
/* #define _PMD3_IC4MD_LENGTH                       0x00000001 */

/* #define _PMD3_IC5MD_POSITION                     0x00000004 */
/* #define _PMD3_IC5MD_MASK                         0x00000010 */
/* #define _PMD3_IC5MD_LENGTH                       0x00000001 */

/* #define _PMD3_OC1MD_POSITION                     0x00000010 */
/* #define _PMD3_OC1MD_MASK                         0x00010000 */
/* #define _PMD3_OC1MD_LENGTH                       0x00000001 */

/* #define _PMD3_OC2MD_POSITION                     0x00000011 */
/* #define _PMD3_OC2MD_MASK                         0x00020000 */
/* #define _PMD3_OC2MD_LENGTH                       0x00000001 */

/* #define _PMD3_OC3MD_POSITION                     0x00000012 */
/* #define _PMD3_OC3MD_MASK                         0x00040000 */
/* #define _PMD3_OC3MD_LENGTH                       0x00000001 */

/* #define _PMD3_OC4MD_POSITION                     0x00000013 */
/* #define _PMD3_OC4MD_MASK                         0x00080000 */
/* #define _PMD3_OC4MD_LENGTH                       0x00000001 */

/* #define _PMD3_OC5MD_POSITION                     0x00000014 */
/* #define _PMD3_OC5MD_MASK                         0x00100000 */
/* #define _PMD3_OC5MD_LENGTH                       0x00000001 */

/* #define _PMD4_T1MD_POSITION                      0x00000000 */
/* #define _PMD4_T1MD_MASK                          0x00000001 */
/* #define _PMD4_T1MD_LENGTH                        0x00000001 */

/* #define _PMD4_T2MD_POSITION                      0x00000001 */
/* #define _PMD4_T2MD_MASK                          0x00000002 */
/* #define _PMD4_T2MD_LENGTH                        0x00000001 */

/* #define _PMD4_T3MD_POSITION                      0x00000002 */
/* #define _PMD4_T3MD_MASK                          0x00000004 */
/* #define _PMD4_T3MD_LENGTH                        0x00000001 */

/* #define _PMD4_T4MD_POSITION                      0x00000003 */
/* #define _PMD4_T4MD_MASK                          0x00000008 */
/* #define _PMD4_T4MD_LENGTH                        0x00000001 */

/* #define _PMD4_T5MD_POSITION                      0x00000004 */
/* #define _PMD4_T5MD_MASK                          0x00000010 */
/* #define _PMD4_T5MD_LENGTH                        0x00000001 */

/* #define _PMD5_U1MD_POSITION                      0x00000000 */
/* #define _PMD5_U1MD_MASK                          0x00000001 */
/* #define _PMD5_U1MD_LENGTH                        0x00000001 */

/* #define _PMD5_U2MD_POSITION                      0x00000001 */
/* #define _PMD5_U2MD_MASK                          0x00000002 */
/* #define _PMD5_U2MD_LENGTH                        0x00000001 */

/* #define _PMD5_U3MD_POSITION                      0x00000002 */
/* #define _PMD5_U3MD_MASK                          0x00000004 */
/* #define _PMD5_U3MD_LENGTH                        0x00000001 */

/* #define _PMD5_U4MD_POSITION                      0x00000003 */
/* #define _PMD5_U4MD_MASK                          0x00000008 */
/* #define _PMD5_U4MD_LENGTH                        0x00000001 */

/* #define _PMD5_SPI1MD_POSITION                    0x00000008 */
/* #define _PMD5_SPI1MD_MASK                        0x00000100 */
/* #define _PMD5_SPI1MD_LENGTH                      0x00000001 */

/* #define _PMD5_SPI2MD_POSITION                    0x00000009 */
/* #define _PMD5_SPI2MD_MASK                        0x00000200 */
/* #define _PMD5_SPI2MD_LENGTH                      0x00000001 */

/* #define _PMD5_I2C1MD_POSITION                    0x00000010 */
/* #define _PMD5_I2C1MD_MASK                        0x00010000 */
/* #define _PMD5_I2C1MD_LENGTH                      0x00000001 */

/* #define _PMD5_I2C2MD_POSITION                    0x00000011 */
/* #define _PMD5_I2C2MD_MASK                        0x00020000 */
/* #define _PMD5_I2C2MD_LENGTH                      0x00000001 */

/* #define _PMD5_USB1MD_POSITION                    0x00000018 */
/* #define _PMD5_USB1MD_MASK                        0x01000000 */
/* #define _PMD5_USB1MD_LENGTH                      0x00000001 */

/* #define _PMD6_RTCCMD_POSITION                    0x00000000 */
/* #define _PMD6_RTCCMD_MASK                        0x00000001 */
/* #define _PMD6_RTCCMD_LENGTH                      0x00000001 */

/* #define _PMD6_REFOMD_POSITION                    0x00000001 */
/* #define _PMD6_REFOMD_MASK                        0x00000002 */
/* #define _PMD6_REFOMD_LENGTH                      0x00000001 */

/* #define _PMD6_PMPMD_POSITION                     0x00000010 */
/* #define _PMD6_PMPMD_MASK                         0x00010000 */
/* #define _PMD6_PMPMD_LENGTH                       0x00000001 */

/* #define _NVMCON_NVMOP_POSITION                   0x00000000 */
/* #define _NVMCON_NVMOP_MASK                       0x0000000F */
/* #define _NVMCON_NVMOP_LENGTH                     0x00000004 */

/* #define _NVMCON_LVDSTAT_POSITION                 0x0000000B */
/* #define _NVMCON_LVDSTAT_MASK                     0x00000800 */
/* #define _NVMCON_LVDSTAT_LENGTH                   0x00000001 */

/* #define _NVMCON_LVDERR_POSITION                  0x0000000C */
/* #define _NVMCON_LVDERR_MASK                      0x00001000 */
/* #define _NVMCON_LVDERR_LENGTH                    0x00000001 */

