rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _NVMCON_WRERR_POSITION                   0x0000000D */
/* #define _NVMCON_WRERR_MASK                       0x00002000 */
/* #define _NVMCON_WRERR_LENGTH                     0x00000001 */

/* #define _NVMCON_WREN_POSITION                    0x0000000E */
/* #define _NVMCON_WREN_MASK                        0x00004000 */
/* #define _NVMCON_WREN_LENGTH                      0x00000001 */

/* #define _NVMCON_WR_POSITION                      0x0000000F */
/* #define _NVMCON_WR_MASK                          0x00008000 */
/* #define _NVMCON_WR_LENGTH                        0x00000001 */

/* #define _NVMCON_NVMOP0_POSITION                  0x00000000 */
/* #define _NVMCON_NVMOP0_MASK                      0x00000001 */
/* #define _NVMCON_NVMOP0_LENGTH                    0x00000001 */

/* #define _NVMCON_NVMOP1_POSITION                  0x00000001 */
/* #define _NVMCON_NVMOP1_MASK                      0x00000002 */
/* #define _NVMCON_NVMOP1_LENGTH                    0x00000001 */

/* #define _NVMCON_NVMOP2_POSITION                  0x00000002 */
/* #define _NVMCON_NVMOP2_MASK                      0x00000004 */
/* #define _NVMCON_NVMOP2_LENGTH                    0x00000001 */

/* #define _NVMCON_NVMOP3_POSITION                  0x00000003 */
/* #define _NVMCON_NVMOP3_MASK                      0x00000008 */
/* #define _NVMCON_NVMOP3_LENGTH                    0x00000001 */

/* #define _NVMCON_PROGOP_POSITION                  0x00000000 */
/* #define _NVMCON_PROGOP_MASK                      0x0000000F */
/* #define _NVMCON_PROGOP_LENGTH                    0x00000004 */

/* #define _NVMCON_PROGOP0_POSITION                 0x00000000 */
/* #define _NVMCON_PROGOP0_MASK                     0x00000001 */
/* #define _NVMCON_PROGOP0_LENGTH                   0x00000001 */

/* #define _NVMCON_PROGOP1_POSITION                 0x00000001 */
/* #define _NVMCON_PROGOP1_MASK                     0x00000002 */
/* #define _NVMCON_PROGOP1_LENGTH                   0x00000001 */

/* #define _NVMCON_PROGOP2_POSITION                 0x00000002 */
/* #define _NVMCON_PROGOP2_MASK                     0x00000004 */
/* #define _NVMCON_PROGOP2_LENGTH                   0x00000001 */

/* #define _NVMCON_PROGOP3_POSITION                 0x00000003 */
/* #define _NVMCON_PROGOP3_MASK                     0x00000008 */
/* #define _NVMCON_PROGOP3_LENGTH                   0x00000001 */

/* #define _NVMCON_w_POSITION                       0x00000000 */
/* #define _NVMCON_w_MASK                           0xFFFFFFFF */
/* #define _NVMCON_w_LENGTH                         0x00000020 */

/* #define _RCON_POR_POSITION                       0x00000000 */
/* #define _RCON_POR_MASK                           0x00000001 */
/* #define _RCON_POR_LENGTH                         0x00000001 */

/* #define _RCON_BOR_POSITION                       0x00000001 */
/* #define _RCON_BOR_MASK                           0x00000002 */
/* #define _RCON_BOR_LENGTH                         0x00000001 */

/* #define _RCON_IDLE_POSITION                      0x00000002 */
/* #define _RCON_IDLE_MASK                          0x00000004 */
/* #define _RCON_IDLE_LENGTH                        0x00000001 */

/* #define _RCON_SLEEP_POSITION                     0x00000003 */
/* #define _RCON_SLEEP_MASK                         0x00000008 */
/* #define _RCON_SLEEP_LENGTH                       0x00000001 */

/* #define _RCON_WDTO_POSITION                      0x00000004 */
/* #define _RCON_WDTO_MASK                          0x00000010 */
/* #define _RCON_WDTO_LENGTH                        0x00000001 */

/* #define _RCON_SWR_POSITION                       0x00000006 */
/* #define _RCON_SWR_MASK                           0x00000040 */
/* #define _RCON_SWR_LENGTH                         0x00000001 */

/* #define _RCON_EXTR_POSITION                      0x00000007 */
/* #define _RCON_EXTR_MASK                          0x00000080 */
/* #define _RCON_EXTR_LENGTH                        0x00000001 */

/* #define _RCON_VREGS_POSITION                     0x00000008 */
/* #define _RCON_VREGS_MASK                         0x00000100 */
/* #define _RCON_VREGS_LENGTH                       0x00000001 */

/* #define _RCON_CMR_POSITION                       0x00000009 */
/* #define _RCON_CMR_MASK                           0x00000200 */
/* #define _RCON_CMR_LENGTH                         0x00000001 */

/* #define _RCON_HVDR_POSITION                      0x0000001D */
/* #define _RCON_HVDR_MASK                          0x20000000 */
/* #define _RCON_HVDR_LENGTH                        0x00000001 */

/* #define _RCON_w_POSITION                         0x00000000 */
/* #define _RCON_w_MASK                             0xFFFFFFFF */
/* #define _RCON_w_LENGTH                           0x00000020 */

/* #define _RSWRST_SWRST_POSITION                   0x00000000 */
/* #define _RSWRST_SWRST_MASK                       0x00000001 */
/* #define _RSWRST_SWRST_LENGTH                     0x00000001 */

/* #define _RSWRST_w_POSITION                       0x00000000 */
/* #define _RSWRST_w_MASK                           0xFFFFFFFF */
/* #define _RSWRST_w_LENGTH                         0x00000020 */

/* #define _INT1R_INT1R_POSITION                    0x00000000 */
/* #define _INT1R_INT1R_MASK                        0x0000000F */
/* #define _INT1R_INT1R_LENGTH                      0x00000004 */

/* #define _INT2R_INT2R_POSITION                    0x00000000 */
/* #define _INT2R_INT2R_MASK                        0x0000000F */
/* #define _INT2R_INT2R_LENGTH                      0x00000004 */

/* #define _INT3R_INT3R_POSITION                    0x00000000 */
/* #define _INT3R_INT3R_MASK                        0x0000000F */
/* #define _INT3R_INT3R_LENGTH                      0x00000004 */

/* #define _INT4R_INT4R_POSITION                    0x00000000 */
/* #define _INT4R_INT4R_MASK                        0x0000000F */
/* #define _INT4R_INT4R_LENGTH                      0x00000004 */

/* #define _T2CKR_T2CKR_POSITION                    0x00000000 */
/* #define _T2CKR_T2CKR_MASK                        0x0000000F */
/* #define _T2CKR_T2CKR_LENGTH                      0x00000004 */

/* #define _T3CKR_T3CKR_POSITION                    0x00000000 */
/* #define _T3CKR_T3CKR_MASK                        0x0000000F */
/* #define _T3CKR_T3CKR_LENGTH                      0x00000004 */

/* #define _T4CKR_T4CKR_POSITION                    0x00000000 */
/* #define _T4CKR_T4CKR_MASK                        0x0000000F */
/* #define _T4CKR_T4CKR_LENGTH                      0x00000004 */

/* #define _T5CKR_T5CKR_POSITION                    0x00000000 */
/* #define _T5CKR_T5CKR_MASK                        0x0000000F */
/* #define _T5CKR_T5CKR_LENGTH                      0x00000004 */

/* #define _IC1R_IC1R_POSITION                      0x00000000 */
/* #define _IC1R_IC1R_MASK                          0x0000000F */
/* #define _IC1R_IC1R_LENGTH                        0x00000004 */

/* #define _IC2R_IC2R_POSITION                      0x00000000 */
/* #define _IC2R_IC2R_MASK                          0x0000000F */
/* #define _IC2R_IC2R_LENGTH                        0x00000004 */

/* #define _IC3R_IC3R_POSITION                      0x00000000 */
/* #define _IC3R_IC3R_MASK                          0x0000000F */
/* #define _IC3R_IC3R_LENGTH                        0x00000004 */

/* #define _IC4R_IC4R_POSITION                      0x00000000 */
/* #define _IC4R_IC4R_MASK                          0x0000000F */
/* #define _IC4R_IC4R_LENGTH                        0x00000004 */

/* #define _IC5R_IC5R_POSITION                      0x00000000 */
/* #define _IC5R_IC5R_MASK                          0x0000000F */
/* #define _IC5R_IC5R_LENGTH                        0x00000004 */

/* #define _OCFAR_OCFAR_POSITION                    0x00000000 */
/* #define _OCFAR_OCFAR_MASK                        0x0000000F */
/* #define _OCFAR_OCFAR_LENGTH                      0x00000004 */

/* #define _OCFBR_OCFBR_POSITION                    0x00000000 */
/* #define _OCFBR_OCFBR_MASK                        0x0000000F */
/* #define _OCFBR_OCFBR_LENGTH                      0x00000004 */

/* #define _U1RXR_U1RXR_POSITION                    0x00000000 */
/* #define _U1RXR_U1RXR_MASK                        0x0000000F */
/* #define _U1RXR_U1RXR_LENGTH                      0x00000004 */

/* #define _U1CTSR_U1CTSR_POSITION                  0x00000000 */
/* #define _U1CTSR_U1CTSR_MASK                      0x0000000F */
/* #define _U1CTSR_U1CTSR_LENGTH                    0x00000004 */

/* #define _U2RXR_U2RXR_POSITION                    0x00000000 */
/* #define _U2RXR_U2RXR_MASK                        0x0000000F */
/* #define _U2RXR_U2RXR_LENGTH                      0x00000004 */

/* #define _U2CTSR_U2CTSR_POSITION                  0x00000000 */
/* #define _U2CTSR_U2CTSR_MASK                      0x0000000F */
/* #define _U2CTSR_U2CTSR_LENGTH                    0x00000004 */

/* #define _U3RXR_U3RXR_POSITION                    0x00000000 */
/* #define _U3RXR_U3RXR_MASK                        0x0000000F */
/* #define _U3RXR_U3RXR_LENGTH                      0x00000004 */

/* #define _U3CTSR_U3CTSR_POSITION                  0x00000000 */
/* #define _U3CTSR_U3CTSR_MASK                      0x0000000F */
/* #define _U3CTSR_U3CTSR_LENGTH                    0x00000004 */

/* #define _U4RXR_U4RXR_POSITION                    0x00000000 */
/* #define _U4RXR_U4RXR_MASK                        0x0000000F */
/* #define _U4RXR_U4RXR_LENGTH                      0x00000004 */

/* #define _U4CTSR_U4CTSR_POSITION                  0x00000000 */
/* #define _U4CTSR_U4CTSR_MASK                      0x0000000F */
/* #define _U4CTSR_U4CTSR_LENGTH                    0x00000004 */

/* #define _U5RXR_U5RXR_POSITION                    0x00000000 */
/* #define _U5RXR_U5RXR_MASK                        0x0000000F */
/* #define _U5RXR_U5RXR_LENGTH                      0x00000004 */

/* #define _U5CTSR_U5CTSR_POSITION                  0x00000000 */
/* #define _U5CTSR_U5CTSR_MASK                      0x0000000F */
/* #define _U5CTSR_U5CTSR_LENGTH                    0x00000004 */

/* #define _SDI1R_SDI1R_POSITION                    0x00000000 */
/* #define _SDI1R_SDI1R_MASK                        0x0000000F */
/* #define _SDI1R_SDI1R_LENGTH                      0x00000004 */

/* #define _SS1R_SS1R_POSITION                      0x00000000 */
/* #define _SS1R_SS1R_MASK                          0x0000000F */
/* #define _SS1R_SS1R_LENGTH                        0x00000004 */

/* #define _SDI2R_SDI2R_POSITION                    0x00000000 */
/* #define _SDI2R_SDI2R_MASK                        0x0000000F */
/* #define _SDI2R_SDI2R_LENGTH                      0x00000004 */

