rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _SS2R_SS2R_POSITION                      0x00000000 */
/* #define _SS2R_SS2R_MASK                          0x0000000F */
/* #define _SS2R_SS2R_LENGTH                        0x00000004 */

/* #define _REFCLKIR_REFCLKIR_POSITION              0x00000000 */
/* #define _REFCLKIR_REFCLKIR_MASK                  0x0000000F */
/* #define _REFCLKIR_REFCLKIR_LENGTH                0x00000004 */

/* #define _RPB0R_RPB0R_POSITION                    0x00000000 */
/* #define _RPB0R_RPB0R_MASK                        0x0000000F */
/* #define _RPB0R_RPB0R_LENGTH                      0x00000004 */

/* #define _RPB1R_RPB1R_POSITION                    0x00000000 */
/* #define _RPB1R_RPB1R_MASK                        0x0000000F */
/* #define _RPB1R_RPB1R_LENGTH                      0x00000004 */

/* #define _RPB2R_RPB2R_POSITION                    0x00000000 */
/* #define _RPB2R_RPB2R_MASK                        0x0000000F */
/* #define _RPB2R_RPB2R_LENGTH                      0x00000004 */

/* #define _RPB3R_RPB3R_POSITION                    0x00000000 */
/* #define _RPB3R_RPB3R_MASK                        0x0000000F */
/* #define _RPB3R_RPB3R_LENGTH                      0x00000004 */

/* #define _RPB5R_RPB5R_POSITION                    0x00000000 */
/* #define _RPB5R_RPB5R_MASK                        0x0000000F */
/* #define _RPB5R_RPB5R_LENGTH                      0x00000004 */

/* #define _RPB6R_RPB6R_POSITION                    0x00000000 */
/* #define _RPB6R_RPB6R_MASK                        0x0000000F */
/* #define _RPB6R_RPB6R_LENGTH                      0x00000004 */

/* #define _RPB7R_RPB7R_POSITION                    0x00000000 */
/* #define _RPB7R_RPB7R_MASK                        0x0000000F */
/* #define _RPB7R_RPB7R_LENGTH                      0x00000004 */

/* #define _RPB8R_RPB8R_POSITION                    0x00000000 */
/* #define _RPB8R_RPB8R_MASK                        0x0000000F */
/* #define _RPB8R_RPB8R_LENGTH                      0x00000004 */

/* #define _RPB9R_RPB9R_POSITION                    0x00000000 */
/* #define _RPB9R_RPB9R_MASK                        0x0000000F */
/* #define _RPB9R_RPB9R_LENGTH                      0x00000004 */

/* #define _RPB10R_RPB10R_POSITION                  0x00000000 */
/* #define _RPB10R_RPB10R_MASK                      0x0000000F */
/* #define _RPB10R_RPB10R_LENGTH                    0x00000004 */

/* #define _RPB14R_RPB14R_POSITION                  0x00000000 */
/* #define _RPB14R_RPB14R_MASK                      0x0000000F */
/* #define _RPB14R_RPB14R_LENGTH                    0x00000004 */

/* #define _RPB15R_RPB15R_POSITION                  0x00000000 */
/* #define _RPB15R_RPB15R_MASK                      0x0000000F */
/* #define _RPB15R_RPB15R_LENGTH                    0x00000004 */

/* #define _RPD0R_RPD0R_POSITION                    0x00000000 */
/* #define _RPD0R_RPD0R_MASK                        0x0000000F */
/* #define _RPD0R_RPD0R_LENGTH                      0x00000004 */

/* #define _RPD1R_RPD1R_POSITION                    0x00000000 */
/* #define _RPD1R_RPD1R_MASK                        0x0000000F */
/* #define _RPD1R_RPD1R_LENGTH                      0x00000004 */

/* #define _RPD2R_RPD2R_POSITION                    0x00000000 */
/* #define _RPD2R_RPD2R_MASK                        0x0000000F */
/* #define _RPD2R_RPD2R_LENGTH                      0x00000004 */

/* #define _RPD3R_RPD3R_POSITION                    0x00000000 */
/* #define _RPD3R_RPD3R_MASK                        0x0000000F */
/* #define _RPD3R_RPD3R_LENGTH                      0x00000004 */

/* #define _RPD4R_RPD4R_POSITION                    0x00000000 */
/* #define _RPD4R_RPD4R_MASK                        0x0000000F */
/* #define _RPD4R_RPD4R_LENGTH                      0x00000004 */

/* #define _RPD5R_RPD5R_POSITION                    0x00000000 */
/* #define _RPD5R_RPD5R_MASK                        0x0000000F */
/* #define _RPD5R_RPD5R_LENGTH                      0x00000004 */

/* #define _RPD8R_RPD8R_POSITION                    0x00000000 */
/* #define _RPD8R_RPD8R_MASK                        0x0000000F */
/* #define _RPD8R_RPD8R_LENGTH                      0x00000004 */

/* #define _RPD9R_RPD9R_POSITION                    0x00000000 */
/* #define _RPD9R_RPD9R_MASK                        0x0000000F */
/* #define _RPD9R_RPD9R_LENGTH                      0x00000004 */

/* #define _RPD10R_RPD10R_POSITION                  0x00000000 */
/* #define _RPD10R_RPD10R_MASK                      0x0000000F */
/* #define _RPD10R_RPD10R_LENGTH                    0x00000004 */

/* #define _RPD11R_RPD11R_POSITION                  0x00000000 */
/* #define _RPD11R_RPD11R_MASK                      0x0000000F */
/* #define _RPD11R_RPD11R_LENGTH                    0x00000004 */

/* #define _RPD12R_RPD12R_POSITION                  0x00000000 */
/* #define _RPD12R_RPD12R_MASK                      0x0000000F */
/* #define _RPD12R_RPD12R_LENGTH                    0x00000004 */

/* #define _RPD14R_RPD14R_POSITION                  0x00000000 */
/* #define _RPD14R_RPD14R_MASK                      0x0000000F */
/* #define _RPD14R_RPD14R_LENGTH                    0x00000004 */

/* #define _RPD15R_RPD15R_POSITION                  0x00000000 */
/* #define _RPD15R_RPD15R_MASK                      0x0000000F */
/* #define _RPD15R_RPD15R_LENGTH                    0x00000004 */

/* #define _RPE3R_RPE3R_POSITION                    0x00000000 */
/* #define _RPE3R_RPE3R_MASK                        0x0000000F */
/* #define _RPE3R_RPE3R_LENGTH                      0x00000004 */

/* #define _RPE5R_RPE5R_POSITION                    0x00000000 */
/* #define _RPE5R_RPE5R_MASK                        0x0000000F */
/* #define _RPE5R_RPE5R_LENGTH                      0x00000004 */

/* #define _RPE8R_RPE8R_POSITION                    0x00000000 */
/* #define _RPE8R_RPE8R_MASK                        0x0000000F */
/* #define _RPE8R_RPE8R_LENGTH                      0x00000004 */

/* #define _RPE9R_RPE9R_POSITION                    0x00000000 */
/* #define _RPE9R_RPE9R_MASK                        0x0000000F */
/* #define _RPE9R_RPE9R_LENGTH                      0x00000004 */

/* #define _RPF0R_RPF0R_POSITION                    0x00000000 */
/* #define _RPF0R_RPF0R_MASK                        0x0000000F */
/* #define _RPF0R_RPF0R_LENGTH                      0x00000004 */

/* #define _RPF1R_RPF1R_POSITION                    0x00000000 */
/* #define _RPF1R_RPF1R_MASK                        0x0000000F */
/* #define _RPF1R_RPF1R_LENGTH                      0x00000004 */

/* #define _RPF2R_RPF2R_POSITION                    0x00000000 */
/* #define _RPF2R_RPF2R_MASK                        0x0000000F */
/* #define _RPF2R_RPF2R_LENGTH                      0x00000004 */

/* #define _RPF3R_RPF3R_POSITION                    0x00000000 */
/* #define _RPF3R_RPF3R_MASK                        0x0000000F */
/* #define _RPF3R_RPF3R_LENGTH                      0x00000004 */

/* #define _RPF4R_RPF4R_POSITION                    0x00000000 */
/* #define _RPF4R_RPF4R_MASK                        0x0000000F */
/* #define _RPF4R_RPF4R_LENGTH                      0x00000004 */

/* #define _RPF5R_RPF5R_POSITION                    0x00000000 */
/* #define _RPF5R_RPF5R_MASK                        0x0000000F */
/* #define _RPF5R_RPF5R_LENGTH                      0x00000004 */

/* #define _RPF6R_RPF6R_POSITION                    0x00000000 */
/* #define _RPF6R_RPF6R_MASK                        0x0000000F */
/* #define _RPF6R_RPF6R_LENGTH                      0x00000004 */

/* #define _RPG6R_RPG6R_POSITION                    0x00000000 */
/* #define _RPG6R_RPG6R_MASK                        0x0000000F */
/* #define _RPG6R_RPG6R_LENGTH                      0x00000004 */

/* #define _RPG7R_RPG7R_POSITION                    0x00000000 */
/* #define _RPG7R_RPG7R_MASK                        0x0000000F */
/* #define _RPG7R_RPG7R_LENGTH                      0x00000004 */

/* #define _RPG8R_RPG8R_POSITION                    0x00000000 */
/* #define _RPG8R_RPG8R_MASK                        0x0000000F */
/* #define _RPG8R_RPG8R_LENGTH                      0x00000004 */

/* #define _RPG9R_RPG9R_POSITION                    0x00000000 */
/* #define _RPG9R_RPG9R_MASK                        0x0000000F */
/* #define _RPG9R_RPG9R_LENGTH                      0x00000004 */

/* #define _INTCON_INT0EP_POSITION                  0x00000000 */
/* #define _INTCON_INT0EP_MASK                      0x00000001 */
/* #define _INTCON_INT0EP_LENGTH                    0x00000001 */

