rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _INTCON_INT1EP_POSITION                  0x00000001 */
/* #define _INTCON_INT1EP_MASK                      0x00000002 */
/* #define _INTCON_INT1EP_LENGTH                    0x00000001 */

/* #define _INTCON_INT2EP_POSITION                  0x00000002 */
/* #define _INTCON_INT2EP_MASK                      0x00000004 */
/* #define _INTCON_INT2EP_LENGTH                    0x00000001 */

/* #define _INTCON_INT3EP_POSITION                  0x00000003 */
/* #define _INTCON_INT3EP_MASK                      0x00000008 */
/* #define _INTCON_INT3EP_LENGTH                    0x00000001 */

/* #define _INTCON_INT4EP_POSITION                  0x00000004 */
/* #define _INTCON_INT4EP_MASK                      0x00000010 */
/* #define _INTCON_INT4EP_LENGTH                    0x00000001 */

/* #define _INTCON_TPC_POSITION                     0x00000008 */
/* #define _INTCON_TPC_MASK                         0x00000700 */
/* #define _INTCON_TPC_LENGTH                       0x00000003 */

/* #define _INTCON_MVEC_POSITION                    0x0000000C */
/* #define _INTCON_MVEC_MASK                        0x00001000 */
/* #define _INTCON_MVEC_LENGTH                      0x00000001 */

/* #define _INTCON_SS0_POSITION                     0x00000010 */
/* #define _INTCON_SS0_MASK                         0x00010000 */
/* #define _INTCON_SS0_LENGTH                       0x00000001 */

/* #define _INTCON_w_POSITION                       0x00000000 */
/* #define _INTCON_w_MASK                           0xFFFFFFFF */
/* #define _INTCON_w_LENGTH                         0x00000020 */

/* #define _INTSTAT_VEC_POSITION                    0x00000000 */
/* #define _INTSTAT_VEC_MASK                        0x0000003F */
/* #define _INTSTAT_VEC_LENGTH                      0x00000006 */

/* #define _INTSTAT_SRIPL_POSITION                  0x00000008 */
/* #define _INTSTAT_SRIPL_MASK                      0x00000700 */
/* #define _INTSTAT_SRIPL_LENGTH                    0x00000003 */

/* #define _IFS0_CTIF_POSITION                      0x00000000 */
/* #define _IFS0_CTIF_MASK                          0x00000001 */
/* #define _IFS0_CTIF_LENGTH                        0x00000001 */

/* #define _IFS0_CS0IF_POSITION                     0x00000001 */
/* #define _IFS0_CS0IF_MASK                         0x00000002 */
/* #define _IFS0_CS0IF_LENGTH                       0x00000001 */

/* #define _IFS0_CS1IF_POSITION                     0x00000002 */
/* #define _IFS0_CS1IF_MASK                         0x00000004 */
/* #define _IFS0_CS1IF_LENGTH                       0x00000001 */

/* #define _IFS0_INT0IF_POSITION                    0x00000003 */
/* #define _IFS0_INT0IF_MASK                        0x00000008 */
/* #define _IFS0_INT0IF_LENGTH                      0x00000001 */

/* #define _IFS0_T1IF_POSITION                      0x00000004 */
/* #define _IFS0_T1IF_MASK                          0x00000010 */
/* #define _IFS0_T1IF_LENGTH                        0x00000001 */

/* #define _IFS0_IC1EIF_POSITION                    0x00000005 */
/* #define _IFS0_IC1EIF_MASK                        0x00000020 */
/* #define _IFS0_IC1EIF_LENGTH                      0x00000001 */

/* #define _IFS0_IC1IF_POSITION                     0x00000006 */
/* #define _IFS0_IC1IF_MASK                         0x00000040 */
/* #define _IFS0_IC1IF_LENGTH                       0x00000001 */

/* #define _IFS0_OC1IF_POSITION                     0x00000007 */
/* #define _IFS0_OC1IF_MASK                         0x00000080 */
/* #define _IFS0_OC1IF_LENGTH                       0x00000001 */

/* #define _IFS0_INT1IF_POSITION                    0x00000008 */
/* #define _IFS0_INT1IF_MASK                        0x00000100 */
/* #define _IFS0_INT1IF_LENGTH                      0x00000001 */

/* #define _IFS0_T2IF_POSITION                      0x00000009 */
/* #define _IFS0_T2IF_MASK                          0x00000200 */
/* #define _IFS0_T2IF_LENGTH                        0x00000001 */

/* #define _IFS0_IC2EIF_POSITION                    0x0000000A */
/* #define _IFS0_IC2EIF_MASK                        0x00000400 */
/* #define _IFS0_IC2EIF_LENGTH                      0x00000001 */

/* #define _IFS0_IC2IF_POSITION                     0x0000000B */
/* #define _IFS0_IC2IF_MASK                         0x00000800 */
/* #define _IFS0_IC2IF_LENGTH                       0x00000001 */

/* #define _IFS0_OC2IF_POSITION                     0x0000000C */
/* #define _IFS0_OC2IF_MASK                         0x00001000 */
/* #define _IFS0_OC2IF_LENGTH                       0x00000001 */

/* #define _IFS0_INT2IF_POSITION                    0x0000000D */
/* #define _IFS0_INT2IF_MASK                        0x00002000 */
/* #define _IFS0_INT2IF_LENGTH                      0x00000001 */

/* #define _IFS0_T3IF_POSITION                      0x0000000E */
/* #define _IFS0_T3IF_MASK                          0x00004000 */
/* #define _IFS0_T3IF_LENGTH                        0x00000001 */

/* #define _IFS0_IC3EIF_POSITION                    0x0000000F */
/* #define _IFS0_IC3EIF_MASK                        0x00008000 */
/* #define _IFS0_IC3EIF_LENGTH                      0x00000001 */

/* #define _IFS0_IC3IF_POSITION                     0x00000010 */
/* #define _IFS0_IC3IF_MASK                         0x00010000 */
/* #define _IFS0_IC3IF_LENGTH                       0x00000001 */

/* #define _IFS0_OC3IF_POSITION                     0x00000011 */
/* #define _IFS0_OC3IF_MASK                         0x00020000 */
/* #define _IFS0_OC3IF_LENGTH                       0x00000001 */

/* #define _IFS0_INT3IF_POSITION                    0x00000012 */
/* #define _IFS0_INT3IF_MASK                        0x00040000 */
/* #define _IFS0_INT3IF_LENGTH                      0x00000001 */

/* #define _IFS0_T4IF_POSITION                      0x00000013 */
/* #define _IFS0_T4IF_MASK                          0x00080000 */
/* #define _IFS0_T4IF_LENGTH                        0x00000001 */

/* #define _IFS0_IC4EIF_POSITION                    0x00000014 */
/* #define _IFS0_IC4EIF_MASK                        0x00100000 */
/* #define _IFS0_IC4EIF_LENGTH                      0x00000001 */

/* #define _IFS0_IC4IF_POSITION                     0x00000015 */
/* #define _IFS0_IC4IF_MASK                         0x00200000 */
/* #define _IFS0_IC4IF_LENGTH                       0x00000001 */

/* #define _IFS0_OC4IF_POSITION                     0x00000016 */
/* #define _IFS0_OC4IF_MASK                         0x00400000 */
/* #define _IFS0_OC4IF_LENGTH                       0x00000001 */

/* #define _IFS0_INT4IF_POSITION                    0x00000017 */
/* #define _IFS0_INT4IF_MASK                        0x00800000 */
/* #define _IFS0_INT4IF_LENGTH                      0x00000001 */

/* #define _IFS0_T5IF_POSITION                      0x00000018 */
/* #define _IFS0_T5IF_MASK                          0x01000000 */
/* #define _IFS0_T5IF_LENGTH                        0x00000001 */

/* #define _IFS0_IC5EIF_POSITION                    0x00000019 */
/* #define _IFS0_IC5EIF_MASK                        0x02000000 */
/* #define _IFS0_IC5EIF_LENGTH                      0x00000001 */

/* #define _IFS0_IC5IF_POSITION                     0x0000001A */
/* #define _IFS0_IC5IF_MASK                         0x04000000 */
/* #define _IFS0_IC5IF_LENGTH                       0x00000001 */

/* #define _IFS0_OC5IF_POSITION                     0x0000001B */
/* #define _IFS0_OC5IF_MASK                         0x08000000 */
/* #define _IFS0_OC5IF_LENGTH                       0x00000001 */

/* #define _IFS0_AD1IF_POSITION                     0x0000001C */
/* #define _IFS0_AD1IF_MASK                         0x10000000 */
/* #define _IFS0_AD1IF_LENGTH                       0x00000001 */

/* #define _IFS0_FSCMIF_POSITION                    0x0000001D */
/* #define _IFS0_FSCMIF_MASK                        0x20000000 */
/* #define _IFS0_FSCMIF_LENGTH                      0x00000001 */

/* #define _IFS0_RTCCIF_POSITION                    0x0000001E */
/* #define _IFS0_RTCCIF_MASK                        0x40000000 */
/* #define _IFS0_RTCCIF_LENGTH                      0x00000001 */

/* #define _IFS0_FCEIF_POSITION                     0x0000001F */
/* #define _IFS0_FCEIF_MASK                         0x80000000 */
/* #define _IFS0_FCEIF_LENGTH                       0x00000001 */

/* #define _IFS0_w_POSITION                         0x00000000 */
/* #define _IFS0_w_MASK                             0xFFFFFFFF */
/* #define _IFS0_w_LENGTH                           0x00000020 */

/* #define _IFS1_CMP1IF_POSITION                    0x00000000 */
/* #define _IFS1_CMP1IF_MASK                        0x00000001 */
/* #define _IFS1_CMP1IF_LENGTH                      0x00000001 */

/* #define _IFS1_CMP2IF_POSITION                    0x00000001 */
/* #define _IFS1_CMP2IF_MASK                        0x00000002 */
/* #define _IFS1_CMP2IF_LENGTH                      0x00000001 */

