rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _IFS1_USBIF_POSITION                     0x00000002 */
/* #define _IFS1_USBIF_MASK                         0x00000004 */
/* #define _IFS1_USBIF_LENGTH                       0x00000001 */

/* #define _IFS1_SPI1EIF_POSITION                   0x00000003 */
/* #define _IFS1_SPI1EIF_MASK                       0x00000008 */
/* #define _IFS1_SPI1EIF_LENGTH                     0x00000001 */

/* #define _IFS1_SPI1RXIF_POSITION                  0x00000004 */
/* #define _IFS1_SPI1RXIF_MASK                      0x00000010 */
/* #define _IFS1_SPI1RXIF_LENGTH                    0x00000001 */

/* #define _IFS1_SPI1TXIF_POSITION                  0x00000005 */
/* #define _IFS1_SPI1TXIF_MASK                      0x00000020 */
/* #define _IFS1_SPI1TXIF_LENGTH                    0x00000001 */

/* #define _IFS1_U1EIF_POSITION                     0x00000006 */
/* #define _IFS1_U1EIF_MASK                         0x00000040 */
/* #define _IFS1_U1EIF_LENGTH                       0x00000001 */

/* #define _IFS1_U1RXIF_POSITION                    0x00000007 */
/* #define _IFS1_U1RXIF_MASK                        0x00000080 */
/* #define _IFS1_U1RXIF_LENGTH                      0x00000001 */

/* #define _IFS1_U1TXIF_POSITION                    0x00000008 */
/* #define _IFS1_U1TXIF_MASK                        0x00000100 */
/* #define _IFS1_U1TXIF_LENGTH                      0x00000001 */

/* #define _IFS1_I2C1BIF_POSITION                   0x00000009 */
/* #define _IFS1_I2C1BIF_MASK                       0x00000200 */
/* #define _IFS1_I2C1BIF_LENGTH                     0x00000001 */

/* #define _IFS1_I2C1SIF_POSITION                   0x0000000A */
/* #define _IFS1_I2C1SIF_MASK                       0x00000400 */
/* #define _IFS1_I2C1SIF_LENGTH                     0x00000001 */

/* #define _IFS1_I2C1MIF_POSITION                   0x0000000B */
/* #define _IFS1_I2C1MIF_MASK                       0x00000800 */
/* #define _IFS1_I2C1MIF_LENGTH                     0x00000001 */

/* #define _IFS1_CNAIF_POSITION                     0x0000000C */
/* #define _IFS1_CNAIF_MASK                         0x00001000 */
/* #define _IFS1_CNAIF_LENGTH                       0x00000001 */

/* #define _IFS1_CNBIF_POSITION                     0x0000000D */
/* #define _IFS1_CNBIF_MASK                         0x00002000 */
/* #define _IFS1_CNBIF_LENGTH                       0x00000001 */

/* #define _IFS1_CNCIF_POSITION                     0x0000000E */
/* #define _IFS1_CNCIF_MASK                         0x00004000 */
/* #define _IFS1_CNCIF_LENGTH                       0x00000001 */

/* #define _IFS1_CNDIF_POSITION                     0x0000000F */
/* #define _IFS1_CNDIF_MASK                         0x00008000 */
/* #define _IFS1_CNDIF_LENGTH                       0x00000001 */

/* #define _IFS1_CNEIF_POSITION                     0x00000010 */
/* #define _IFS1_CNEIF_MASK                         0x00010000 */
/* #define _IFS1_CNEIF_LENGTH                       0x00000001 */

/* #define _IFS1_CNFIF_POSITION                     0x00000011 */
/* #define _IFS1_CNFIF_MASK                         0x00020000 */
/* #define _IFS1_CNFIF_LENGTH                       0x00000001 */

/* #define _IFS1_CNGIF_POSITION                     0x00000012 */
/* #define _IFS1_CNGIF_MASK                         0x00040000 */
/* #define _IFS1_CNGIF_LENGTH                       0x00000001 */

/* #define _IFS1_PMPIF_POSITION                     0x00000013 */
/* #define _IFS1_PMPIF_MASK                         0x00080000 */
/* #define _IFS1_PMPIF_LENGTH                       0x00000001 */

/* #define _IFS1_PMPEIF_POSITION                    0x00000014 */
/* #define _IFS1_PMPEIF_MASK                        0x00100000 */
/* #define _IFS1_PMPEIF_LENGTH                      0x00000001 */

/* #define _IFS1_SPI2EIF_POSITION                   0x00000015 */
/* #define _IFS1_SPI2EIF_MASK                       0x00200000 */
/* #define _IFS1_SPI2EIF_LENGTH                     0x00000001 */

/* #define _IFS1_SPI2RXIF_POSITION                  0x00000016 */
/* #define _IFS1_SPI2RXIF_MASK                      0x00400000 */
/* #define _IFS1_SPI2RXIF_LENGTH                    0x00000001 */

/* #define _IFS1_SPI2TXIF_POSITION                  0x00000017 */
/* #define _IFS1_SPI2TXIF_MASK                      0x00800000 */
/* #define _IFS1_SPI2TXIF_LENGTH                    0x00000001 */

/* #define _IFS1_U2EIF_POSITION                     0x00000018 */
/* #define _IFS1_U2EIF_MASK                         0x01000000 */
/* #define _IFS1_U2EIF_LENGTH                       0x00000001 */

/* #define _IFS1_U2RXIF_POSITION                    0x00000019 */
/* #define _IFS1_U2RXIF_MASK                        0x02000000 */
/* #define _IFS1_U2RXIF_LENGTH                      0x00000001 */

/* #define _IFS1_U2TXIF_POSITION                    0x0000001A */
/* #define _IFS1_U2TXIF_MASK                        0x04000000 */
/* #define _IFS1_U2TXIF_LENGTH                      0x00000001 */

/* #define _IFS1_I2C2BIF_POSITION                   0x0000001B */
/* #define _IFS1_I2C2BIF_MASK                       0x08000000 */
/* #define _IFS1_I2C2BIF_LENGTH                     0x00000001 */

/* #define _IFS1_I2C2SIF_POSITION                   0x0000001C */
/* #define _IFS1_I2C2SIF_MASK                       0x10000000 */
/* #define _IFS1_I2C2SIF_LENGTH                     0x00000001 */

/* #define _IFS1_I2C2MIF_POSITION                   0x0000001D */
/* #define _IFS1_I2C2MIF_MASK                       0x20000000 */
/* #define _IFS1_I2C2MIF_LENGTH                     0x00000001 */

/* #define _IFS1_U3EIF_POSITION                     0x0000001E */
/* #define _IFS1_U3EIF_MASK                         0x40000000 */
/* #define _IFS1_U3EIF_LENGTH                       0x00000001 */

/* #define _IFS1_U3RXIF_POSITION                    0x0000001F */
/* #define _IFS1_U3RXIF_MASK                        0x80000000 */
/* #define _IFS1_U3RXIF_LENGTH                      0x00000001 */

/* #define _IFS1_w_POSITION                         0x00000000 */
/* #define _IFS1_w_MASK                             0xFFFFFFFF */
/* #define _IFS1_w_LENGTH                           0x00000020 */

/* #define _IFS2_U3TXIF_POSITION                    0x00000000 */
/* #define _IFS2_U3TXIF_MASK                        0x00000001 */
/* #define _IFS2_U3TXIF_LENGTH                      0x00000001 */

