rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _IEC0_IC5EIE_POSITION                    0x00000019 */
/* #define _IEC0_IC5EIE_MASK                        0x02000000 */
/* #define _IEC0_IC5EIE_LENGTH                      0x00000001 */

/* #define _IEC0_IC5IE_POSITION                     0x0000001A */
/* #define _IEC0_IC5IE_MASK                         0x04000000 */
/* #define _IEC0_IC5IE_LENGTH                       0x00000001 */

/* #define _IEC0_OC5IE_POSITION                     0x0000001B */
/* #define _IEC0_OC5IE_MASK                         0x08000000 */
/* #define _IEC0_OC5IE_LENGTH                       0x00000001 */

/* #define _IEC0_AD1IE_POSITION                     0x0000001C */
/* #define _IEC0_AD1IE_MASK                         0x10000000 */
/* #define _IEC0_AD1IE_LENGTH                       0x00000001 */

/* #define _IEC0_FSCMIE_POSITION                    0x0000001D */
/* #define _IEC0_FSCMIE_MASK                        0x20000000 */
/* #define _IEC0_FSCMIE_LENGTH                      0x00000001 */

/* #define _IEC0_RTCCIE_POSITION                    0x0000001E */
/* #define _IEC0_RTCCIE_MASK                        0x40000000 */
/* #define _IEC0_RTCCIE_LENGTH                      0x00000001 */

/* #define _IEC0_FCEIE_POSITION                     0x0000001F */
/* #define _IEC0_FCEIE_MASK                         0x80000000 */
/* #define _IEC0_FCEIE_LENGTH                       0x00000001 */

/* #define _IEC0_w_POSITION                         0x00000000 */
/* #define _IEC0_w_MASK                             0xFFFFFFFF */
/* #define _IEC0_w_LENGTH                           0x00000020 */

/* #define _IEC1_CMP1IE_POSITION                    0x00000000 */
/* #define _IEC1_CMP1IE_MASK                        0x00000001 */
/* #define _IEC1_CMP1IE_LENGTH                      0x00000001 */

/* #define _IEC1_CMP2IE_POSITION                    0x00000001 */
/* #define _IEC1_CMP2IE_MASK                        0x00000002 */
/* #define _IEC1_CMP2IE_LENGTH                      0x00000001 */

/* #define _IEC1_USBIE_POSITION                     0x00000002 */
/* #define _IEC1_USBIE_MASK                         0x00000004 */
/* #define _IEC1_USBIE_LENGTH                       0x00000001 */

/* #define _IEC1_SPI1EIE_POSITION                   0x00000003 */
/* #define _IEC1_SPI1EIE_MASK                       0x00000008 */
/* #define _IEC1_SPI1EIE_LENGTH                     0x00000001 */

/* #define _IEC1_SPI1RXIE_POSITION                  0x00000004 */
/* #define _IEC1_SPI1RXIE_MASK                      0x00000010 */
/* #define _IEC1_SPI1RXIE_LENGTH                    0x00000001 */

/* #define _IEC1_SPI1TXIE_POSITION                  0x00000005 */
/* #define _IEC1_SPI1TXIE_MASK                      0x00000020 */
/* #define _IEC1_SPI1TXIE_LENGTH                    0x00000001 */

/* #define _IEC1_U1EIE_POSITION                     0x00000006 */
/* #define _IEC1_U1EIE_MASK                         0x00000040 */
/* #define _IEC1_U1EIE_LENGTH                       0x00000001 */

/* #define _IEC1_U1RXIE_POSITION                    0x00000007 */
/* #define _IEC1_U1RXIE_MASK                        0x00000080 */
/* #define _IEC1_U1RXIE_LENGTH                      0x00000001 */

/* #define _IEC1_U1TXIE_POSITION                    0x00000008 */
/* #define _IEC1_U1TXIE_MASK                        0x00000100 */
/* #define _IEC1_U1TXIE_LENGTH                      0x00000001 */

/* #define _IEC1_I2C1BIE_POSITION                   0x00000009 */
/* #define _IEC1_I2C1BIE_MASK                       0x00000200 */
/* #define _IEC1_I2C1BIE_LENGTH                     0x00000001 */

/* #define _IEC1_I2C1SIE_POSITION                   0x0000000A */
/* #define _IEC1_I2C1SIE_MASK                       0x00000400 */
/* #define _IEC1_I2C1SIE_LENGTH                     0x00000001 */

/* #define _IEC1_I2C1MIE_POSITION                   0x0000000B */
/* #define _IEC1_I2C1MIE_MASK                       0x00000800 */
/* #define _IEC1_I2C1MIE_LENGTH                     0x00000001 */

/* #define _IEC1_CNAIE_POSITION                     0x0000000C */
/* #define _IEC1_CNAIE_MASK                         0x00001000 */
/* #define _IEC1_CNAIE_LENGTH                       0x00000001 */

/* #define _IEC1_CNBIE_POSITION                     0x0000000D */
/* #define _IEC1_CNBIE_MASK                         0x00002000 */
/* #define _IEC1_CNBIE_LENGTH                       0x00000001 */

/* #define _IEC1_CNCIE_POSITION                     0x0000000E */
/* #define _IEC1_CNCIE_MASK                         0x00004000 */
/* #define _IEC1_CNCIE_LENGTH                       0x00000001 */

/* #define _IEC1_CNDIE_POSITION                     0x0000000F */
/* #define _IEC1_CNDIE_MASK                         0x00008000 */
/* #define _IEC1_CNDIE_LENGTH                       0x00000001 */

/* #define _IEC1_CNEIE_POSITION                     0x00000010 */
/* #define _IEC1_CNEIE_MASK                         0x00010000 */
/* #define _IEC1_CNEIE_LENGTH                       0x00000001 */

/* #define _IEC1_CNFIE_POSITION                     0x00000011 */
/* #define _IEC1_CNFIE_MASK                         0x00020000 */
/* #define _IEC1_CNFIE_LENGTH                       0x00000001 */

/* #define _IEC1_CNGIE_POSITION                     0x00000012 */
/* #define _IEC1_CNGIE_MASK                         0x00040000 */
/* #define _IEC1_CNGIE_LENGTH                       0x00000001 */

/* #define _IEC1_PMPIE_POSITION                     0x00000013 */
/* #define _IEC1_PMPIE_MASK                         0x00080000 */
/* #define _IEC1_PMPIE_LENGTH                       0x00000001 */

/* #define _IEC1_PMPEIE_POSITION                    0x00000014 */
/* #define _IEC1_PMPEIE_MASK                        0x00100000 */
/* #define _IEC1_PMPEIE_LENGTH                      0x00000001 */

/* #define _IEC1_SPI2EIE_POSITION                   0x00000015 */
/* #define _IEC1_SPI2EIE_MASK                       0x00200000 */
/* #define _IEC1_SPI2EIE_LENGTH                     0x00000001 */

/* #define _IEC1_SPI2RXIE_POSITION                  0x00000016 */
/* #define _IEC1_SPI2RXIE_MASK                      0x00400000 */
/* #define _IEC1_SPI2RXIE_LENGTH                    0x00000001 */

/* #define _IEC1_SPI2TXIE_POSITION                  0x00000017 */
/* #define _IEC1_SPI2TXIE_MASK                      0x00800000 */
/* #define _IEC1_SPI2TXIE_LENGTH                    0x00000001 */

/* #define _IEC1_U2EIE_POSITION                     0x00000018 */
/* #define _IEC1_U2EIE_MASK                         0x01000000 */
/* #define _IEC1_U2EIE_LENGTH                       0x00000001 */

