rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _IEC1_U2RXIE_POSITION                    0x00000019 */
/* #define _IEC1_U2RXIE_MASK                        0x02000000 */
/* #define _IEC1_U2RXIE_LENGTH                      0x00000001 */

/* #define _IEC1_U2TXIE_POSITION                    0x0000001A */
/* #define _IEC1_U2TXIE_MASK                        0x04000000 */
/* #define _IEC1_U2TXIE_LENGTH                      0x00000001 */

/* #define _IEC1_I2C2BIE_POSITION                   0x0000001B */
/* #define _IEC1_I2C2BIE_MASK                       0x08000000 */
/* #define _IEC1_I2C2BIE_LENGTH                     0x00000001 */

/* #define _IEC1_I2C2SIE_POSITION                   0x0000001C */
/* #define _IEC1_I2C2SIE_MASK                       0x10000000 */
/* #define _IEC1_I2C2SIE_LENGTH                     0x00000001 */

/* #define _IEC1_I2CMIE_POSITION                    0x0000001D */
/* #define _IEC1_I2CMIE_MASK                        0x20000000 */
/* #define _IEC1_I2CMIE_LENGTH                      0x00000001 */

/* #define _IEC1_U3EIE_POSITION                     0x0000001E */
/* #define _IEC1_U3EIE_MASK                         0x40000000 */
/* #define _IEC1_U3EIE_LENGTH                       0x00000001 */

/* #define _IEC1_U3RXIE_POSITION                    0x0000001F */
/* #define _IEC1_U3RXIE_MASK                        0x80000000 */
/* #define _IEC1_U3RXIE_LENGTH                      0x00000001 */

/* #define _IEC1_w_POSITION                         0x00000000 */
/* #define _IEC1_w_MASK                             0xFFFFFFFF */
/* #define _IEC1_w_LENGTH                           0x00000020 */

/* #define _IEC2_U3TXIE_POSITION                    0x00000000 */
/* #define _IEC2_U3TXIE_MASK                        0x00000001 */
/* #define _IEC2_U3TXIE_LENGTH                      0x00000001 */

/* #define _IEC2_U4EIE_POSITION                     0x00000001 */
/* #define _IEC2_U4EIE_MASK                         0x00000002 */
/* #define _IEC2_U4EIE_LENGTH                       0x00000001 */

/* #define _IEC2_U4RXIE_POSITION                    0x00000002 */
/* #define _IEC2_U4RXIE_MASK                        0x00000004 */
/* #define _IEC2_U4RXIE_LENGTH                      0x00000001 */

/* #define _IEC2_U4TXIE_POSITION                    0x00000003 */
/* #define _IEC2_U4TXIE_MASK                        0x00000008 */
/* #define _IEC2_U4TXIE_LENGTH                      0x00000001 */

/* #define _IEC2_CTMUIE_POSITION                    0x00000007 */
/* #define _IEC2_CTMUIE_MASK                        0x00000080 */
/* #define _IEC2_CTMUIE_LENGTH                      0x00000001 */

/* #define _IEC2_DMA0IE_POSITION                    0x00000008 */
/* #define _IEC2_DMA0IE_MASK                        0x00000100 */
/* #define _IEC2_DMA0IE_LENGTH                      0x00000001 */

/* #define _IEC2_DMA1IE_POSITION                    0x00000009 */
/* #define _IEC2_DMA1IE_MASK                        0x00000200 */
/* #define _IEC2_DMA1IE_LENGTH                      0x00000001 */

/* #define _IEC2_DMA2IE_POSITION                    0x0000000A */
/* #define _IEC2_DMA2IE_MASK                        0x00000400 */
/* #define _IEC2_DMA2IE_LENGTH                      0x00000001 */

/* #define _IEC2_DMA3IE_POSITION                    0x0000000B */
/* #define _IEC2_DMA3IE_MASK                        0x00000800 */
/* #define _IEC2_DMA3IE_LENGTH                      0x00000001 */

/* #define _IPC0_CTIS_POSITION                      0x00000000 */
/* #define _IPC0_CTIS_MASK                          0x00000003 */
/* #define _IPC0_CTIS_LENGTH                        0x00000002 */

/* #define _IPC0_CTIP_POSITION                      0x00000002 */
/* #define _IPC0_CTIP_MASK                          0x0000001C */
/* #define _IPC0_CTIP_LENGTH                        0x00000003 */

/* #define _IPC0_CS0IS_POSITION                     0x00000008 */
/* #define _IPC0_CS0IS_MASK                         0x00000300 */
/* #define _IPC0_CS0IS_LENGTH                       0x00000002 */

/* #define _IPC0_CS0IP_POSITION                     0x0000000A */
/* #define _IPC0_CS0IP_MASK                         0x00001C00 */
/* #define _IPC0_CS0IP_LENGTH                       0x00000003 */

/* #define _IPC0_CS1IS_POSITION                     0x00000010 */
/* #define _IPC0_CS1IS_MASK                         0x00030000 */
/* #define _IPC0_CS1IS_LENGTH                       0x00000002 */

/* #define _IPC0_CS1IP_POSITION                     0x00000012 */
/* #define _IPC0_CS1IP_MASK                         0x001C0000 */
/* #define _IPC0_CS1IP_LENGTH                       0x00000003 */

/* #define _IPC0_INT0IS_POSITION                    0x00000018 */
/* #define _IPC0_INT0IS_MASK                        0x03000000 */
/* #define _IPC0_INT0IS_LENGTH                      0x00000002 */

/* #define _IPC0_INT0IP_POSITION                    0x0000001A */
/* #define _IPC0_INT0IP_MASK                        0x1C000000 */
/* #define _IPC0_INT0IP_LENGTH                      0x00000003 */

/* #define _IPC0_w_POSITION                         0x00000000 */
/* #define _IPC0_w_MASK                             0xFFFFFFFF */
/* #define _IPC0_w_LENGTH                           0x00000020 */

/* #define _IPC1_T1IS_POSITION                      0x00000000 */
/* #define _IPC1_T1IS_MASK                          0x00000003 */
/* #define _IPC1_T1IS_LENGTH                        0x00000002 */

/* #define _IPC1_T1IP_POSITION                      0x00000002 */
/* #define _IPC1_T1IP_MASK                          0x0000001C */
/* #define _IPC1_T1IP_LENGTH                        0x00000003 */

/* #define _IPC1_IC1IS_POSITION                     0x00000008 */
/* #define _IPC1_IC1IS_MASK                         0x00000300 */
/* #define _IPC1_IC1IS_LENGTH                       0x00000002 */

/* #define _IPC1_IC1IP_POSITION                     0x0000000A */
/* #define _IPC1_IC1IP_MASK                         0x00001C00 */
/* #define _IPC1_IC1IP_LENGTH                       0x00000003 */

/* #define _IPC1_OC1IS_POSITION                     0x00000010 */
/* #define _IPC1_OC1IS_MASK                         0x00030000 */
/* #define _IPC1_OC1IS_LENGTH                       0x00000002 */

/* #define _IPC1_OC1IP_POSITION                     0x00000012 */
/* #define _IPC1_OC1IP_MASK                         0x001C0000 */
/* #define _IPC1_OC1IP_LENGTH                       0x00000003 */

/* #define _IPC1_INT1IS_POSITION                    0x00000018 */
/* #define _IPC1_INT1IS_MASK                        0x03000000 */
/* #define _IPC1_INT1IS_LENGTH                      0x00000002 */

/* #define _IPC1_INT1IP_POSITION                    0x0000001A */
/* #define _IPC1_INT1IP_MASK                        0x1C000000 */
/* #define _IPC1_INT1IP_LENGTH                      0x00000003 */

/* #define _IPC1_w_POSITION                         0x00000000 */
/* #define _IPC1_w_MASK                             0xFFFFFFFF */
/* #define _IPC1_w_LENGTH                           0x00000020 */

/* #define _IPC2_T2IS_POSITION                      0x00000000 */
/* #define _IPC2_T2IS_MASK                          0x00000003 */
/* #define _IPC2_T2IS_LENGTH                        0x00000002 */

/* #define _IPC2_T2IP_POSITION                      0x00000002 */
/* #define _IPC2_T2IP_MASK                          0x0000001C */
/* #define _IPC2_T2IP_LENGTH                        0x00000003 */

/* #define _IPC2_IC2IS_POSITION                     0x00000008 */
/* #define _IPC2_IC2IS_MASK                         0x00000300 */
/* #define _IPC2_IC2IS_LENGTH                       0x00000002 */

/* #define _IPC2_IC2IP_POSITION                     0x0000000A */
/* #define _IPC2_IC2IP_MASK                         0x00001C00 */
/* #define _IPC2_IC2IP_LENGTH                       0x00000003 */

/* #define _IPC2_OC2IS_POSITION                     0x00000010 */
/* #define _IPC2_OC2IS_MASK                         0x00030000 */
/* #define _IPC2_OC2IS_LENGTH                       0x00000002 */

