rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _IPC2_OC2IP_POSITION                     0x00000012 */
/* #define _IPC2_OC2IP_MASK                         0x001C0000 */
/* #define _IPC2_OC2IP_LENGTH                       0x00000003 */

/* #define _IPC2_INT2IS_POSITION                    0x00000018 */
/* #define _IPC2_INT2IS_MASK                        0x03000000 */
/* #define _IPC2_INT2IS_LENGTH                      0x00000002 */

/* #define _IPC2_INT2IP_POSITION                    0x0000001A */
/* #define _IPC2_INT2IP_MASK                        0x1C000000 */
/* #define _IPC2_INT2IP_LENGTH                      0x00000003 */

/* #define _IPC2_w_POSITION                         0x00000000 */
/* #define _IPC2_w_MASK                             0xFFFFFFFF */
/* #define _IPC2_w_LENGTH                           0x00000020 */

/* #define _IPC3_T3IS_POSITION                      0x00000000 */
/* #define _IPC3_T3IS_MASK                          0x00000003 */
/* #define _IPC3_T3IS_LENGTH                        0x00000002 */

/* #define _IPC3_T3IP_POSITION                      0x00000002 */
/* #define _IPC3_T3IP_MASK                          0x0000001C */
/* #define _IPC3_T3IP_LENGTH                        0x00000003 */

/* #define _IPC3_IC3IS_POSITION                     0x00000008 */
/* #define _IPC3_IC3IS_MASK                         0x00000300 */
/* #define _IPC3_IC3IS_LENGTH                       0x00000002 */

/* #define _IPC3_IC3IP_POSITION                     0x0000000A */
/* #define _IPC3_IC3IP_MASK                         0x00001C00 */
/* #define _IPC3_IC3IP_LENGTH                       0x00000003 */

/* #define _IPC3_OC3IS_POSITION                     0x00000010 */
/* #define _IPC3_OC3IS_MASK                         0x00030000 */
/* #define _IPC3_OC3IS_LENGTH                       0x00000002 */

/* #define _IPC3_OC3IP_POSITION                     0x00000012 */
/* #define _IPC3_OC3IP_MASK                         0x001C0000 */
/* #define _IPC3_OC3IP_LENGTH                       0x00000003 */

/* #define _IPC3_INT3IS_POSITION                    0x00000018 */
/* #define _IPC3_INT3IS_MASK                        0x03000000 */
/* #define _IPC3_INT3IS_LENGTH                      0x00000002 */

/* #define _IPC3_INT3IP_POSITION                    0x0000001A */
/* #define _IPC3_INT3IP_MASK                        0x1C000000 */
/* #define _IPC3_INT3IP_LENGTH                      0x00000003 */

/* #define _IPC3_w_POSITION                         0x00000000 */
/* #define _IPC3_w_MASK                             0xFFFFFFFF */
/* #define _IPC3_w_LENGTH                           0x00000020 */

/* #define _IPC4_T4IS_POSITION                      0x00000000 */
/* #define _IPC4_T4IS_MASK                          0x00000003 */
/* #define _IPC4_T4IS_LENGTH                        0x00000002 */

/* #define _IPC4_T4IP_POSITION                      0x00000002 */
/* #define _IPC4_T4IP_MASK                          0x0000001C */
/* #define _IPC4_T4IP_LENGTH                        0x00000003 */

/* #define _IPC4_IC4IS_POSITION                     0x00000008 */
/* #define _IPC4_IC4IS_MASK                         0x00000300 */
/* #define _IPC4_IC4IS_LENGTH                       0x00000002 */

/* #define _IPC4_IC4IP_POSITION                     0x0000000A */
/* #define _IPC4_IC4IP_MASK                         0x00001C00 */
/* #define _IPC4_IC4IP_LENGTH                       0x00000003 */

/* #define _IPC4_OC4IS_POSITION                     0x00000010 */
/* #define _IPC4_OC4IS_MASK                         0x00030000 */
/* #define _IPC4_OC4IS_LENGTH                       0x00000002 */

/* #define _IPC4_OC4IP_POSITION                     0x00000012 */
/* #define _IPC4_OC4IP_MASK                         0x001C0000 */
/* #define _IPC4_OC4IP_LENGTH                       0x00000003 */

/* #define _IPC4_INT4IS_POSITION                    0x00000018 */
/* #define _IPC4_INT4IS_MASK                        0x03000000 */
/* #define _IPC4_INT4IS_LENGTH                      0x00000002 */

/* #define _IPC4_INT4IP_POSITION                    0x0000001A */
/* #define _IPC4_INT4IP_MASK                        0x1C000000 */
/* #define _IPC4_INT4IP_LENGTH                      0x00000003 */

/* #define _IPC4_w_POSITION                         0x00000000 */
/* #define _IPC4_w_MASK                             0xFFFFFFFF */
/* #define _IPC4_w_LENGTH                           0x00000020 */

/* #define _IPC5_T5IS_POSITION                      0x00000000 */
/* #define _IPC5_T5IS_MASK                          0x00000003 */
/* #define _IPC5_T5IS_LENGTH                        0x00000002 */

/* #define _IPC5_T5IP_POSITION                      0x00000002 */
/* #define _IPC5_T5IP_MASK                          0x0000001C */
/* #define _IPC5_T5IP_LENGTH                        0x00000003 */

/* #define _IPC5_IC5IS_POSITION                     0x00000008 */
/* #define _IPC5_IC5IS_MASK                         0x00000300 */
/* #define _IPC5_IC5IS_LENGTH                       0x00000002 */

/* #define _IPC5_IC5IP_POSITION                     0x0000000A */
/* #define _IPC5_IC5IP_MASK                         0x00001C00 */
/* #define _IPC5_IC5IP_LENGTH                       0x00000003 */

/* #define _IPC5_OC5IS_POSITION                     0x00000010 */
/* #define _IPC5_OC5IS_MASK                         0x00030000 */
/* #define _IPC5_OC5IS_LENGTH                       0x00000002 */

/* #define _IPC5_OC5IP_POSITION                     0x00000012 */
/* #define _IPC5_OC5IP_MASK                         0x001C0000 */
/* #define _IPC5_OC5IP_LENGTH                       0x00000003 */

/* #define _IPC5_AD1IS_POSITION                     0x00000018 */
/* #define _IPC5_AD1IS_MASK                         0x03000000 */
/* #define _IPC5_AD1IS_LENGTH                       0x00000002 */

/* #define _IPC5_AD1IP_POSITION                     0x0000001A */
/* #define _IPC5_AD1IP_MASK                         0x1C000000 */
/* #define _IPC5_AD1IP_LENGTH                       0x00000003 */

/* #define _IPC5_w_POSITION                         0x00000000 */
/* #define _IPC5_w_MASK                             0xFFFFFFFF */
/* #define _IPC5_w_LENGTH                           0x00000020 */

