rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _IPC6_FSCMIS_POSITION                    0x00000000 */
/* #define _IPC6_FSCMIS_MASK                        0x00000003 */
/* #define _IPC6_FSCMIS_LENGTH                      0x00000002 */

/* #define _IPC6_FSCMIP_POSITION                    0x00000002 */
/* #define _IPC6_FSCMIP_MASK                        0x0000001C */
/* #define _IPC6_FSCMIP_LENGTH                      0x00000003 */

/* #define _IPC6_RTCCIS_POSITION                    0x00000008 */
/* #define _IPC6_RTCCIS_MASK                        0x00000300 */
/* #define _IPC6_RTCCIS_LENGTH                      0x00000002 */

/* #define _IPC6_RTCCIP_POSITION                    0x0000000A */
/* #define _IPC6_RTCCIP_MASK                        0x00001C00 */
/* #define _IPC6_RTCCIP_LENGTH                      0x00000003 */

/* #define _IPC6_FCEIS_POSITION                     0x00000010 */
/* #define _IPC6_FCEIS_MASK                         0x00030000 */
/* #define _IPC6_FCEIS_LENGTH                       0x00000002 */

/* #define _IPC6_FCEIP_POSITION                     0x00000012 */
/* #define _IPC6_FCEIP_MASK                         0x001C0000 */
/* #define _IPC6_FCEIP_LENGTH                       0x00000003 */

/* #define _IPC6_CMP1IS_POSITION                    0x00000018 */
/* #define _IPC6_CMP1IS_MASK                        0x03000000 */
/* #define _IPC6_CMP1IS_LENGTH                      0x00000002 */

/* #define _IPC6_CMP1IP_POSITION                    0x0000001A */
/* #define _IPC6_CMP1IP_MASK                        0x1C000000 */
/* #define _IPC6_CMP1IP_LENGTH                      0x00000003 */

/* #define _IPC6_w_POSITION                         0x00000000 */
/* #define _IPC6_w_MASK                             0xFFFFFFFF */
/* #define _IPC6_w_LENGTH                           0x00000020 */

/* #define _IPC7_CMP2IS_POSITION                    0x00000000 */
/* #define _IPC7_CMP2IS_MASK                        0x00000003 */
/* #define _IPC7_CMP2IS_LENGTH                      0x00000002 */

/* #define _IPC7_CMP2IP_POSITION                    0x00000002 */
/* #define _IPC7_CMP2IP_MASK                        0x0000001C */
/* #define _IPC7_CMP2IP_LENGTH                      0x00000003 */

/* #define _IPC7_USBIS_POSITION                     0x00000008 */
/* #define _IPC7_USBIS_MASK                         0x00000300 */
/* #define _IPC7_USBIS_LENGTH                       0x00000002 */

/* #define _IPC7_USBIP_POSITION                     0x0000000A */
/* #define _IPC7_USBIP_MASK                         0x00001C00 */
/* #define _IPC7_USBIP_LENGTH                       0x00000003 */

/* #define _IPC7_SPI1IS_POSITION                    0x00000010 */
/* #define _IPC7_SPI1IS_MASK                        0x00030000 */
/* #define _IPC7_SPI1IS_LENGTH                      0x00000002 */

/* #define _IPC7_SPI1IP_POSITION                    0x00000012 */
/* #define _IPC7_SPI1IP_MASK                        0x001C0000 */
/* #define _IPC7_SPI1IP_LENGTH                      0x00000003 */

/* #define _IPC7_U1IS_POSITION                      0x00000018 */
/* #define _IPC7_U1IS_MASK                          0x03000000 */
/* #define _IPC7_U1IS_LENGTH                        0x00000002 */

/* #define _IPC7_U1IP_POSITION                      0x0000001A */
/* #define _IPC7_U1IP_MASK                          0x1C000000 */
/* #define _IPC7_U1IP_LENGTH                        0x00000003 */

/* #define _IPC7_w_POSITION                         0x00000000 */
/* #define _IPC7_w_MASK                             0xFFFFFFFF */
/* #define _IPC7_w_LENGTH                           0x00000020 */

/* #define _IPC8_I2C1IS_POSITION                    0x00000000 */
/* #define _IPC8_I2C1IS_MASK                        0x00000003 */
/* #define _IPC8_I2C1IS_LENGTH                      0x00000002 */

/* #define _IPC8_I2C1IP_POSITION                    0x00000002 */
/* #define _IPC8_I2C1IP_MASK                        0x0000001C */
/* #define _IPC8_I2C1IP_LENGTH                      0x00000003 */

/* #define _IPC8_CNIS_POSITION                      0x00000008 */
/* #define _IPC8_CNIS_MASK                          0x00000300 */
/* #define _IPC8_CNIS_LENGTH                        0x00000002 */

/* #define _IPC8_CNIP_POSITION                      0x0000000A */
/* #define _IPC8_CNIP_MASK                          0x00001C00 */
/* #define _IPC8_CNIP_LENGTH                        0x00000003 */

/* #define _IPC8_PMPIS_POSITION                     0x00000010 */
/* #define _IPC8_PMPIS_MASK                         0x00030000 */
/* #define _IPC8_PMPIS_LENGTH                       0x00000002 */

/* #define _IPC8_PMPIP_POSITION                     0x00000012 */
/* #define _IPC8_PMPIP_MASK                         0x001C0000 */
/* #define _IPC8_PMPIP_LENGTH                       0x00000003 */

/* #define _IPC8_SPI2IS_POSITION                    0x00000018 */
/* #define _IPC8_SPI2IS_MASK                        0x03000000 */
/* #define _IPC8_SPI2IS_LENGTH                      0x00000002 */

/* #define _IPC8_SPI2IP_POSITION                    0x0000001A */
/* #define _IPC8_SPI2IP_MASK                        0x1C000000 */
/* #define _IPC8_SPI2IP_LENGTH                      0x00000003 */

/* #define _IPC8_w_POSITION                         0x00000000 */
/* #define _IPC8_w_MASK                             0xFFFFFFFF */
/* #define _IPC8_w_LENGTH                           0x00000020 */

/* #define _IPC9_U2IS_POSITION                      0x00000000 */
/* #define _IPC9_U2IS_MASK                          0x00000003 */
/* #define _IPC9_U2IS_LENGTH                        0x00000002 */

/* #define _IPC9_U2IP_POSITION                      0x00000002 */
/* #define _IPC9_U2IP_MASK                          0x0000001C */
/* #define _IPC9_U2IP_LENGTH                        0x00000003 */

/* #define _IPC9_I2C2IS_POSITION                    0x00000008 */
/* #define _IPC9_I2C2IS_MASK                        0x00000300 */
/* #define _IPC9_I2C2IS_LENGTH                      0x00000002 */

/* #define _IPC9_I2C2IP_POSITION                    0x0000000A */
/* #define _IPC9_I2C2IP_MASK                        0x00001C00 */
/* #define _IPC9_I2C2IP_LENGTH                      0x00000003 */

