rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _IPC9_U3IS_POSITION                      0x00000010 */
/* #define _IPC9_U3IS_MASK                          0x00030000 */
/* #define _IPC9_U3IS_LENGTH                        0x00000002 */

/* #define _IPC9_U3IP_POSITION                      0x00000012 */
/* #define _IPC9_U3IP_MASK                          0x001C0000 */
/* #define _IPC9_U3IP_LENGTH                        0x00000003 */

/* #define _IPC9_U4IS_POSITION                      0x00000018 */
/* #define _IPC9_U4IS_MASK                          0x03000000 */
/* #define _IPC9_U4IS_LENGTH                        0x00000002 */

/* #define _IPC9_U4IP_POSITION                      0x0000001A */
/* #define _IPC9_U4IP_MASK                          0x1C000000 */
/* #define _IPC9_U4IP_LENGTH                        0x00000003 */

/* #define _IPC9_w_POSITION                         0x00000000 */
/* #define _IPC9_w_MASK                             0xFFFFFFFF */
/* #define _IPC9_w_LENGTH                           0x00000020 */

/* #define _IPC10_CTMUIP_POSITION                   0x00000008 */
/* #define _IPC10_CTMUIP_MASK                       0x00000300 */
/* #define _IPC10_CTMUIP_LENGTH                     0x00000002 */

/* #define _IPC10_CTMUIS_POSITION                   0x0000000A */
/* #define _IPC10_CTMUIS_MASK                       0x00001C00 */
/* #define _IPC10_CTMUIS_LENGTH                     0x00000003 */

/* #define _IPC10_DMA0IS_POSITION                   0x00000010 */
/* #define _IPC10_DMA0IS_MASK                       0x00030000 */
/* #define _IPC10_DMA0IS_LENGTH                     0x00000002 */

/* #define _IPC10_DMA0IP_POSITION                   0x00000012 */
/* #define _IPC10_DMA0IP_MASK                       0x001C0000 */
/* #define _IPC10_DMA0IP_LENGTH                     0x00000003 */

/* #define _IPC10_DMA1IS_POSITION                   0x00000018 */
/* #define _IPC10_DMA1IS_MASK                       0x03000000 */
/* #define _IPC10_DMA1IS_LENGTH                     0x00000002 */

/* #define _IPC10_DMA1IP_POSITION                   0x0000001A */
/* #define _IPC10_DMA1IP_MASK                       0x1C000000 */
/* #define _IPC10_DMA1IP_LENGTH                     0x00000003 */

/* #define _IPC10_w_POSITION                        0x00000000 */
/* #define _IPC10_w_MASK                            0xFFFFFFFF */
/* #define _IPC10_w_LENGTH                          0x00000020 */

/* #define _IPC11_DMA2IS_POSITION                   0x00000000 */
/* #define _IPC11_DMA2IS_MASK                       0x00000003 */
/* #define _IPC11_DMA2IS_LENGTH                     0x00000002 */

/* #define _IPC11_DMA2IP_POSITION                   0x00000002 */
/* #define _IPC11_DMA2IP_MASK                       0x0000001C */
/* #define _IPC11_DMA2IP_LENGTH                     0x00000003 */

/* #define _IPC11_DMA3IS_POSITION                   0x00000008 */
/* #define _IPC11_DMA3IS_MASK                       0x00000300 */
/* #define _IPC11_DMA3IS_LENGTH                     0x00000002 */

/* #define _IPC11_DMA3IP_POSITION                   0x0000000A */
/* #define _IPC11_DMA3IP_MASK                       0x00001C00 */
/* #define _IPC11_DMA3IP_LENGTH                     0x00000003 */

/* #define _IPC11_w_POSITION                        0x00000000 */
/* #define _IPC11_w_MASK                            0xFFFFFFFF */
/* #define _IPC11_w_LENGTH                          0x00000020 */

/* #define _BMXCON_BMXARB_POSITION                  0x00000000 */
/* #define _BMXCON_BMXARB_MASK                      0x00000007 */
/* #define _BMXCON_BMXARB_LENGTH                    0x00000003 */

/* #define _BMXCON_BMXWSDRM_POSITION                0x00000006 */
/* #define _BMXCON_BMXWSDRM_MASK                    0x00000040 */
/* #define _BMXCON_BMXWSDRM_LENGTH                  0x00000001 */

/* #define _BMXCON_BMXERRIS_POSITION                0x00000010 */
/* #define _BMXCON_BMXERRIS_MASK                    0x00010000 */
/* #define _BMXCON_BMXERRIS_LENGTH                  0x00000001 */

/* #define _BMXCON_BMXERRDS_POSITION                0x00000011 */
/* #define _BMXCON_BMXERRDS_MASK                    0x00020000 */
/* #define _BMXCON_BMXERRDS_LENGTH                  0x00000001 */

/* #define _BMXCON_BMXERRDMA_POSITION               0x00000012 */
/* #define _BMXCON_BMXERRDMA_MASK                   0x00040000 */
/* #define _BMXCON_BMXERRDMA_LENGTH                 0x00000001 */

/* #define _BMXCON_BMXERRICD_POSITION               0x00000013 */
/* #define _BMXCON_BMXERRICD_MASK                   0x00080000 */
/* #define _BMXCON_BMXERRICD_LENGTH                 0x00000001 */

/* #define _BMXCON_BMXERRIXI_POSITION               0x00000014 */
/* #define _BMXCON_BMXERRIXI_MASK                   0x00100000 */
/* #define _BMXCON_BMXERRIXI_LENGTH                 0x00000001 */

/* #define _BMXCON_BMXCHEDMA_POSITION               0x0000001A */
/* #define _BMXCON_BMXCHEDMA_MASK                   0x04000000 */
/* #define _BMXCON_BMXCHEDMA_LENGTH                 0x00000001 */

/* #define _BMXCON_w_POSITION                       0x00000000 */
/* #define _BMXCON_w_MASK                           0xFFFFFFFF */
/* #define _BMXCON_w_LENGTH                         0x00000020 */

/* #define _DMACON_DMABUSY_POSITION                 0x0000000B */
/* #define _DMACON_DMABUSY_MASK                     0x00000800 */
/* #define _DMACON_DMABUSY_LENGTH                   0x00000001 */

/* #define _DMACON_SUSPEND_POSITION                 0x0000000C */
/* #define _DMACON_SUSPEND_MASK                     0x00001000 */
/* #define _DMACON_SUSPEND_LENGTH                   0x00000001 */

/* #define _DMACON_ON_POSITION                      0x0000000F */
/* #define _DMACON_ON_MASK                          0x00008000 */
/* #define _DMACON_ON_LENGTH                        0x00000001 */

/* #define _DMACON_w_POSITION                       0x00000000 */
/* #define _DMACON_w_MASK                           0xFFFFFFFF */
/* #define _DMACON_w_LENGTH                         0x00000020 */

/* #define _DMASTAT_DMACH_POSITION                  0x00000000 */
/* #define _DMASTAT_DMACH_MASK                      0x00000007 */
/* #define _DMASTAT_DMACH_LENGTH                    0x00000003 */

/* #define _DMASTAT_RDWR_POSITION                   0x00000003 */
/* #define _DMASTAT_RDWR_MASK                       0x00000008 */
/* #define _DMASTAT_RDWR_LENGTH                     0x00000001 */

/* #define _DMASTAT_w_POSITION                      0x00000000 */
/* #define _DMASTAT_w_MASK                          0xFFFFFFFF */
/* #define _DMASTAT_w_LENGTH                        0x00000020 */

/* #define _DCRCCON_CRCCH_POSITION                  0x00000000 */
/* #define _DCRCCON_CRCCH_MASK                      0x00000007 */
/* #define _DCRCCON_CRCCH_LENGTH                    0x00000003 */

/* #define _DCRCCON_CRCTYP_POSITION                 0x00000005 */
/* #define _DCRCCON_CRCTYP_MASK                     0x00000020 */
/* #define _DCRCCON_CRCTYP_LENGTH                   0x00000001 */

/* #define _DCRCCON_CRCAPP_POSITION                 0x00000006 */
/* #define _DCRCCON_CRCAPP_MASK                     0x00000040 */
/* #define _DCRCCON_CRCAPP_LENGTH                   0x00000001 */

