rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _DCH3INT_CHSDIE_POSITION                 0x00000017 */
/* #define _DCH3INT_CHSDIE_MASK                     0x00800000 */
/* #define _DCH3INT_CHSDIE_LENGTH                   0x00000001 */

/* #define _DCH3INT_w_POSITION                      0x00000000 */
/* #define _DCH3INT_w_MASK                          0xFFFFFFFF */
/* #define _DCH3INT_w_LENGTH                        0x00000020 */

/* #define _CHECON_PFMWS_POSITION                   0x00000000 */
/* #define _CHECON_PFMWS_MASK                       0x00000007 */
/* #define _CHECON_PFMWS_LENGTH                     0x00000003 */

/* #define _CHECON_PREFEN_POSITION                  0x00000004 */
/* #define _CHECON_PREFEN_MASK                      0x00000030 */
/* #define _CHECON_PREFEN_LENGTH                    0x00000002 */

/* #define _CHECON_DCSZ_POSITION                    0x00000008 */
/* #define _CHECON_DCSZ_MASK                        0x00000300 */
/* #define _CHECON_DCSZ_LENGTH                      0x00000002 */

/* #define _CHECON_CHECOH_POSITION                  0x00000010 */
/* #define _CHECON_CHECOH_MASK                      0x00010000 */
/* #define _CHECON_CHECOH_LENGTH                    0x00000001 */

/* #define _CHECON_w_POSITION                       0x00000000 */
/* #define _CHECON_w_MASK                           0xFFFFFFFF */
/* #define _CHECON_w_LENGTH                         0x00000020 */

/* #define _CHEACC_CHEIDX_POSITION                  0x00000000 */
/* #define _CHEACC_CHEIDX_MASK                      0x0000000F */
/* #define _CHEACC_CHEIDX_LENGTH                    0x00000004 */

/* #define _CHEACC_CHEWEN_POSITION                  0x0000001F */
/* #define _CHEACC_CHEWEN_MASK                      0x80000000 */
/* #define _CHEACC_CHEWEN_LENGTH                    0x00000001 */

/* #define _CHETAG_LTYPE_POSITION                   0x00000001 */
/* #define _CHETAG_LTYPE_MASK                       0x00000002 */
/* #define _CHETAG_LTYPE_LENGTH                     0x00000001 */

/* #define _CHETAG_LLOCK_POSITION                   0x00000002 */
/* #define _CHETAG_LLOCK_MASK                       0x00000004 */
/* #define _CHETAG_LLOCK_LENGTH                     0x00000001 */

/* #define _CHETAG_LVALID_POSITION                  0x00000003 */
/* #define _CHETAG_LVALID_MASK                      0x00000008 */
/* #define _CHETAG_LVALID_LENGTH                    0x00000001 */

/* #define _CHETAG_LTAG_POSITION                    0x00000004 */
/* #define _CHETAG_LTAG_MASK                        0x00FFFFF0 */
/* #define _CHETAG_LTAG_LENGTH                      0x00000014 */

/* #define _CHETAG_LTAGBOOT_POSITION                0x0000001F */
/* #define _CHETAG_LTAGBOOT_MASK                    0x80000000 */
/* #define _CHETAG_LTAGBOOT_LENGTH                  0x00000001 */

/* #define _CHETAG_w_POSITION                       0x00000000 */
/* #define _CHETAG_w_MASK                           0xFFFFFFFF */
/* #define _CHETAG_w_LENGTH                         0x00000020 */

/* #define _CHEMSK_LMASK_POSITION                   0x00000005 */
/* #define _CHEMSK_LMASK_MASK                       0x0000FFE0 */
/* #define _CHEMSK_LMASK_LENGTH                     0x0000000B */

/* #define _CHEW0_CHEW0_POSITION                    0x00000000 */
/* #define _CHEW0_CHEW0_MASK                        0xFFFFFFFF */
/* #define _CHEW0_CHEW0_LENGTH                      0x00000020 */

/* #define _CHEW1_CHEW1_POSITION                    0x00000000 */
/* #define _CHEW1_CHEW1_MASK                        0xFFFFFFFF */
/* #define _CHEW1_CHEW1_LENGTH                      0x00000020 */

/* #define _CHEW2_CHEW2_POSITION                    0x00000000 */
/* #define _CHEW2_CHEW2_MASK                        0xFFFFFFFF */
/* #define _CHEW2_CHEW2_LENGTH                      0x00000020 */

/* #define _CHEW3_CHEW3_POSITION                    0x00000000 */
/* #define _CHEW3_CHEW3_MASK                        0xFFFFFFFF */
/* #define _CHEW3_CHEW3_LENGTH                      0x00000020 */

/* #define _CHELRU_CHELRU_POSITION                  0x00000000 */
/* #define _CHELRU_CHELRU_MASK                      0x01FFFFFF */
/* #define _CHELRU_CHELRU_LENGTH                    0x00000019 */

/* #define _CHEHIT_CHEHIT_POSITION                  0x00000000 */
/* #define _CHEHIT_CHEHIT_MASK                      0xFFFFFFFF */
/* #define _CHEHIT_CHEHIT_LENGTH                    0x00000020 */

/* #define _CHEMIS_CHEMIS_POSITION                  0x00000000 */
/* #define _CHEMIS_CHEMIS_MASK                      0xFFFFFFFF */
/* #define _CHEMIS_CHEMIS_LENGTH                    0x00000020 */

/* #define _CHEPFABT_CHEPFABT_POSITION              0x00000000 */
/* #define _CHEPFABT_CHEPFABT_MASK                  0xFFFFFFFF */
/* #define _CHEPFABT_CHEPFABT_LENGTH                0x00000020 */

/* #define _U1OTGIR_VBUSVDIF_POSITION               0x00000000 */
/* #define _U1OTGIR_VBUSVDIF_MASK                   0x00000001 */
/* #define _U1OTGIR_VBUSVDIF_LENGTH                 0x00000001 */

/* #define _U1OTGIR_SESENDIF_POSITION               0x00000002 */
/* #define _U1OTGIR_SESENDIF_MASK                   0x00000004 */
/* #define _U1OTGIR_SESENDIF_LENGTH                 0x00000001 */

/* #define _U1OTGIR_SESVDIF_POSITION                0x00000003 */
/* #define _U1OTGIR_SESVDIF_MASK                    0x00000008 */
/* #define _U1OTGIR_SESVDIF_LENGTH                  0x00000001 */

/* #define _U1OTGIR_ACTVIF_POSITION                 0x00000004 */
/* #define _U1OTGIR_ACTVIF_MASK                     0x00000010 */
/* #define _U1OTGIR_ACTVIF_LENGTH                   0x00000001 */

/* #define _U1OTGIR_LSTATEIF_POSITION               0x00000005 */
/* #define _U1OTGIR_LSTATEIF_MASK                   0x00000020 */
/* #define _U1OTGIR_LSTATEIF_LENGTH                 0x00000001 */

/* #define _U1OTGIR_T1MSECIF_POSITION               0x00000006 */
/* #define _U1OTGIR_T1MSECIF_MASK                   0x00000040 */
/* #define _U1OTGIR_T1MSECIF_LENGTH                 0x00000001 */

/* #define _U1OTGIR_IDIF_POSITION                   0x00000007 */
/* #define _U1OTGIR_IDIF_MASK                       0x00000080 */
/* #define _U1OTGIR_IDIF_LENGTH                     0x00000001 */

/* #define _U1OTGIE_VBUSVDIE_POSITION               0x00000000 */
/* #define _U1OTGIE_VBUSVDIE_MASK                   0x00000001 */
/* #define _U1OTGIE_VBUSVDIE_LENGTH                 0x00000001 */

