rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _U1IR_STALLIF_POSITION                   0x00000007 */
/* #define _U1IR_STALLIF_MASK                       0x00000080 */
/* #define _U1IR_STALLIF_LENGTH                     0x00000001 */

/* #define _U1IR_DETACHIF_POSITION                  0x00000000 */
/* #define _U1IR_DETACHIF_MASK                      0x00000001 */
/* #define _U1IR_DETACHIF_LENGTH                    0x00000001 */

/* #define _U1IR_URSTIF_POSITION                    0x00000000 */
/* #define _U1IR_URSTIF_MASK                        0x00000001 */
/* #define _U1IR_URSTIF_LENGTH                      0x00000001 */

/* #define _U1IE_URSTIE_DETACHIE_POSITION           0x00000000 */
/* #define _U1IE_URSTIE_DETACHIE_MASK               0x00000001 */
/* #define _U1IE_URSTIE_DETACHIE_LENGTH             0x00000001 */

/* #define _U1IE_UERRIE_POSITION                    0x00000001 */
/* #define _U1IE_UERRIE_MASK                        0x00000002 */
/* #define _U1IE_UERRIE_LENGTH                      0x00000001 */

/* #define _U1IE_SOFIE_POSITION                     0x00000002 */
/* #define _U1IE_SOFIE_MASK                         0x00000004 */
/* #define _U1IE_SOFIE_LENGTH                       0x00000001 */

/* #define _U1IE_TRNIE_POSITION                     0x00000003 */
/* #define _U1IE_TRNIE_MASK                         0x00000008 */
/* #define _U1IE_TRNIE_LENGTH                       0x00000001 */

/* #define _U1IE_IDLEIE_POSITION                    0x00000004 */
/* #define _U1IE_IDLEIE_MASK                        0x00000010 */
/* #define _U1IE_IDLEIE_LENGTH                      0x00000001 */

/* #define _U1IE_RESUMEIE_POSITION                  0x00000005 */
/* #define _U1IE_RESUMEIE_MASK                      0x00000020 */
/* #define _U1IE_RESUMEIE_LENGTH                    0x00000001 */

/* #define _U1IE_ATTACHIE_POSITION                  0x00000006 */
/* #define _U1IE_ATTACHIE_MASK                      0x00000040 */
/* #define _U1IE_ATTACHIE_LENGTH                    0x00000001 */

/* #define _U1IE_STALLIE_POSITION                   0x00000007 */
/* #define _U1IE_STALLIE_MASK                       0x00000080 */
/* #define _U1IE_STALLIE_LENGTH                     0x00000001 */

/* #define _U1IE_DETACHIE_POSITION                  0x00000000 */
/* #define _U1IE_DETACHIE_MASK                      0x00000001 */
/* #define _U1IE_DETACHIE_LENGTH                    0x00000001 */

/* #define _U1IE_URSTIE_POSITION                    0x00000000 */
/* #define _U1IE_URSTIE_MASK                        0x00000001 */
/* #define _U1IE_URSTIE_LENGTH                      0x00000001 */

/* #define _U1EIR_PIDEF_POSITION                    0x00000000 */
/* #define _U1EIR_PIDEF_MASK                        0x00000001 */
/* #define _U1EIR_PIDEF_LENGTH                      0x00000001 */

/* #define _U1EIR_CRC5EF_EOFEF_POSITION             0x00000001 */
/* #define _U1EIR_CRC5EF_EOFEF_MASK                 0x00000002 */
/* #define _U1EIR_CRC5EF_EOFEF_LENGTH               0x00000001 */

/* #define _U1EIR_CRC16EF_POSITION                  0x00000002 */
/* #define _U1EIR_CRC16EF_MASK                      0x00000004 */
/* #define _U1EIR_CRC16EF_LENGTH                    0x00000001 */

/* #define _U1EIR_DFN8EF_POSITION                   0x00000003 */
/* #define _U1EIR_DFN8EF_MASK                       0x00000008 */
/* #define _U1EIR_DFN8EF_LENGTH                     0x00000001 */

/* #define _U1EIR_BTOEF_POSITION                    0x00000004 */
/* #define _U1EIR_BTOEF_MASK                        0x00000010 */
/* #define _U1EIR_BTOEF_LENGTH                      0x00000001 */

/* #define _U1EIR_DMAEF_POSITION                    0x00000005 */
/* #define _U1EIR_DMAEF_MASK                        0x00000020 */
/* #define _U1EIR_DMAEF_LENGTH                      0x00000001 */

/* #define _U1EIR_BMXEF_POSITION                    0x00000006 */
/* #define _U1EIR_BMXEF_MASK                        0x00000040 */
/* #define _U1EIR_BMXEF_LENGTH                      0x00000001 */

/* #define _U1EIR_BTSEF_POSITION                    0x00000007 */
/* #define _U1EIR_BTSEF_MASK                        0x00000080 */
/* #define _U1EIR_BTSEF_LENGTH                      0x00000001 */

/* #define _U1EIR_CRC5EF_POSITION                   0x00000001 */
/* #define _U1EIR_CRC5EF_MASK                       0x00000002 */
/* #define _U1EIR_CRC5EF_LENGTH                     0x00000001 */

/* #define _U1EIR_EOFEF_POSITION                    0x00000001 */
/* #define _U1EIR_EOFEF_MASK                        0x00000002 */
/* #define _U1EIR_EOFEF_LENGTH                      0x00000001 */

/* #define _U1EIE_PIDEE_POSITION                    0x00000000 */
/* #define _U1EIE_PIDEE_MASK                        0x00000001 */
/* #define _U1EIE_PIDEE_LENGTH                      0x00000001 */

/* #define _U1EIE_CRC5EE_EOFEE_POSITION             0x00000001 */
/* #define _U1EIE_CRC5EE_EOFEE_MASK                 0x00000002 */
/* #define _U1EIE_CRC5EE_EOFEE_LENGTH               0x00000001 */

/* #define _U1EIE_CRC16EE_POSITION                  0x00000002 */
/* #define _U1EIE_CRC16EE_MASK                      0x00000004 */
/* #define _U1EIE_CRC16EE_LENGTH                    0x00000001 */

/* #define _U1EIE_DFN8EE_POSITION                   0x00000003 */
/* #define _U1EIE_DFN8EE_MASK                       0x00000008 */
/* #define _U1EIE_DFN8EE_LENGTH                     0x00000001 */

/* #define _U1EIE_BTOEE_POSITION                    0x00000004 */
/* #define _U1EIE_BTOEE_MASK                        0x00000010 */
/* #define _U1EIE_BTOEE_LENGTH                      0x00000001 */

/* #define _U1EIE_DMAEE_POSITION                    0x00000005 */
/* #define _U1EIE_DMAEE_MASK                        0x00000020 */
/* #define _U1EIE_DMAEE_LENGTH                      0x00000001 */

/* #define _U1EIE_BMXEE_POSITION                    0x00000006 */
/* #define _U1EIE_BMXEE_MASK                        0x00000040 */
/* #define _U1EIE_BMXEE_LENGTH                      0x00000001 */

/* #define _U1EIE_BTSEE_POSITION                    0x00000007 */
/* #define _U1EIE_BTSEE_MASK                        0x00000080 */
/* #define _U1EIE_BTSEE_LENGTH                      0x00000001 */

