rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _U1FRML_FRML_POSITION                    0x00000000 */
/* #define _U1FRML_FRML_MASK                        0x000000FF */
/* #define _U1FRML_FRML_LENGTH                      0x00000008 */

/* #define _U1FRML_FRM0_POSITION                    0x00000000 */
/* #define _U1FRML_FRM0_MASK                        0x00000001 */
/* #define _U1FRML_FRM0_LENGTH                      0x00000001 */

/* #define _U1FRML_FRM1_POSITION                    0x00000001 */
/* #define _U1FRML_FRM1_MASK                        0x00000002 */
/* #define _U1FRML_FRM1_LENGTH                      0x00000001 */

/* #define _U1FRML_FRM2_POSITION                    0x00000002 */
/* #define _U1FRML_FRM2_MASK                        0x00000004 */
/* #define _U1FRML_FRM2_LENGTH                      0x00000001 */

/* #define _U1FRML_FRM3_POSITION                    0x00000003 */
/* #define _U1FRML_FRM3_MASK                        0x00000008 */
/* #define _U1FRML_FRM3_LENGTH                      0x00000001 */

/* #define _U1FRML_FRM4_POSITION                    0x00000004 */
/* #define _U1FRML_FRM4_MASK                        0x00000010 */
/* #define _U1FRML_FRM4_LENGTH                      0x00000001 */

/* #define _U1FRML_FRM5_POSITION                    0x00000005 */
/* #define _U1FRML_FRM5_MASK                        0x00000020 */
/* #define _U1FRML_FRM5_LENGTH                      0x00000001 */

/* #define _U1FRML_FRM6_POSITION                    0x00000006 */
/* #define _U1FRML_FRM6_MASK                        0x00000040 */
/* #define _U1FRML_FRM6_LENGTH                      0x00000001 */

/* #define _U1FRML_FRM7_POSITION                    0x00000007 */
/* #define _U1FRML_FRM7_MASK                        0x00000080 */
/* #define _U1FRML_FRM7_LENGTH                      0x00000001 */

/* #define _U1FRMH_FRMH_POSITION                    0x00000000 */
/* #define _U1FRMH_FRMH_MASK                        0x00000007 */
/* #define _U1FRMH_FRMH_LENGTH                      0x00000003 */

/* #define _U1FRMH_FRM8_POSITION                    0x00000000 */
/* #define _U1FRMH_FRM8_MASK                        0x00000001 */
/* #define _U1FRMH_FRM8_LENGTH                      0x00000001 */

/* #define _U1FRMH_FRM9_POSITION                    0x00000001 */
/* #define _U1FRMH_FRM9_MASK                        0x00000002 */
/* #define _U1FRMH_FRM9_LENGTH                      0x00000001 */

/* #define _U1FRMH_FRM10_POSITION                   0x00000002 */
/* #define _U1FRMH_FRM10_MASK                       0x00000004 */
/* #define _U1FRMH_FRM10_LENGTH                     0x00000001 */

/* #define _U1TOK_EP_POSITION                       0x00000000 */
/* #define _U1TOK_EP_MASK                           0x0000000F */
/* #define _U1TOK_EP_LENGTH                         0x00000004 */

/* #define _U1TOK_PID_POSITION                      0x00000004 */
/* #define _U1TOK_PID_MASK                          0x000000F0 */
/* #define _U1TOK_PID_LENGTH                        0x00000004 */

/* #define _U1TOK_EP0_POSITION                      0x00000000 */
/* #define _U1TOK_EP0_MASK                          0x00000001 */
/* #define _U1TOK_EP0_LENGTH                        0x00000001 */

/* #define _U1TOK_EP1_POSITION                      0x00000001 */
/* #define _U1TOK_EP1_MASK                          0x00000002 */
/* #define _U1TOK_EP1_LENGTH                        0x00000001 */

/* #define _U1TOK_EP2_POSITION                      0x00000002 */
/* #define _U1TOK_EP2_MASK                          0x00000004 */
/* #define _U1TOK_EP2_LENGTH                        0x00000001 */

/* #define _U1TOK_EP3_POSITION                      0x00000003 */
/* #define _U1TOK_EP3_MASK                          0x00000008 */
/* #define _U1TOK_EP3_LENGTH                        0x00000001 */

/* #define _U1TOK_PID0_POSITION                     0x00000004 */
/* #define _U1TOK_PID0_MASK                         0x00000010 */
/* #define _U1TOK_PID0_LENGTH                       0x00000001 */

/* #define _U1TOK_PID1_POSITION                     0x00000005 */
/* #define _U1TOK_PID1_MASK                         0x00000020 */
/* #define _U1TOK_PID1_LENGTH                       0x00000001 */

/* #define _U1TOK_PID2_POSITION                     0x00000006 */
/* #define _U1TOK_PID2_MASK                         0x00000040 */
/* #define _U1TOK_PID2_LENGTH                       0x00000001 */

/* #define _U1TOK_PID3_POSITION                     0x00000007 */
/* #define _U1TOK_PID3_MASK                         0x00000080 */
/* #define _U1TOK_PID3_LENGTH                       0x00000001 */

/* #define _U1SOF_CNT_POSITION                      0x00000000 */
/* #define _U1SOF_CNT_MASK                          0x000000FF */
/* #define _U1SOF_CNT_LENGTH                        0x00000008 */

/* #define _U1BDTP2_BDTPTRH_POSITION                0x00000000 */
/* #define _U1BDTP2_BDTPTRH_MASK                    0x000000FF */
/* #define _U1BDTP2_BDTPTRH_LENGTH                  0x00000008 */

/* #define _U1BDTP3_BDTPTRU_POSITION                0x00000000 */
/* #define _U1BDTP3_BDTPTRU_MASK                    0x000000FF */
/* #define _U1BDTP3_BDTPTRU_LENGTH                  0x00000008 */

/* #define _U1CNFG1_UASUSPND_POSITION               0x00000000 */
/* #define _U1CNFG1_UASUSPND_MASK                   0x00000001 */
/* #define _U1CNFG1_UASUSPND_LENGTH                 0x00000001 */

/* #define _U1CNFG1_USBSIDL_POSITION                0x00000004 */
/* #define _U1CNFG1_USBSIDL_MASK                    0x00000010 */
/* #define _U1CNFG1_USBSIDL_LENGTH                  0x00000001 */

/* #define _U1CNFG1_UOEMON_POSITION                 0x00000006 */
/* #define _U1CNFG1_UOEMON_MASK                     0x00000040 */
/* #define _U1CNFG1_UOEMON_LENGTH                   0x00000001 */

/* #define _U1CNFG1_UTEYE_POSITION                  0x00000007 */
/* #define _U1CNFG1_UTEYE_MASK                      0x00000080 */
/* #define _U1CNFG1_UTEYE_LENGTH                    0x00000001 */

/* #define _U1EP0_EPHSHK_POSITION                   0x00000000 */
/* #define _U1EP0_EPHSHK_MASK                       0x00000001 */
/* #define _U1EP0_EPHSHK_LENGTH                     0x00000001 */

