rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _U1EP0_EPSTALL_POSITION                  0x00000001 */
/* #define _U1EP0_EPSTALL_MASK                      0x00000002 */
/* #define _U1EP0_EPSTALL_LENGTH                    0x00000001 */

/* #define _U1EP0_EPTXEN_POSITION                   0x00000002 */
/* #define _U1EP0_EPTXEN_MASK                       0x00000004 */
/* #define _U1EP0_EPTXEN_LENGTH                     0x00000001 */

/* #define _U1EP0_EPRXEN_POSITION                   0x00000003 */
/* #define _U1EP0_EPRXEN_MASK                       0x00000008 */
/* #define _U1EP0_EPRXEN_LENGTH                     0x00000001 */

/* #define _U1EP0_EPCONDIS_POSITION                 0x00000004 */
/* #define _U1EP0_EPCONDIS_MASK                     0x00000010 */
/* #define _U1EP0_EPCONDIS_LENGTH                   0x00000001 */

/* #define _U1EP0_RETRYDIS_POSITION                 0x00000006 */
/* #define _U1EP0_RETRYDIS_MASK                     0x00000040 */
/* #define _U1EP0_RETRYDIS_LENGTH                   0x00000001 */

/* #define _U1EP0_LSPD_POSITION                     0x00000007 */
/* #define _U1EP0_LSPD_MASK                         0x00000080 */
/* #define _U1EP0_LSPD_LENGTH                       0x00000001 */

/* #define _U1EP1_EPHSHK_POSITION                   0x00000000 */
/* #define _U1EP1_EPHSHK_MASK                       0x00000001 */
/* #define _U1EP1_EPHSHK_LENGTH                     0x00000001 */

/* #define _U1EP1_EPSTALL_POSITION                  0x00000001 */
/* #define _U1EP1_EPSTALL_MASK                      0x00000002 */
/* #define _U1EP1_EPSTALL_LENGTH                    0x00000001 */

/* #define _U1EP1_EPTXEN_POSITION                   0x00000002 */
/* #define _U1EP1_EPTXEN_MASK                       0x00000004 */
/* #define _U1EP1_EPTXEN_LENGTH                     0x00000001 */

/* #define _U1EP1_EPRXEN_POSITION                   0x00000003 */
/* #define _U1EP1_EPRXEN_MASK                       0x00000008 */
/* #define _U1EP1_EPRXEN_LENGTH                     0x00000001 */

/* #define _U1EP1_EPCONDIS_POSITION                 0x00000004 */
/* #define _U1EP1_EPCONDIS_MASK                     0x00000010 */
/* #define _U1EP1_EPCONDIS_LENGTH                   0x00000001 */

/* #define _U1EP2_EPHSHK_POSITION                   0x00000000 */
/* #define _U1EP2_EPHSHK_MASK                       0x00000001 */
/* #define _U1EP2_EPHSHK_LENGTH                     0x00000001 */

/* #define _U1EP2_EPSTALL_POSITION                  0x00000001 */
/* #define _U1EP2_EPSTALL_MASK                      0x00000002 */
/* #define _U1EP2_EPSTALL_LENGTH                    0x00000001 */

/* #define _U1EP2_EPTXEN_POSITION                   0x00000002 */
/* #define _U1EP2_EPTXEN_MASK                       0x00000004 */
/* #define _U1EP2_EPTXEN_LENGTH                     0x00000001 */

/* #define _U1EP2_EPRXEN_POSITION                   0x00000003 */
/* #define _U1EP2_EPRXEN_MASK                       0x00000008 */
/* #define _U1EP2_EPRXEN_LENGTH                     0x00000001 */

/* #define _U1EP2_EPCONDIS_POSITION                 0x00000004 */
/* #define _U1EP2_EPCONDIS_MASK                     0x00000010 */
/* #define _U1EP2_EPCONDIS_LENGTH                   0x00000001 */

/* #define _U1EP3_EPHSHK_POSITION                   0x00000000 */
/* #define _U1EP3_EPHSHK_MASK                       0x00000001 */
/* #define _U1EP3_EPHSHK_LENGTH                     0x00000001 */

/* #define _U1EP3_EPSTALL_POSITION                  0x00000001 */
/* #define _U1EP3_EPSTALL_MASK                      0x00000002 */
/* #define _U1EP3_EPSTALL_LENGTH                    0x00000001 */

/* #define _U1EP3_EPTXEN_POSITION                   0x00000002 */
/* #define _U1EP3_EPTXEN_MASK                       0x00000004 */
/* #define _U1EP3_EPTXEN_LENGTH                     0x00000001 */

/* #define _U1EP3_EPRXEN_POSITION                   0x00000003 */
/* #define _U1EP3_EPRXEN_MASK                       0x00000008 */
/* #define _U1EP3_EPRXEN_LENGTH                     0x00000001 */

/* #define _U1EP3_EPCONDIS_POSITION                 0x00000004 */
/* #define _U1EP3_EPCONDIS_MASK                     0x00000010 */
/* #define _U1EP3_EPCONDIS_LENGTH                   0x00000001 */

/* #define _U1EP4_EPHSHK_POSITION                   0x00000000 */
/* #define _U1EP4_EPHSHK_MASK                       0x00000001 */
/* #define _U1EP4_EPHSHK_LENGTH                     0x00000001 */

/* #define _U1EP4_EPSTALL_POSITION                  0x00000001 */
/* #define _U1EP4_EPSTALL_MASK                      0x00000002 */
/* #define _U1EP4_EPSTALL_LENGTH                    0x00000001 */

/* #define _U1EP4_EPTXEN_POSITION                   0x00000002 */
/* #define _U1EP4_EPTXEN_MASK                       0x00000004 */
/* #define _U1EP4_EPTXEN_LENGTH                     0x00000001 */

/* #define _U1EP4_EPRXEN_POSITION                   0x00000003 */
/* #define _U1EP4_EPRXEN_MASK                       0x00000008 */
/* #define _U1EP4_EPRXEN_LENGTH                     0x00000001 */

/* #define _U1EP4_EPCONDIS_POSITION                 0x00000004 */
/* #define _U1EP4_EPCONDIS_MASK                     0x00000010 */
/* #define _U1EP4_EPCONDIS_LENGTH                   0x00000001 */

/* #define _U1EP5_EPHSHK_POSITION                   0x00000000 */
/* #define _U1EP5_EPHSHK_MASK                       0x00000001 */
/* #define _U1EP5_EPHSHK_LENGTH                     0x00000001 */

/* #define _U1EP5_EPSTALL_POSITION                  0x00000001 */
/* #define _U1EP5_EPSTALL_MASK                      0x00000002 */
/* #define _U1EP5_EPSTALL_LENGTH                    0x00000001 */

/* #define _U1EP5_EPTXEN_POSITION                   0x00000002 */
/* #define _U1EP5_EPTXEN_MASK                       0x00000004 */
/* #define _U1EP5_EPTXEN_LENGTH                     0x00000001 */

/* #define _U1EP5_EPRXEN_POSITION                   0x00000003 */
/* #define _U1EP5_EPRXEN_MASK                       0x00000008 */
/* #define _U1EP5_EPRXEN_LENGTH                     0x00000001 */

/* #define _U1EP5_EPCONDIS_POSITION                 0x00000004 */
/* #define _U1EP5_EPCONDIS_MASK                     0x00000010 */
/* #define _U1EP5_EPCONDIS_LENGTH                   0x00000001 */

