rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _U1EP6_EPHSHK_POSITION                   0x00000000 */
/* #define _U1EP6_EPHSHK_MASK                       0x00000001 */
/* #define _U1EP6_EPHSHK_LENGTH                     0x00000001 */

/* #define _U1EP6_EPSTALL_POSITION                  0x00000001 */
/* #define _U1EP6_EPSTALL_MASK                      0x00000002 */
/* #define _U1EP6_EPSTALL_LENGTH                    0x00000001 */

/* #define _U1EP6_EPTXEN_POSITION                   0x00000002 */
/* #define _U1EP6_EPTXEN_MASK                       0x00000004 */
/* #define _U1EP6_EPTXEN_LENGTH                     0x00000001 */

/* #define _U1EP6_EPRXEN_POSITION                   0x00000003 */
/* #define _U1EP6_EPRXEN_MASK                       0x00000008 */
/* #define _U1EP6_EPRXEN_LENGTH                     0x00000001 */

/* #define _U1EP6_EPCONDIS_POSITION                 0x00000004 */
/* #define _U1EP6_EPCONDIS_MASK                     0x00000010 */
/* #define _U1EP6_EPCONDIS_LENGTH                   0x00000001 */

/* #define _U1EP7_EPHSHK_POSITION                   0x00000000 */
/* #define _U1EP7_EPHSHK_MASK                       0x00000001 */
/* #define _U1EP7_EPHSHK_LENGTH                     0x00000001 */

/* #define _U1EP7_EPSTALL_POSITION                  0x00000001 */
/* #define _U1EP7_EPSTALL_MASK                      0x00000002 */
/* #define _U1EP7_EPSTALL_LENGTH                    0x00000001 */

/* #define _U1EP7_EPTXEN_POSITION                   0x00000002 */
/* #define _U1EP7_EPTXEN_MASK                       0x00000004 */
/* #define _U1EP7_EPTXEN_LENGTH                     0x00000001 */

/* #define _U1EP7_EPRXEN_POSITION                   0x00000003 */
/* #define _U1EP7_EPRXEN_MASK                       0x00000008 */
/* #define _U1EP7_EPRXEN_LENGTH                     0x00000001 */

/* #define _U1EP7_EPCONDIS_POSITION                 0x00000004 */
/* #define _U1EP7_EPCONDIS_MASK                     0x00000010 */
/* #define _U1EP7_EPCONDIS_LENGTH                   0x00000001 */

/* #define _U1EP8_EPHSHK_POSITION                   0x00000000 */
/* #define _U1EP8_EPHSHK_MASK                       0x00000001 */
/* #define _U1EP8_EPHSHK_LENGTH                     0x00000001 */

/* #define _U1EP8_EPSTALL_POSITION                  0x00000001 */
/* #define _U1EP8_EPSTALL_MASK                      0x00000002 */
/* #define _U1EP8_EPSTALL_LENGTH                    0x00000001 */

/* #define _U1EP8_EPTXEN_POSITION                   0x00000002 */
/* #define _U1EP8_EPTXEN_MASK                       0x00000004 */
/* #define _U1EP8_EPTXEN_LENGTH                     0x00000001 */

/* #define _U1EP8_EPRXEN_POSITION                   0x00000003 */
/* #define _U1EP8_EPRXEN_MASK                       0x00000008 */
/* #define _U1EP8_EPRXEN_LENGTH                     0x00000001 */

/* #define _U1EP8_EPCONDIS_POSITION                 0x00000004 */
/* #define _U1EP8_EPCONDIS_MASK                     0x00000010 */
/* #define _U1EP8_EPCONDIS_LENGTH                   0x00000001 */

/* #define _U1EP9_EPHSHK_POSITION                   0x00000000 */
/* #define _U1EP9_EPHSHK_MASK                       0x00000001 */
/* #define _U1EP9_EPHSHK_LENGTH                     0x00000001 */

/* #define _U1EP9_EPSTALL_POSITION                  0x00000001 */
/* #define _U1EP9_EPSTALL_MASK                      0x00000002 */
/* #define _U1EP9_EPSTALL_LENGTH                    0x00000001 */

/* #define _U1EP9_EPTXEN_POSITION                   0x00000002 */
/* #define _U1EP9_EPTXEN_MASK                       0x00000004 */
/* #define _U1EP9_EPTXEN_LENGTH                     0x00000001 */

/* #define _U1EP9_EPRXEN_POSITION                   0x00000003 */
/* #define _U1EP9_EPRXEN_MASK                       0x00000008 */
/* #define _U1EP9_EPRXEN_LENGTH                     0x00000001 */

/* #define _U1EP9_EPCONDIS_POSITION                 0x00000004 */
/* #define _U1EP9_EPCONDIS_MASK                     0x00000010 */
/* #define _U1EP9_EPCONDIS_LENGTH                   0x00000001 */

/* #define _U1EP10_EPHSHK_POSITION                  0x00000000 */
/* #define _U1EP10_EPHSHK_MASK                      0x00000001 */
/* #define _U1EP10_EPHSHK_LENGTH                    0x00000001 */

/* #define _U1EP10_EPSTALL_POSITION                 0x00000001 */
/* #define _U1EP10_EPSTALL_MASK                     0x00000002 */
/* #define _U1EP10_EPSTALL_LENGTH                   0x00000001 */

/* #define _U1EP10_EPTXEN_POSITION                  0x00000002 */
/* #define _U1EP10_EPTXEN_MASK                      0x00000004 */
/* #define _U1EP10_EPTXEN_LENGTH                    0x00000001 */

/* #define _U1EP10_EPRXEN_POSITION                  0x00000003 */
/* #define _U1EP10_EPRXEN_MASK                      0x00000008 */
/* #define _U1EP10_EPRXEN_LENGTH                    0x00000001 */

/* #define _U1EP10_EPCONDIS_POSITION                0x00000004 */
/* #define _U1EP10_EPCONDIS_MASK                    0x00000010 */
/* #define _U1EP10_EPCONDIS_LENGTH                  0x00000001 */

/* #define _U1EP11_EPHSHK_POSITION                  0x00000000 */
/* #define _U1EP11_EPHSHK_MASK                      0x00000001 */
/* #define _U1EP11_EPHSHK_LENGTH                    0x00000001 */

/* #define _U1EP11_EPSTALL_POSITION                 0x00000001 */
/* #define _U1EP11_EPSTALL_MASK                     0x00000002 */
/* #define _U1EP11_EPSTALL_LENGTH                   0x00000001 */

/* #define _U1EP11_EPTXEN_POSITION                  0x00000002 */
/* #define _U1EP11_EPTXEN_MASK                      0x00000004 */
/* #define _U1EP11_EPTXEN_LENGTH                    0x00000001 */

/* #define _U1EP11_EPRXEN_POSITION                  0x00000003 */
/* #define _U1EP11_EPRXEN_MASK                      0x00000008 */
/* #define _U1EP11_EPRXEN_LENGTH                    0x00000001 */

/* #define _U1EP11_EPCONDIS_POSITION                0x00000004 */
/* #define _U1EP11_EPCONDIS_MASK                    0x00000010 */
/* #define _U1EP11_EPCONDIS_LENGTH                  0x00000001 */

/* #define _U1EP12_EPHSHK_POSITION                  0x00000000 */
/* #define _U1EP12_EPHSHK_MASK                      0x00000001 */
/* #define _U1EP12_EPHSHK_LENGTH                    0x00000001 */

/* #define _U1EP12_EPSTALL_POSITION                 0x00000001 */
/* #define _U1EP12_EPSTALL_MASK                     0x00000002 */
/* #define _U1EP12_EPSTALL_LENGTH                   0x00000001 */

/* #define _U1EP12_EPTXEN_POSITION                  0x00000002 */
/* #define _U1EP12_EPTXEN_MASK                      0x00000004 */
/* #define _U1EP12_EPTXEN_LENGTH                    0x00000001 */

/* #define _U1EP12_EPRXEN_POSITION                  0x00000003 */
/* #define _U1EP12_EPRXEN_MASK                      0x00000008 */
/* #define _U1EP12_EPRXEN_LENGTH                    0x00000001 */

/* #define _U1EP12_EPCONDIS_POSITION                0x00000004 */
/* #define _U1EP12_EPCONDIS_MASK                    0x00000010 */
/* #define _U1EP12_EPCONDIS_LENGTH                  0x00000001 */

/* #define _U1EP13_EPHSHK_POSITION                  0x00000000 */
/* #define _U1EP13_EPHSHK_MASK                      0x00000001 */
/* #define _U1EP13_EPHSHK_LENGTH                    0x00000001 */

/* #define _U1EP13_EPSTALL_POSITION                 0x00000001 */
/* #define _U1EP13_EPSTALL_MASK                     0x00000002 */
/* #define _U1EP13_EPSTALL_LENGTH                   0x00000001 */

/* #define _U1EP13_EPTXEN_POSITION                  0x00000002 */
/* #define _U1EP13_EPTXEN_MASK                      0x00000004 */
/* #define _U1EP13_EPTXEN_LENGTH                    0x00000001 */

/* #define _U1EP13_EPRXEN_POSITION                  0x00000003 */
/* #define _U1EP13_EPRXEN_MASK                      0x00000008 */
/* #define _U1EP13_EPRXEN_LENGTH                    0x00000001 */

/* #define _U1EP13_EPCONDIS_POSITION                0x00000004 */
/* #define _U1EP13_EPCONDIS_MASK                    0x00000010 */
/* #define _U1EP13_EPCONDIS_LENGTH                  0x00000001 */

/* #define _U1EP14_EPHSHK_POSITION                  0x00000000 */
/* #define _U1EP14_EPHSHK_MASK                      0x00000001 */
/* #define _U1EP14_EPHSHK_LENGTH                    0x00000001 */

/* #define _U1EP14_EPSTALL_POSITION                 0x00000001 */
/* #define _U1EP14_EPSTALL_MASK                     0x00000002 */
/* #define _U1EP14_EPSTALL_LENGTH                   0x00000001 */

/* #define _U1EP14_EPTXEN_POSITION                  0x00000002 */
/* #define _U1EP14_EPTXEN_MASK                      0x00000004 */
/* #define _U1EP14_EPTXEN_LENGTH                    0x00000001 */

/* #define _U1EP14_EPRXEN_POSITION                  0x00000003 */
/* #define _U1EP14_EPRXEN_MASK                      0x00000008 */
/* #define _U1EP14_EPRXEN_LENGTH                    0x00000001 */

/* #define _U1EP14_EPCONDIS_POSITION                0x00000004 */
/* #define _U1EP14_EPCONDIS_MASK                    0x00000010 */
/* #define _U1EP14_EPCONDIS_LENGTH                  0x00000001 */

/* #define _U1EP15_EPHSHK_POSITION                  0x00000000 */
/* #define _U1EP15_EPHSHK_MASK                      0x00000001 */
/* #define _U1EP15_EPHSHK_LENGTH                    0x00000001 */

/* #define _U1EP15_EPSTALL_POSITION                 0x00000001 */
/* #define _U1EP15_EPSTALL_MASK                     0x00000002 */
/* #define _U1EP15_EPSTALL_LENGTH                   0x00000001 */

/* #define _U1EP15_EPTXEN_POSITION                  0x00000002 */
/* #define _U1EP15_EPTXEN_MASK                      0x00000004 */
/* #define _U1EP15_EPTXEN_LENGTH                    0x00000001 */

/* #define _U1EP15_EPRXEN_POSITION                  0x00000003 */
/* #define _U1EP15_EPRXEN_MASK                      0x00000008 */
/* #define _U1EP15_EPRXEN_LENGTH                    0x00000001 */

/* #define _U1EP15_EPCONDIS_POSITION                0x00000004 */
/* #define _U1EP15_EPCONDIS_MASK                    0x00000010 */
/* #define _U1EP15_EPCONDIS_LENGTH                  0x00000001 */

/* #define _ANSELB_ANSB0_POSITION                   0x00000000 */
/* #define _ANSELB_ANSB0_MASK                       0x00000001 */
/* #define _ANSELB_ANSB0_LENGTH                     0x00000001 */

