rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _ODCB_ODCB1_POSITION                     0x00000001 */
/* #define _ODCB_ODCB1_MASK                         0x00000002 */
/* #define _ODCB_ODCB1_LENGTH                       0x00000001 */

/* #define _ODCB_ODCB2_POSITION                     0x00000002 */
/* #define _ODCB_ODCB2_MASK                         0x00000004 */
/* #define _ODCB_ODCB2_LENGTH                       0x00000001 */

/* #define _ODCB_ODCB3_POSITION                     0x00000003 */
/* #define _ODCB_ODCB3_MASK                         0x00000008 */
/* #define _ODCB_ODCB3_LENGTH                       0x00000001 */

/* #define _ODCB_ODCB4_POSITION                     0x00000004 */
/* #define _ODCB_ODCB4_MASK                         0x00000010 */
/* #define _ODCB_ODCB4_LENGTH                       0x00000001 */

/* #define _ODCB_ODCB5_POSITION                     0x00000005 */
/* #define _ODCB_ODCB5_MASK                         0x00000020 */
/* #define _ODCB_ODCB5_LENGTH                       0x00000001 */

/* #define _ODCB_ODCB6_POSITION                     0x00000006 */
/* #define _ODCB_ODCB6_MASK                         0x00000040 */
/* #define _ODCB_ODCB6_LENGTH                       0x00000001 */

/* #define _ODCB_ODCB7_POSITION                     0x00000007 */
/* #define _ODCB_ODCB7_MASK                         0x00000080 */
/* #define _ODCB_ODCB7_LENGTH                       0x00000001 */

/* #define _ODCB_ODCB8_POSITION                     0x00000008 */
/* #define _ODCB_ODCB8_MASK                         0x00000100 */
/* #define _ODCB_ODCB8_LENGTH                       0x00000001 */

/* #define _ODCB_ODCB9_POSITION                     0x00000009 */
/* #define _ODCB_ODCB9_MASK                         0x00000200 */
/* #define _ODCB_ODCB9_LENGTH                       0x00000001 */

/* #define _ODCB_ODCB10_POSITION                    0x0000000A */
/* #define _ODCB_ODCB10_MASK                        0x00000400 */
/* #define _ODCB_ODCB10_LENGTH                      0x00000001 */

/* #define _ODCB_ODCB11_POSITION                    0x0000000B */
/* #define _ODCB_ODCB11_MASK                        0x00000800 */
/* #define _ODCB_ODCB11_LENGTH                      0x00000001 */

/* #define _ODCB_ODCB12_POSITION                    0x0000000C */
/* #define _ODCB_ODCB12_MASK                        0x00001000 */
/* #define _ODCB_ODCB12_LENGTH                      0x00000001 */

/* #define _ODCB_ODCB13_POSITION                    0x0000000D */
/* #define _ODCB_ODCB13_MASK                        0x00002000 */
/* #define _ODCB_ODCB13_LENGTH                      0x00000001 */

/* #define _ODCB_ODCB14_POSITION                    0x0000000E */
/* #define _ODCB_ODCB14_MASK                        0x00004000 */
/* #define _ODCB_ODCB14_LENGTH                      0x00000001 */

/* #define _ODCB_ODCB15_POSITION                    0x0000000F */
/* #define _ODCB_ODCB15_MASK                        0x00008000 */
/* #define _ODCB_ODCB15_LENGTH                      0x00000001 */

/* #define _ODCB_w_POSITION                         0x00000000 */
/* #define _ODCB_w_MASK                             0xFFFFFFFF */
/* #define _ODCB_w_LENGTH                           0x00000020 */

/* #define _CNPUB_CNPUB0_POSITION                   0x00000000 */
/* #define _CNPUB_CNPUB0_MASK                       0x00000001 */
/* #define _CNPUB_CNPUB0_LENGTH                     0x00000001 */

/* #define _CNPUB_CNPUB1_POSITION                   0x00000001 */
/* #define _CNPUB_CNPUB1_MASK                       0x00000002 */
/* #define _CNPUB_CNPUB1_LENGTH                     0x00000001 */

/* #define _CNPUB_CNPUB2_POSITION                   0x00000002 */
/* #define _CNPUB_CNPUB2_MASK                       0x00000004 */
/* #define _CNPUB_CNPUB2_LENGTH                     0x00000001 */

/* #define _CNPUB_CNPUB3_POSITION                   0x00000003 */
/* #define _CNPUB_CNPUB3_MASK                       0x00000008 */
/* #define _CNPUB_CNPUB3_LENGTH                     0x00000001 */

/* #define _CNPUB_CNPUB4_POSITION                   0x00000004 */
/* #define _CNPUB_CNPUB4_MASK                       0x00000010 */
/* #define _CNPUB_CNPUB4_LENGTH                     0x00000001 */

/* #define _CNPUB_CNPUB5_POSITION                   0x00000005 */
/* #define _CNPUB_CNPUB5_MASK                       0x00000020 */
/* #define _CNPUB_CNPUB5_LENGTH                     0x00000001 */

/* #define _CNPUB_CNPUB6_POSITION                   0x00000006 */
/* #define _CNPUB_CNPUB6_MASK                       0x00000040 */
/* #define _CNPUB_CNPUB6_LENGTH                     0x00000001 */

/* #define _CNPUB_CNPUB7_POSITION                   0x00000007 */
/* #define _CNPUB_CNPUB7_MASK                       0x00000080 */
/* #define _CNPUB_CNPUB7_LENGTH                     0x00000001 */

/* #define _CNPUB_CNPUB8_POSITION                   0x00000008 */
/* #define _CNPUB_CNPUB8_MASK                       0x00000100 */
/* #define _CNPUB_CNPUB8_LENGTH                     0x00000001 */

/* #define _CNPUB_CNPUB9_POSITION                   0x00000009 */
/* #define _CNPUB_CNPUB9_MASK                       0x00000200 */
/* #define _CNPUB_CNPUB9_LENGTH                     0x00000001 */

/* #define _CNPUB_CNPUB10_POSITION                  0x0000000A */
/* #define _CNPUB_CNPUB10_MASK                      0x00000400 */
/* #define _CNPUB_CNPUB10_LENGTH                    0x00000001 */

/* #define _CNPUB_CNPUB11_POSITION                  0x0000000B */
/* #define _CNPUB_CNPUB11_MASK                      0x00000800 */
/* #define _CNPUB_CNPUB11_LENGTH                    0x00000001 */

/* #define _CNPUB_CNPUB12_POSITION                  0x0000000C */
/* #define _CNPUB_CNPUB12_MASK                      0x00001000 */
/* #define _CNPUB_CNPUB12_LENGTH                    0x00000001 */

/* #define _CNPUB_CNPUB13_POSITION                  0x0000000D */
/* #define _CNPUB_CNPUB13_MASK                      0x00002000 */
/* #define _CNPUB_CNPUB13_LENGTH                    0x00000001 */

/* #define _CNPUB_CNPUB14_POSITION                  0x0000000E */
/* #define _CNPUB_CNPUB14_MASK                      0x00004000 */
/* #define _CNPUB_CNPUB14_LENGTH                    0x00000001 */

/* #define _CNPUB_CNPUB15_POSITION                  0x0000000F */
/* #define _CNPUB_CNPUB15_MASK                      0x00008000 */
/* #define _CNPUB_CNPUB15_LENGTH                    0x00000001 */

