rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _CNPUB_w_POSITION                        0x00000000 */
/* #define _CNPUB_w_MASK                            0xFFFFFFFF */
/* #define _CNPUB_w_LENGTH                          0x00000020 */

/* #define _CNPDB_CNPDB0_POSITION                   0x00000000 */
/* #define _CNPDB_CNPDB0_MASK                       0x00000001 */
/* #define _CNPDB_CNPDB0_LENGTH                     0x00000001 */

/* #define _CNPDB_CNPDB1_POSITION                   0x00000001 */
/* #define _CNPDB_CNPDB1_MASK                       0x00000002 */
/* #define _CNPDB_CNPDB1_LENGTH                     0x00000001 */

/* #define _CNPDB_CNPDB2_POSITION                   0x00000002 */
/* #define _CNPDB_CNPDB2_MASK                       0x00000004 */
/* #define _CNPDB_CNPDB2_LENGTH                     0x00000001 */

/* #define _CNPDB_CNPDB3_POSITION                   0x00000003 */
/* #define _CNPDB_CNPDB3_MASK                       0x00000008 */
/* #define _CNPDB_CNPDB3_LENGTH                     0x00000001 */

/* #define _CNPDB_CNPDB4_POSITION                   0x00000004 */
/* #define _CNPDB_CNPDB4_MASK                       0x00000010 */
/* #define _CNPDB_CNPDB4_LENGTH                     0x00000001 */

/* #define _CNPDB_CNPDB5_POSITION                   0x00000005 */
/* #define _CNPDB_CNPDB5_MASK                       0x00000020 */
/* #define _CNPDB_CNPDB5_LENGTH                     0x00000001 */

/* #define _CNPDB_CNPDB6_POSITION                   0x00000006 */
/* #define _CNPDB_CNPDB6_MASK                       0x00000040 */
/* #define _CNPDB_CNPDB6_LENGTH                     0x00000001 */

/* #define _CNPDB_CNPDB7_POSITION                   0x00000007 */
/* #define _CNPDB_CNPDB7_MASK                       0x00000080 */
/* #define _CNPDB_CNPDB7_LENGTH                     0x00000001 */

/* #define _CNPDB_CNPDB8_POSITION                   0x00000008 */
/* #define _CNPDB_CNPDB8_MASK                       0x00000100 */
/* #define _CNPDB_CNPDB8_LENGTH                     0x00000001 */

/* #define _CNPDB_CNPDB9_POSITION                   0x00000009 */
/* #define _CNPDB_CNPDB9_MASK                       0x00000200 */
/* #define _CNPDB_CNPDB9_LENGTH                     0x00000001 */

/* #define _CNPDB_CNPDB10_POSITION                  0x0000000A */
/* #define _CNPDB_CNPDB10_MASK                      0x00000400 */
/* #define _CNPDB_CNPDB10_LENGTH                    0x00000001 */

/* #define _CNPDB_CNPDB11_POSITION                  0x0000000B */
/* #define _CNPDB_CNPDB11_MASK                      0x00000800 */
/* #define _CNPDB_CNPDB11_LENGTH                    0x00000001 */

/* #define _CNPDB_CNPDB12_POSITION                  0x0000000C */
/* #define _CNPDB_CNPDB12_MASK                      0x00001000 */
/* #define _CNPDB_CNPDB12_LENGTH                    0x00000001 */

/* #define _CNPDB_CNPDB13_POSITION                  0x0000000D */
/* #define _CNPDB_CNPDB13_MASK                      0x00002000 */
/* #define _CNPDB_CNPDB13_LENGTH                    0x00000001 */

/* #define _CNPDB_CNPDB14_POSITION                  0x0000000E */
/* #define _CNPDB_CNPDB14_MASK                      0x00004000 */
/* #define _CNPDB_CNPDB14_LENGTH                    0x00000001 */

/* #define _CNPDB_CNPDB15_POSITION                  0x0000000F */
/* #define _CNPDB_CNPDB15_MASK                      0x00008000 */
/* #define _CNPDB_CNPDB15_LENGTH                    0x00000001 */

/* #define _CNPDB_w_POSITION                        0x00000000 */
/* #define _CNPDB_w_MASK                            0xFFFFFFFF */
/* #define _CNPDB_w_LENGTH                          0x00000020 */

/* #define _CNCONB_SIDL_POSITION                    0x0000000D */
/* #define _CNCONB_SIDL_MASK                        0x00002000 */
/* #define _CNCONB_SIDL_LENGTH                      0x00000001 */

/* #define _CNCONB_ON_POSITION                      0x0000000F */
/* #define _CNCONB_ON_MASK                          0x00008000 */
/* #define _CNCONB_ON_LENGTH                        0x00000001 */

/* #define _CNCONB_w_POSITION                       0x00000000 */
/* #define _CNCONB_w_MASK                           0xFFFFFFFF */
/* #define _CNCONB_w_LENGTH                         0x00000020 */

/* #define _CNENB_CNIEB0_POSITION                   0x00000000 */
/* #define _CNENB_CNIEB0_MASK                       0x00000001 */
/* #define _CNENB_CNIEB0_LENGTH                     0x00000001 */

/* #define _CNENB_CNIEB1_POSITION                   0x00000001 */
/* #define _CNENB_CNIEB1_MASK                       0x00000002 */
/* #define _CNENB_CNIEB1_LENGTH                     0x00000001 */

/* #define _CNENB_CNIEB2_POSITION                   0x00000002 */
/* #define _CNENB_CNIEB2_MASK                       0x00000004 */
/* #define _CNENB_CNIEB2_LENGTH                     0x00000001 */

/* #define _CNENB_CNIEB3_POSITION                   0x00000003 */
/* #define _CNENB_CNIEB3_MASK                       0x00000008 */
/* #define _CNENB_CNIEB3_LENGTH                     0x00000001 */

/* #define _CNENB_CNIEB4_POSITION                   0x00000004 */
/* #define _CNENB_CNIEB4_MASK                       0x00000010 */
/* #define _CNENB_CNIEB4_LENGTH                     0x00000001 */

/* #define _CNENB_CNIEB5_POSITION                   0x00000005 */
/* #define _CNENB_CNIEB5_MASK                       0x00000020 */
/* #define _CNENB_CNIEB5_LENGTH                     0x00000001 */

/* #define _CNENB_CNIEB6_POSITION                   0x00000006 */
/* #define _CNENB_CNIEB6_MASK                       0x00000040 */
/* #define _CNENB_CNIEB6_LENGTH                     0x00000001 */

/* #define _CNENB_CNIEB7_POSITION                   0x00000007 */
/* #define _CNENB_CNIEB7_MASK                       0x00000080 */
/* #define _CNENB_CNIEB7_LENGTH                     0x00000001 */

/* #define _CNENB_CNIEB8_POSITION                   0x00000008 */
/* #define _CNENB_CNIEB8_MASK                       0x00000100 */
/* #define _CNENB_CNIEB8_LENGTH                     0x00000001 */

/* #define _CNENB_CNIEB9_POSITION                   0x00000009 */
/* #define _CNENB_CNIEB9_MASK                       0x00000200 */
/* #define _CNENB_CNIEB9_LENGTH                     0x00000001 */

