rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _TRISC_TRISC14_POSITION                  0x0000000E */
/* #define _TRISC_TRISC14_MASK                      0x00004000 */
/* #define _TRISC_TRISC14_LENGTH                    0x00000001 */

/* #define _TRISC_TRISC15_POSITION                  0x0000000F */
/* #define _TRISC_TRISC15_MASK                      0x00008000 */
/* #define _TRISC_TRISC15_LENGTH                    0x00000001 */

/* #define _TRISC_w_POSITION                        0x00000000 */
/* #define _TRISC_w_MASK                            0xFFFFFFFF */
/* #define _TRISC_w_LENGTH                          0x00000020 */

/* #define _PORTC_RC12_POSITION                     0x0000000C */
/* #define _PORTC_RC12_MASK                         0x00001000 */
/* #define _PORTC_RC12_LENGTH                       0x00000001 */

/* #define _PORTC_RC13_POSITION                     0x0000000D */
/* #define _PORTC_RC13_MASK                         0x00002000 */
/* #define _PORTC_RC13_LENGTH                       0x00000001 */

/* #define _PORTC_RC14_POSITION                     0x0000000E */
/* #define _PORTC_RC14_MASK                         0x00004000 */
/* #define _PORTC_RC14_LENGTH                       0x00000001 */

/* #define _PORTC_RC15_POSITION                     0x0000000F */
/* #define _PORTC_RC15_MASK                         0x00008000 */
/* #define _PORTC_RC15_LENGTH                       0x00000001 */

/* #define _PORTC_w_POSITION                        0x00000000 */
/* #define _PORTC_w_MASK                            0xFFFFFFFF */
/* #define _PORTC_w_LENGTH                          0x00000020 */

/* #define _LATC_LATC12_POSITION                    0x0000000C */
/* #define _LATC_LATC12_MASK                        0x00001000 */
/* #define _LATC_LATC12_LENGTH                      0x00000001 */

/* #define _LATC_LATC13_POSITION                    0x0000000D */
/* #define _LATC_LATC13_MASK                        0x00002000 */
/* #define _LATC_LATC13_LENGTH                      0x00000001 */

/* #define _LATC_LATC14_POSITION                    0x0000000E */
/* #define _LATC_LATC14_MASK                        0x00004000 */
/* #define _LATC_LATC14_LENGTH                      0x00000001 */

/* #define _LATC_LATC15_POSITION                    0x0000000F */
/* #define _LATC_LATC15_MASK                        0x00008000 */
/* #define _LATC_LATC15_LENGTH                      0x00000001 */

/* #define _LATC_w_POSITION                         0x00000000 */
/* #define _LATC_w_MASK                             0xFFFFFFFF */
/* #define _LATC_w_LENGTH                           0x00000020 */

/* #define _ODCC_ODCC12_POSITION                    0x0000000C */
/* #define _ODCC_ODCC12_MASK                        0x00001000 */
/* #define _ODCC_ODCC12_LENGTH                      0x00000001 */

/* #define _ODCC_ODCC13_POSITION                    0x0000000D */
/* #define _ODCC_ODCC13_MASK                        0x00002000 */
/* #define _ODCC_ODCC13_LENGTH                      0x00000001 */

/* #define _ODCC_ODCC14_POSITION                    0x0000000E */
/* #define _ODCC_ODCC14_MASK                        0x00004000 */
/* #define _ODCC_ODCC14_LENGTH                      0x00000001 */

/* #define _ODCC_ODCC15_POSITION                    0x0000000F */
/* #define _ODCC_ODCC15_MASK                        0x00008000 */
/* #define _ODCC_ODCC15_LENGTH                      0x00000001 */

/* #define _ODCC_w_POSITION                         0x00000000 */
/* #define _ODCC_w_MASK                             0xFFFFFFFF */
/* #define _ODCC_w_LENGTH                           0x00000020 */

/* #define _CNPUC_CNPUC12_POSITION                  0x0000000C */
/* #define _CNPUC_CNPUC12_MASK                      0x00001000 */
/* #define _CNPUC_CNPUC12_LENGTH                    0x00000001 */

/* #define _CNPUC_CNPUC13_POSITION                  0x0000000D */
/* #define _CNPUC_CNPUC13_MASK                      0x00002000 */
/* #define _CNPUC_CNPUC13_LENGTH                    0x00000001 */

/* #define _CNPUC_CNPUC14_POSITION                  0x0000000E */
/* #define _CNPUC_CNPUC14_MASK                      0x00004000 */
/* #define _CNPUC_CNPUC14_LENGTH                    0x00000001 */

/* #define _CNPUC_CNPUC15_POSITION                  0x0000000F */
/* #define _CNPUC_CNPUC15_MASK                      0x00008000 */
/* #define _CNPUC_CNPUC15_LENGTH                    0x00000001 */

/* #define _CNPUC_w_POSITION                        0x00000000 */
/* #define _CNPUC_w_MASK                            0xFFFFFFFF */
/* #define _CNPUC_w_LENGTH                          0x00000020 */

/* #define _CNPDC_CNPDC12_POSITION                  0x0000000C */
/* #define _CNPDC_CNPDC12_MASK                      0x00001000 */
/* #define _CNPDC_CNPDC12_LENGTH                    0x00000001 */

/* #define _CNPDC_CNPDC13_POSITION                  0x0000000D */
/* #define _CNPDC_CNPDC13_MASK                      0x00002000 */
/* #define _CNPDC_CNPDC13_LENGTH                    0x00000001 */

/* #define _CNPDC_CNPDC14_POSITION                  0x0000000E */
/* #define _CNPDC_CNPDC14_MASK                      0x00004000 */
/* #define _CNPDC_CNPDC14_LENGTH                    0x00000001 */

/* #define _CNPDC_CNPDC15_POSITION                  0x0000000F */
/* #define _CNPDC_CNPDC15_MASK                      0x00008000 */
/* #define _CNPDC_CNPDC15_LENGTH                    0x00000001 */

/* #define _CNPDC_w_POSITION                        0x00000000 */
/* #define _CNPDC_w_MASK                            0xFFFFFFFF */
/* #define _CNPDC_w_LENGTH                          0x00000020 */

/* #define _CNCONC_SIDL_POSITION                    0x0000000D */
/* #define _CNCONC_SIDL_MASK                        0x00002000 */
/* #define _CNCONC_SIDL_LENGTH                      0x00000001 */

/* #define _CNCONC_ON_POSITION                      0x0000000F */
/* #define _CNCONC_ON_MASK                          0x00008000 */
/* #define _CNCONC_ON_LENGTH                        0x00000001 */

/* #define _CNCONC_w_POSITION                       0x00000000 */
/* #define _CNCONC_w_MASK                           0xFFFFFFFF */
/* #define _CNCONC_w_LENGTH                         0x00000020 */

