rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _CNENC_CNIEC12_POSITION                  0x0000000C */
/* #define _CNENC_CNIEC12_MASK                      0x00001000 */
/* #define _CNENC_CNIEC12_LENGTH                    0x00000001 */

/* #define _CNENC_CNIEC13_POSITION                  0x0000000D */
/* #define _CNENC_CNIEC13_MASK                      0x00002000 */
/* #define _CNENC_CNIEC13_LENGTH                    0x00000001 */

/* #define _CNENC_CNIEC14_POSITION                  0x0000000E */
/* #define _CNENC_CNIEC14_MASK                      0x00004000 */
/* #define _CNENC_CNIEC14_LENGTH                    0x00000001 */

/* #define _CNENC_CNIEC15_POSITION                  0x0000000F */
/* #define _CNENC_CNIEC15_MASK                      0x00008000 */
/* #define _CNENC_CNIEC15_LENGTH                    0x00000001 */

/* #define _CNENC_w_POSITION                        0x00000000 */
/* #define _CNENC_w_MASK                            0xFFFFFFFF */
/* #define _CNENC_w_LENGTH                          0x00000020 */

/* #define _CNSTATC_CNSTATC12_POSITION              0x0000000C */
/* #define _CNSTATC_CNSTATC12_MASK                  0x00001000 */
/* #define _CNSTATC_CNSTATC12_LENGTH                0x00000001 */

/* #define _CNSTATC_CNSTATC13_POSITION              0x0000000D */
/* #define _CNSTATC_CNSTATC13_MASK                  0x00002000 */
/* #define _CNSTATC_CNSTATC13_LENGTH                0x00000001 */

/* #define _CNSTATC_CNSTATC14_POSITION              0x0000000E */
/* #define _CNSTATC_CNSTATC14_MASK                  0x00004000 */
/* #define _CNSTATC_CNSTATC14_LENGTH                0x00000001 */

/* #define _CNSTATC_CNSTATC15_POSITION              0x0000000F */
/* #define _CNSTATC_CNSTATC15_MASK                  0x00008000 */
/* #define _CNSTATC_CNSTATC15_LENGTH                0x00000001 */

/* #define _CNSTATC_w_POSITION                      0x00000000 */
/* #define _CNSTATC_w_MASK                          0xFFFFFFFF */
/* #define _CNSTATC_w_LENGTH                        0x00000020 */

/* #define _ANSELD_ANSD1_POSITION                   0x00000001 */
/* #define _ANSELD_ANSD1_MASK                       0x00000002 */
/* #define _ANSELD_ANSD1_LENGTH                     0x00000001 */

/* #define _ANSELD_ANSD2_POSITION                   0x00000002 */
/* #define _ANSELD_ANSD2_MASK                       0x00000004 */
/* #define _ANSELD_ANSD2_LENGTH                     0x00000001 */

/* #define _ANSELD_ANSD3_POSITION                   0x00000003 */
/* #define _ANSELD_ANSD3_MASK                       0x00000008 */
/* #define _ANSELD_ANSD3_LENGTH                     0x00000001 */

/* #define _ANSELD_w_POSITION                       0x00000000 */
/* #define _ANSELD_w_MASK                           0xFFFFFFFF */
/* #define _ANSELD_w_LENGTH                         0x00000020 */

/* #define _TRISD_TRISD0_POSITION                   0x00000000 */
/* #define _TRISD_TRISD0_MASK                       0x00000001 */
/* #define _TRISD_TRISD0_LENGTH                     0x00000001 */

/* #define _TRISD_TRISD1_POSITION                   0x00000001 */
/* #define _TRISD_TRISD1_MASK                       0x00000002 */
/* #define _TRISD_TRISD1_LENGTH                     0x00000001 */

/* #define _TRISD_TRISD2_POSITION                   0x00000002 */
/* #define _TRISD_TRISD2_MASK                       0x00000004 */
/* #define _TRISD_TRISD2_LENGTH                     0x00000001 */

/* #define _TRISD_TRISD3_POSITION                   0x00000003 */
/* #define _TRISD_TRISD3_MASK                       0x00000008 */
/* #define _TRISD_TRISD3_LENGTH                     0x00000001 */

/* #define _TRISD_TRISD4_POSITION                   0x00000004 */
/* #define _TRISD_TRISD4_MASK                       0x00000010 */
/* #define _TRISD_TRISD4_LENGTH                     0x00000001 */

/* #define _TRISD_TRISD5_POSITION                   0x00000005 */
/* #define _TRISD_TRISD5_MASK                       0x00000020 */
/* #define _TRISD_TRISD5_LENGTH                     0x00000001 */

/* #define _TRISD_TRISD6_POSITION                   0x00000006 */
/* #define _TRISD_TRISD6_MASK                       0x00000040 */
/* #define _TRISD_TRISD6_LENGTH                     0x00000001 */

/* #define _TRISD_TRISD7_POSITION                   0x00000007 */
/* #define _TRISD_TRISD7_MASK                       0x00000080 */
/* #define _TRISD_TRISD7_LENGTH                     0x00000001 */

/* #define _TRISD_TRISD8_POSITION                   0x00000008 */
/* #define _TRISD_TRISD8_MASK                       0x00000100 */
/* #define _TRISD_TRISD8_LENGTH                     0x00000001 */

/* #define _TRISD_TRISD9_POSITION                   0x00000009 */
/* #define _TRISD_TRISD9_MASK                       0x00000200 */
/* #define _TRISD_TRISD9_LENGTH                     0x00000001 */

/* #define _TRISD_TRISD10_POSITION                  0x0000000A */
/* #define _TRISD_TRISD10_MASK                      0x00000400 */
/* #define _TRISD_TRISD10_LENGTH                    0x00000001 */

/* #define _TRISD_TRISD11_POSITION                  0x0000000B */
/* #define _TRISD_TRISD11_MASK                      0x00000800 */
/* #define _TRISD_TRISD11_LENGTH                    0x00000001 */

/* #define _TRISD_w_POSITION                        0x00000000 */
/* #define _TRISD_w_MASK                            0xFFFFFFFF */
/* #define _TRISD_w_LENGTH                          0x00000020 */

/* #define _PORTD_RD0_POSITION                      0x00000000 */
/* #define _PORTD_RD0_MASK                          0x00000001 */
/* #define _PORTD_RD0_LENGTH                        0x00000001 */

/* #define _PORTD_RD1_POSITION                      0x00000001 */
/* #define _PORTD_RD1_MASK                          0x00000002 */
/* #define _PORTD_RD1_LENGTH                        0x00000001 */

/* #define _PORTD_RD2_POSITION                      0x00000002 */
/* #define _PORTD_RD2_MASK                          0x00000004 */
/* #define _PORTD_RD2_LENGTH                        0x00000001 */

/* #define _PORTD_RD3_POSITION                      0x00000003 */
/* #define _PORTD_RD3_MASK                          0x00000008 */
/* #define _PORTD_RD3_LENGTH                        0x00000001 */

