rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _PORTD_RD4_POSITION                      0x00000004 */
/* #define _PORTD_RD4_MASK                          0x00000010 */
/* #define _PORTD_RD4_LENGTH                        0x00000001 */

/* #define _PORTD_RD5_POSITION                      0x00000005 */
/* #define _PORTD_RD5_MASK                          0x00000020 */
/* #define _PORTD_RD5_LENGTH                        0x00000001 */

/* #define _PORTD_RD6_POSITION                      0x00000006 */
/* #define _PORTD_RD6_MASK                          0x00000040 */
/* #define _PORTD_RD6_LENGTH                        0x00000001 */

/* #define _PORTD_RD7_POSITION                      0x00000007 */
/* #define _PORTD_RD7_MASK                          0x00000080 */
/* #define _PORTD_RD7_LENGTH                        0x00000001 */

/* #define _PORTD_RD8_POSITION                      0x00000008 */
/* #define _PORTD_RD8_MASK                          0x00000100 */
/* #define _PORTD_RD8_LENGTH                        0x00000001 */

/* #define _PORTD_RD9_POSITION                      0x00000009 */
/* #define _PORTD_RD9_MASK                          0x00000200 */
/* #define _PORTD_RD9_LENGTH                        0x00000001 */

/* #define _PORTD_RD10_POSITION                     0x0000000A */
/* #define _PORTD_RD10_MASK                         0x00000400 */
/* #define _PORTD_RD10_LENGTH                       0x00000001 */

/* #define _PORTD_RD11_POSITION                     0x0000000B */
/* #define _PORTD_RD11_MASK                         0x00000800 */
/* #define _PORTD_RD11_LENGTH                       0x00000001 */

/* #define _PORTD_w_POSITION                        0x00000000 */
/* #define _PORTD_w_MASK                            0xFFFFFFFF */
/* #define _PORTD_w_LENGTH                          0x00000020 */

/* #define _LATD_LATD0_POSITION                     0x00000000 */
/* #define _LATD_LATD0_MASK                         0x00000001 */
/* #define _LATD_LATD0_LENGTH                       0x00000001 */

/* #define _LATD_LATD1_POSITION                     0x00000001 */
/* #define _LATD_LATD1_MASK                         0x00000002 */
/* #define _LATD_LATD1_LENGTH                       0x00000001 */

/* #define _LATD_LATD2_POSITION                     0x00000002 */
/* #define _LATD_LATD2_MASK                         0x00000004 */
/* #define _LATD_LATD2_LENGTH                       0x00000001 */

/* #define _LATD_LATD3_POSITION                     0x00000003 */
/* #define _LATD_LATD3_MASK                         0x00000008 */
/* #define _LATD_LATD3_LENGTH                       0x00000001 */

/* #define _LATD_LATD4_POSITION                     0x00000004 */
/* #define _LATD_LATD4_MASK                         0x00000010 */
/* #define _LATD_LATD4_LENGTH                       0x00000001 */

/* #define _LATD_LATD5_POSITION                     0x00000005 */
/* #define _LATD_LATD5_MASK                         0x00000020 */
/* #define _LATD_LATD5_LENGTH                       0x00000001 */

/* #define _LATD_LATD6_POSITION                     0x00000006 */
/* #define _LATD_LATD6_MASK                         0x00000040 */
/* #define _LATD_LATD6_LENGTH                       0x00000001 */

/* #define _LATD_LATD7_POSITION                     0x00000007 */
/* #define _LATD_LATD7_MASK                         0x00000080 */
/* #define _LATD_LATD7_LENGTH                       0x00000001 */

/* #define _LATD_LATD8_POSITION                     0x00000008 */
/* #define _LATD_LATD8_MASK                         0x00000100 */
/* #define _LATD_LATD8_LENGTH                       0x00000001 */

/* #define _LATD_LATD9_POSITION                     0x00000009 */
/* #define _LATD_LATD9_MASK                         0x00000200 */
/* #define _LATD_LATD9_LENGTH                       0x00000001 */

/* #define _LATD_LATD10_POSITION                    0x0000000A */
/* #define _LATD_LATD10_MASK                        0x00000400 */
/* #define _LATD_LATD10_LENGTH                      0x00000001 */

/* #define _LATD_LATD11_POSITION                    0x0000000B */
/* #define _LATD_LATD11_MASK                        0x00000800 */
/* #define _LATD_LATD11_LENGTH                      0x00000001 */

/* #define _LATD_w_POSITION                         0x00000000 */
/* #define _LATD_w_MASK                             0xFFFFFFFF */
/* #define _LATD_w_LENGTH                           0x00000020 */

/* #define _ODCD_ODCD0_POSITION                     0x00000000 */
/* #define _ODCD_ODCD0_MASK                         0x00000001 */
/* #define _ODCD_ODCD0_LENGTH                       0x00000001 */

/* #define _ODCD_ODCD1_POSITION                     0x00000001 */
/* #define _ODCD_ODCD1_MASK                         0x00000002 */
/* #define _ODCD_ODCD1_LENGTH                       0x00000001 */

/* #define _ODCD_ODCD2_POSITION                     0x00000002 */
/* #define _ODCD_ODCD2_MASK                         0x00000004 */
/* #define _ODCD_ODCD2_LENGTH                       0x00000001 */

/* #define _ODCD_ODCD3_POSITION                     0x00000003 */
/* #define _ODCD_ODCD3_MASK                         0x00000008 */
/* #define _ODCD_ODCD3_LENGTH                       0x00000001 */

/* #define _ODCD_ODCD4_POSITION                     0x00000004 */
/* #define _ODCD_ODCD4_MASK                         0x00000010 */
/* #define _ODCD_ODCD4_LENGTH                       0x00000001 */

/* #define _ODCD_ODCD5_POSITION                     0x00000005 */
/* #define _ODCD_ODCD5_MASK                         0x00000020 */
/* #define _ODCD_ODCD5_LENGTH                       0x00000001 */

/* #define _ODCD_ODCD6_POSITION                     0x00000006 */
/* #define _ODCD_ODCD6_MASK                         0x00000040 */
/* #define _ODCD_ODCD6_LENGTH                       0x00000001 */

/* #define _ODCD_ODCD7_POSITION                     0x00000007 */
/* #define _ODCD_ODCD7_MASK                         0x00000080 */
/* #define _ODCD_ODCD7_LENGTH                       0x00000001 */

/* #define _ODCD_ODCD8_POSITION                     0x00000008 */
/* #define _ODCD_ODCD8_MASK                         0x00000100 */
/* #define _ODCD_ODCD8_LENGTH                       0x00000001 */

