rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _ODCD_ODCD9_POSITION                     0x00000009 */
/* #define _ODCD_ODCD9_MASK                         0x00000200 */
/* #define _ODCD_ODCD9_LENGTH                       0x00000001 */

/* #define _ODCD_ODCD10_POSITION                    0x0000000A */
/* #define _ODCD_ODCD10_MASK                        0x00000400 */
/* #define _ODCD_ODCD10_LENGTH                      0x00000001 */

/* #define _ODCD_ODCD11_POSITION                    0x0000000B */
/* #define _ODCD_ODCD11_MASK                        0x00000800 */
/* #define _ODCD_ODCD11_LENGTH                      0x00000001 */

/* #define _ODCD_w_POSITION                         0x00000000 */
/* #define _ODCD_w_MASK                             0xFFFFFFFF */
/* #define _ODCD_w_LENGTH                           0x00000020 */

/* #define _CNPUD_CNPUD0_POSITION                   0x00000000 */
/* #define _CNPUD_CNPUD0_MASK                       0x00000001 */
/* #define _CNPUD_CNPUD0_LENGTH                     0x00000001 */

/* #define _CNPUD_CNPUD1_POSITION                   0x00000001 */
/* #define _CNPUD_CNPUD1_MASK                       0x00000002 */
/* #define _CNPUD_CNPUD1_LENGTH                     0x00000001 */

/* #define _CNPUD_CNPUD2_POSITION                   0x00000002 */
/* #define _CNPUD_CNPUD2_MASK                       0x00000004 */
/* #define _CNPUD_CNPUD2_LENGTH                     0x00000001 */

/* #define _CNPUD_CNPUD3_POSITION                   0x00000003 */
/* #define _CNPUD_CNPUD3_MASK                       0x00000008 */
/* #define _CNPUD_CNPUD3_LENGTH                     0x00000001 */

/* #define _CNPUD_CNPUD4_POSITION                   0x00000004 */
/* #define _CNPUD_CNPUD4_MASK                       0x00000010 */
/* #define _CNPUD_CNPUD4_LENGTH                     0x00000001 */

/* #define _CNPUD_CNPUD5_POSITION                   0x00000005 */
/* #define _CNPUD_CNPUD5_MASK                       0x00000020 */
/* #define _CNPUD_CNPUD5_LENGTH                     0x00000001 */

/* #define _CNPUD_CNPUD6_POSITION                   0x00000006 */
/* #define _CNPUD_CNPUD6_MASK                       0x00000040 */
/* #define _CNPUD_CNPUD6_LENGTH                     0x00000001 */

/* #define _CNPUD_CNPUD7_POSITION                   0x00000007 */
/* #define _CNPUD_CNPUD7_MASK                       0x00000080 */
/* #define _CNPUD_CNPUD7_LENGTH                     0x00000001 */

/* #define _CNPUD_CNPUD8_POSITION                   0x00000008 */
/* #define _CNPUD_CNPUD8_MASK                       0x00000100 */
/* #define _CNPUD_CNPUD8_LENGTH                     0x00000001 */

/* #define _CNPUD_CNPUD9_POSITION                   0x00000009 */
/* #define _CNPUD_CNPUD9_MASK                       0x00000200 */
/* #define _CNPUD_CNPUD9_LENGTH                     0x00000001 */

/* #define _CNPUD_CNPUD10_POSITION                  0x0000000A */
/* #define _CNPUD_CNPUD10_MASK                      0x00000400 */
/* #define _CNPUD_CNPUD10_LENGTH                    0x00000001 */

/* #define _CNPUD_CNPUD11_POSITION                  0x0000000B */
/* #define _CNPUD_CNPUD11_MASK                      0x00000800 */
/* #define _CNPUD_CNPUD11_LENGTH                    0x00000001 */

/* #define _CNPUD_w_POSITION                        0x00000000 */
/* #define _CNPUD_w_MASK                            0xFFFFFFFF */
/* #define _CNPUD_w_LENGTH                          0x00000020 */

/* #define _CNPDD_CNPDD0_POSITION                   0x00000000 */
/* #define _CNPDD_CNPDD0_MASK                       0x00000001 */
/* #define _CNPDD_CNPDD0_LENGTH                     0x00000001 */

/* #define _CNPDD_CNPDD1_POSITION                   0x00000001 */
/* #define _CNPDD_CNPDD1_MASK                       0x00000002 */
/* #define _CNPDD_CNPDD1_LENGTH                     0x00000001 */

/* #define _CNPDD_CNPDD2_POSITION                   0x00000002 */
/* #define _CNPDD_CNPDD2_MASK                       0x00000004 */
/* #define _CNPDD_CNPDD2_LENGTH                     0x00000001 */

/* #define _CNPDD_CNPDD3_POSITION                   0x00000003 */
/* #define _CNPDD_CNPDD3_MASK                       0x00000008 */
/* #define _CNPDD_CNPDD3_LENGTH                     0x00000001 */

/* #define _CNPDD_CNPDD4_POSITION                   0x00000004 */
/* #define _CNPDD_CNPDD4_MASK                       0x00000010 */
/* #define _CNPDD_CNPDD4_LENGTH                     0x00000001 */

/* #define _CNPDD_CNPDD5_POSITION                   0x00000005 */
/* #define _CNPDD_CNPDD5_MASK                       0x00000020 */
/* #define _CNPDD_CNPDD5_LENGTH                     0x00000001 */

/* #define _CNPDD_CNPDD6_POSITION                   0x00000006 */
/* #define _CNPDD_CNPDD6_MASK                       0x00000040 */
/* #define _CNPDD_CNPDD6_LENGTH                     0x00000001 */

/* #define _CNPDD_CNPDD7_POSITION                   0x00000007 */
/* #define _CNPDD_CNPDD7_MASK                       0x00000080 */
/* #define _CNPDD_CNPDD7_LENGTH                     0x00000001 */

/* #define _CNPDD_CNPDD8_POSITION                   0x00000008 */
/* #define _CNPDD_CNPDD8_MASK                       0x00000100 */
/* #define _CNPDD_CNPDD8_LENGTH                     0x00000001 */

/* #define _CNPDD_CNPDD9_POSITION                   0x00000009 */
/* #define _CNPDD_CNPDD9_MASK                       0x00000200 */
/* #define _CNPDD_CNPDD9_LENGTH                     0x00000001 */

/* #define _CNPDD_CNPDD10_POSITION                  0x0000000A */
/* #define _CNPDD_CNPDD10_MASK                      0x00000400 */
/* #define _CNPDD_CNPDD10_LENGTH                    0x00000001 */

/* #define _CNPDD_CNPDD11_POSITION                  0x0000000B */
/* #define _CNPDD_CNPDD11_MASK                      0x00000800 */
/* #define _CNPDD_CNPDD11_LENGTH                    0x00000001 */

/* #define _CNPDD_w_POSITION                        0x00000000 */
/* #define _CNPDD_w_MASK                            0xFFFFFFFF */
/* #define _CNPDD_w_LENGTH                          0x00000020 */

/* #define _CNCOND_SIDL_POSITION                    0x0000000D */
/* #define _CNCOND_SIDL_MASK                        0x00002000 */
/* #define _CNCOND_SIDL_LENGTH                      0x00000001 */

/* #define _CNCOND_ON_POSITION                      0x0000000F */
/* #define _CNCOND_ON_MASK                          0x00008000 */
/* #define _CNCOND_ON_LENGTH                        0x00000001 */

/* #define _CNCOND_w_POSITION                       0x00000000 */
/* #define _CNCOND_w_MASK                           0xFFFFFFFF */
/* #define _CNCOND_w_LENGTH                         0x00000020 */

