rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _CNEND_CNIED0_POSITION                   0x00000000 */
/* #define _CNEND_CNIED0_MASK                       0x00000001 */
/* #define _CNEND_CNIED0_LENGTH                     0x00000001 */

/* #define _CNEND_CNIED1_POSITION                   0x00000001 */
/* #define _CNEND_CNIED1_MASK                       0x00000002 */
/* #define _CNEND_CNIED1_LENGTH                     0x00000001 */

/* #define _CNEND_CNIED2_POSITION                   0x00000002 */
/* #define _CNEND_CNIED2_MASK                       0x00000004 */
/* #define _CNEND_CNIED2_LENGTH                     0x00000001 */

/* #define _CNEND_CNIED3_POSITION                   0x00000003 */
/* #define _CNEND_CNIED3_MASK                       0x00000008 */
/* #define _CNEND_CNIED3_LENGTH                     0x00000001 */

/* #define _CNEND_CNIED4_POSITION                   0x00000004 */
/* #define _CNEND_CNIED4_MASK                       0x00000010 */
/* #define _CNEND_CNIED4_LENGTH                     0x00000001 */

/* #define _CNEND_CNIED5_POSITION                   0x00000005 */
/* #define _CNEND_CNIED5_MASK                       0x00000020 */
/* #define _CNEND_CNIED5_LENGTH                     0x00000001 */

/* #define _CNEND_CNIED6_POSITION                   0x00000006 */
/* #define _CNEND_CNIED6_MASK                       0x00000040 */
/* #define _CNEND_CNIED6_LENGTH                     0x00000001 */

/* #define _CNEND_CNIED7_POSITION                   0x00000007 */
/* #define _CNEND_CNIED7_MASK                       0x00000080 */
/* #define _CNEND_CNIED7_LENGTH                     0x00000001 */

/* #define _CNEND_CNIED8_POSITION                   0x00000008 */
/* #define _CNEND_CNIED8_MASK                       0x00000100 */
/* #define _CNEND_CNIED8_LENGTH                     0x00000001 */

/* #define _CNEND_CNIED9_POSITION                   0x00000009 */
/* #define _CNEND_CNIED9_MASK                       0x00000200 */
/* #define _CNEND_CNIED9_LENGTH                     0x00000001 */

/* #define _CNEND_CNIED10_POSITION                  0x0000000A */
/* #define _CNEND_CNIED10_MASK                      0x00000400 */
/* #define _CNEND_CNIED10_LENGTH                    0x00000001 */

/* #define _CNEND_CNIED11_POSITION                  0x0000000B */
/* #define _CNEND_CNIED11_MASK                      0x00000800 */
/* #define _CNEND_CNIED11_LENGTH                    0x00000001 */

/* #define _CNEND_w_POSITION                        0x00000000 */
/* #define _CNEND_w_MASK                            0xFFFFFFFF */
/* #define _CNEND_w_LENGTH                          0x00000020 */

/* #define _CNSTATD_CNSTATD0_POSITION               0x00000000 */
/* #define _CNSTATD_CNSTATD0_MASK                   0x00000001 */
/* #define _CNSTATD_CNSTATD0_LENGTH                 0x00000001 */

/* #define _CNSTATD_CNSTATD1_POSITION               0x00000001 */
/* #define _CNSTATD_CNSTATD1_MASK                   0x00000002 */
/* #define _CNSTATD_CNSTATD1_LENGTH                 0x00000001 */

/* #define _CNSTATD_CNSTATD2_POSITION               0x00000002 */
/* #define _CNSTATD_CNSTATD2_MASK                   0x00000004 */
/* #define _CNSTATD_CNSTATD2_LENGTH                 0x00000001 */

/* #define _CNSTATD_CNSTATD3_POSITION               0x00000003 */
/* #define _CNSTATD_CNSTATD3_MASK                   0x00000008 */
/* #define _CNSTATD_CNSTATD3_LENGTH                 0x00000001 */

/* #define _CNSTATD_CNSTATD4_POSITION               0x00000004 */
/* #define _CNSTATD_CNSTATD4_MASK                   0x00000010 */
/* #define _CNSTATD_CNSTATD4_LENGTH                 0x00000001 */

/* #define _CNSTATD_CNSTATD5_POSITION               0x00000005 */
/* #define _CNSTATD_CNSTATD5_MASK                   0x00000020 */
/* #define _CNSTATD_CNSTATD5_LENGTH                 0x00000001 */

/* #define _CNSTATD_CNSTATD6_POSITION               0x00000006 */
/* #define _CNSTATD_CNSTATD6_MASK                   0x00000040 */
/* #define _CNSTATD_CNSTATD6_LENGTH                 0x00000001 */

/* #define _CNSTATD_CNSTATD7_POSITION               0x00000007 */
/* #define _CNSTATD_CNSTATD7_MASK                   0x00000080 */
/* #define _CNSTATD_CNSTATD7_LENGTH                 0x00000001 */

/* #define _CNSTATD_CNSTATD8_POSITION               0x00000008 */
/* #define _CNSTATD_CNSTATD8_MASK                   0x00000100 */
/* #define _CNSTATD_CNSTATD8_LENGTH                 0x00000001 */

/* #define _CNSTATD_CNSTATD9_POSITION               0x00000009 */
/* #define _CNSTATD_CNSTATD9_MASK                   0x00000200 */
/* #define _CNSTATD_CNSTATD9_LENGTH                 0x00000001 */

/* #define _CNSTATD_CNSTATD10_POSITION              0x0000000A */
/* #define _CNSTATD_CNSTATD10_MASK                  0x00000400 */
/* #define _CNSTATD_CNSTATD10_LENGTH                0x00000001 */

/* #define _CNSTATD_CNSTATD11_POSITION              0x0000000B */
/* #define _CNSTATD_CNSTATD11_MASK                  0x00000800 */
/* #define _CNSTATD_CNSTATD11_LENGTH                0x00000001 */

/* #define _CNSTATD_w_POSITION                      0x00000000 */
/* #define _CNSTATD_w_MASK                          0xFFFFFFFF */
/* #define _CNSTATD_w_LENGTH                        0x00000020 */

/* #define _ANSELE_ANSE2_POSITION                   0x00000002 */
/* #define _ANSELE_ANSE2_MASK                       0x00000004 */
/* #define _ANSELE_ANSE2_LENGTH                     0x00000001 */

/* #define _ANSELE_ANSE4_POSITION                   0x00000004 */
/* #define _ANSELE_ANSE4_MASK                       0x00000010 */
/* #define _ANSELE_ANSE4_LENGTH                     0x00000001 */

/* #define _ANSELE_ANSE5_POSITION                   0x00000005 */
/* #define _ANSELE_ANSE5_MASK                       0x00000020 */
/* #define _ANSELE_ANSE5_LENGTH                     0x00000001 */

/* #define _ANSELE_ANSE6_POSITION                   0x00000006 */
/* #define _ANSELE_ANSE6_MASK                       0x00000040 */
/* #define _ANSELE_ANSE6_LENGTH                     0x00000001 */

/* #define _ANSELE_ANSE7_POSITION                   0x00000007 */
/* #define _ANSELE_ANSE7_MASK                       0x00000080 */
/* #define _ANSELE_ANSE7_LENGTH                     0x00000001 */

/* #define _ANSELE_w_POSITION                       0x00000000 */
/* #define _ANSELE_w_MASK                           0xFFFFFFFF */
/* #define _ANSELE_w_LENGTH                         0x00000020 */

/* #define _TRISE_TRISE0_POSITION                   0x00000000 */
/* #define _TRISE_TRISE0_MASK                       0x00000001 */
/* #define _TRISE_TRISE0_LENGTH                     0x00000001 */

/* #define _TRISE_TRISE1_POSITION                   0x00000001 */
/* #define _TRISE_TRISE1_MASK                       0x00000002 */
/* #define _TRISE_TRISE1_LENGTH                     0x00000001 */

/* #define _TRISE_TRISE2_POSITION                   0x00000002 */
/* #define _TRISE_TRISE2_MASK                       0x00000004 */
/* #define _TRISE_TRISE2_LENGTH                     0x00000001 */

