rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _TRISE_TRISE3_POSITION                   0x00000003 */
/* #define _TRISE_TRISE3_MASK                       0x00000008 */
/* #define _TRISE_TRISE3_LENGTH                     0x00000001 */

/* #define _TRISE_TRISE4_POSITION                   0x00000004 */
/* #define _TRISE_TRISE4_MASK                       0x00000010 */
/* #define _TRISE_TRISE4_LENGTH                     0x00000001 */

/* #define _TRISE_TRISE5_POSITION                   0x00000005 */
/* #define _TRISE_TRISE5_MASK                       0x00000020 */
/* #define _TRISE_TRISE5_LENGTH                     0x00000001 */

/* #define _TRISE_TRISE6_POSITION                   0x00000006 */
/* #define _TRISE_TRISE6_MASK                       0x00000040 */
/* #define _TRISE_TRISE6_LENGTH                     0x00000001 */

/* #define _TRISE_TRISE7_POSITION                   0x00000007 */
/* #define _TRISE_TRISE7_MASK                       0x00000080 */
/* #define _TRISE_TRISE7_LENGTH                     0x00000001 */

/* #define _TRISE_w_POSITION                        0x00000000 */
/* #define _TRISE_w_MASK                            0xFFFFFFFF */
/* #define _TRISE_w_LENGTH                          0x00000020 */

/* #define _PORTE_RE0_POSITION                      0x00000000 */
/* #define _PORTE_RE0_MASK                          0x00000001 */
/* #define _PORTE_RE0_LENGTH                        0x00000001 */

/* #define _PORTE_RE1_POSITION                      0x00000001 */
/* #define _PORTE_RE1_MASK                          0x00000002 */
/* #define _PORTE_RE1_LENGTH                        0x00000001 */

/* #define _PORTE_RE2_POSITION                      0x00000002 */
/* #define _PORTE_RE2_MASK                          0x00000004 */
/* #define _PORTE_RE2_LENGTH                        0x00000001 */

/* #define _PORTE_RE3_POSITION                      0x00000003 */
/* #define _PORTE_RE3_MASK                          0x00000008 */
/* #define _PORTE_RE3_LENGTH                        0x00000001 */

/* #define _PORTE_RE4_POSITION                      0x00000004 */
/* #define _PORTE_RE4_MASK                          0x00000010 */
/* #define _PORTE_RE4_LENGTH                        0x00000001 */

/* #define _PORTE_RE5_POSITION                      0x00000005 */
/* #define _PORTE_RE5_MASK                          0x00000020 */
/* #define _PORTE_RE5_LENGTH                        0x00000001 */

/* #define _PORTE_RE6_POSITION                      0x00000006 */
/* #define _PORTE_RE6_MASK                          0x00000040 */
/* #define _PORTE_RE6_LENGTH                        0x00000001 */

/* #define _PORTE_RE7_POSITION                      0x00000007 */
/* #define _PORTE_RE7_MASK                          0x00000080 */
/* #define _PORTE_RE7_LENGTH                        0x00000001 */

/* #define _PORTE_w_POSITION                        0x00000000 */
/* #define _PORTE_w_MASK                            0xFFFFFFFF */
/* #define _PORTE_w_LENGTH                          0x00000020 */

/* #define _LATE_LATE0_POSITION                     0x00000000 */
/* #define _LATE_LATE0_MASK                         0x00000001 */
/* #define _LATE_LATE0_LENGTH                       0x00000001 */

/* #define _LATE_LATE1_POSITION                     0x00000001 */
/* #define _LATE_LATE1_MASK                         0x00000002 */
/* #define _LATE_LATE1_LENGTH                       0x00000001 */

/* #define _LATE_LATE2_POSITION                     0x00000002 */
/* #define _LATE_LATE2_MASK                         0x00000004 */
/* #define _LATE_LATE2_LENGTH                       0x00000001 */

/* #define _LATE_LATE3_POSITION                     0x00000003 */
/* #define _LATE_LATE3_MASK                         0x00000008 */
/* #define _LATE_LATE3_LENGTH                       0x00000001 */

/* #define _LATE_LATE4_POSITION                     0x00000004 */
/* #define _LATE_LATE4_MASK                         0x00000010 */
/* #define _LATE_LATE4_LENGTH                       0x00000001 */

/* #define _LATE_LATE5_POSITION                     0x00000005 */
/* #define _LATE_LATE5_MASK                         0x00000020 */
/* #define _LATE_LATE5_LENGTH                       0x00000001 */

/* #define _LATE_LATE6_POSITION                     0x00000006 */
/* #define _LATE_LATE6_MASK                         0x00000040 */
/* #define _LATE_LATE6_LENGTH                       0x00000001 */

/* #define _LATE_LATE7_POSITION                     0x00000007 */
/* #define _LATE_LATE7_MASK                         0x00000080 */
/* #define _LATE_LATE7_LENGTH                       0x00000001 */

/* #define _LATE_w_POSITION                         0x00000000 */
/* #define _LATE_w_MASK                             0xFFFFFFFF */
/* #define _LATE_w_LENGTH                           0x00000020 */

/* #define _ODCE_ODCE0_POSITION                     0x00000000 */
/* #define _ODCE_ODCE0_MASK                         0x00000001 */
/* #define _ODCE_ODCE0_LENGTH                       0x00000001 */

/* #define _ODCE_ODCE1_POSITION                     0x00000001 */
/* #define _ODCE_ODCE1_MASK                         0x00000002 */
/* #define _ODCE_ODCE1_LENGTH                       0x00000001 */

/* #define _ODCE_ODCE2_POSITION                     0x00000002 */
/* #define _ODCE_ODCE2_MASK                         0x00000004 */
/* #define _ODCE_ODCE2_LENGTH                       0x00000001 */

/* #define _ODCE_ODCE3_POSITION                     0x00000003 */
/* #define _ODCE_ODCE3_MASK                         0x00000008 */
/* #define _ODCE_ODCE3_LENGTH                       0x00000001 */

/* #define _ODCE_ODCE4_POSITION                     0x00000004 */
/* #define _ODCE_ODCE4_MASK                         0x00000010 */
/* #define _ODCE_ODCE4_LENGTH                       0x00000001 */

/* #define _ODCE_ODCE5_POSITION                     0x00000005 */
/* #define _ODCE_ODCE5_MASK                         0x00000020 */
/* #define _ODCE_ODCE5_LENGTH                       0x00000001 */

/* #define _ODCE_ODCE6_POSITION                     0x00000006 */
/* #define _ODCE_ODCE6_MASK                         0x00000040 */
/* #define _ODCE_ODCE6_LENGTH                       0x00000001 */

/* #define _ODCE_ODCE7_POSITION                     0x00000007 */
/* #define _ODCE_ODCE7_MASK                         0x00000080 */
/* #define _ODCE_ODCE7_LENGTH                       0x00000001 */

/* #define _ODCE_w_POSITION                         0x00000000 */
/* #define _ODCE_w_MASK                             0xFFFFFFFF */
/* #define _ODCE_w_LENGTH                           0x00000020 */

/* #define _CNPUE_CNPUE0_POSITION                   0x00000000 */
/* #define _CNPUE_CNPUE0_MASK                       0x00000001 */
/* #define _CNPUE_CNPUE0_LENGTH                     0x00000001 */

/* #define _CNPUE_CNPUE1_POSITION                   0x00000001 */
/* #define _CNPUE_CNPUE1_MASK                       0x00000002 */
/* #define _CNPUE_CNPUE1_LENGTH                     0x00000001 */

/* #define _CNPUE_CNPUE2_POSITION                   0x00000002 */
/* #define _CNPUE_CNPUE2_MASK                       0x00000004 */
/* #define _CNPUE_CNPUE2_LENGTH                     0x00000001 */

