rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _CNPUE_CNPUE3_POSITION                   0x00000003 */
/* #define _CNPUE_CNPUE3_MASK                       0x00000008 */
/* #define _CNPUE_CNPUE3_LENGTH                     0x00000001 */

/* #define _CNPUE_CNPUE4_POSITION                   0x00000004 */
/* #define _CNPUE_CNPUE4_MASK                       0x00000010 */
/* #define _CNPUE_CNPUE4_LENGTH                     0x00000001 */

/* #define _CNPUE_CNPUE5_POSITION                   0x00000005 */
/* #define _CNPUE_CNPUE5_MASK                       0x00000020 */
/* #define _CNPUE_CNPUE5_LENGTH                     0x00000001 */

/* #define _CNPUE_CNPUE6_POSITION                   0x00000006 */
/* #define _CNPUE_CNPUE6_MASK                       0x00000040 */
/* #define _CNPUE_CNPUE6_LENGTH                     0x00000001 */

/* #define _CNPUE_CNPUE7_POSITION                   0x00000007 */
/* #define _CNPUE_CNPUE7_MASK                       0x00000080 */
/* #define _CNPUE_CNPUE7_LENGTH                     0x00000001 */

/* #define _CNPUE_w_POSITION                        0x00000000 */
/* #define _CNPUE_w_MASK                            0xFFFFFFFF */
/* #define _CNPUE_w_LENGTH                          0x00000020 */

/* #define _CNPDE_CNPDE0_POSITION                   0x00000000 */
/* #define _CNPDE_CNPDE0_MASK                       0x00000001 */
/* #define _CNPDE_CNPDE0_LENGTH                     0x00000001 */

/* #define _CNPDE_CNPDE1_POSITION                   0x00000001 */
/* #define _CNPDE_CNPDE1_MASK                       0x00000002 */
/* #define _CNPDE_CNPDE1_LENGTH                     0x00000001 */

/* #define _CNPDE_CNPDE2_POSITION                   0x00000002 */
/* #define _CNPDE_CNPDE2_MASK                       0x00000004 */
/* #define _CNPDE_CNPDE2_LENGTH                     0x00000001 */

/* #define _CNPDE_CNPDE3_POSITION                   0x00000003 */
/* #define _CNPDE_CNPDE3_MASK                       0x00000008 */
/* #define _CNPDE_CNPDE3_LENGTH                     0x00000001 */

/* #define _CNPDE_CNPDE4_POSITION                   0x00000004 */
/* #define _CNPDE_CNPDE4_MASK                       0x00000010 */
/* #define _CNPDE_CNPDE4_LENGTH                     0x00000001 */

/* #define _CNPDE_CNPDE5_POSITION                   0x00000005 */
/* #define _CNPDE_CNPDE5_MASK                       0x00000020 */
/* #define _CNPDE_CNPDE5_LENGTH                     0x00000001 */

/* #define _CNPDE_CNPDE6_POSITION                   0x00000006 */
/* #define _CNPDE_CNPDE6_MASK                       0x00000040 */
/* #define _CNPDE_CNPDE6_LENGTH                     0x00000001 */

/* #define _CNPDE_CNPDE7_POSITION                   0x00000007 */
/* #define _CNPDE_CNPDE7_MASK                       0x00000080 */
/* #define _CNPDE_CNPDE7_LENGTH                     0x00000001 */

/* #define _CNPDE_w_POSITION                        0x00000000 */
/* #define _CNPDE_w_MASK                            0xFFFFFFFF */
/* #define _CNPDE_w_LENGTH                          0x00000020 */

/* #define _CNCONE_SIDL_POSITION                    0x0000000D */
/* #define _CNCONE_SIDL_MASK                        0x00002000 */
/* #define _CNCONE_SIDL_LENGTH                      0x00000001 */

/* #define _CNCONE_ON_POSITION                      0x0000000F */
/* #define _CNCONE_ON_MASK                          0x00008000 */
/* #define _CNCONE_ON_LENGTH                        0x00000001 */

/* #define _CNCONE_w_POSITION                       0x00000000 */
/* #define _CNCONE_w_MASK                           0xFFFFFFFF */
/* #define _CNCONE_w_LENGTH                         0x00000020 */

/* #define _CNENE_CNIEE0_POSITION                   0x00000000 */
/* #define _CNENE_CNIEE0_MASK                       0x00000001 */
/* #define _CNENE_CNIEE0_LENGTH                     0x00000001 */

/* #define _CNENE_CNIEE1_POSITION                   0x00000001 */
/* #define _CNENE_CNIEE1_MASK                       0x00000002 */
/* #define _CNENE_CNIEE1_LENGTH                     0x00000001 */

/* #define _CNENE_CNIEE2_POSITION                   0x00000002 */
/* #define _CNENE_CNIEE2_MASK                       0x00000004 */
/* #define _CNENE_CNIEE2_LENGTH                     0x00000001 */

/* #define _CNENE_CNIEE3_POSITION                   0x00000003 */
/* #define _CNENE_CNIEE3_MASK                       0x00000008 */
/* #define _CNENE_CNIEE3_LENGTH                     0x00000001 */

/* #define _CNENE_CNIEE4_POSITION                   0x00000004 */
/* #define _CNENE_CNIEE4_MASK                       0x00000010 */
/* #define _CNENE_CNIEE4_LENGTH                     0x00000001 */

/* #define _CNENE_CNIEE5_POSITION                   0x00000005 */
/* #define _CNENE_CNIEE5_MASK                       0x00000020 */
/* #define _CNENE_CNIEE5_LENGTH                     0x00000001 */

/* #define _CNENE_CNIEE6_POSITION                   0x00000006 */
/* #define _CNENE_CNIEE6_MASK                       0x00000040 */
/* #define _CNENE_CNIEE6_LENGTH                     0x00000001 */

/* #define _CNENE_CNIEE7_POSITION                   0x00000007 */
/* #define _CNENE_CNIEE7_MASK                       0x00000080 */
/* #define _CNENE_CNIEE7_LENGTH                     0x00000001 */

/* #define _CNENE_w_POSITION                        0x00000000 */
/* #define _CNENE_w_MASK                            0xFFFFFFFF */
/* #define _CNENE_w_LENGTH                          0x00000020 */

/* #define _CNSTATE_CNSTATE0_POSITION               0x00000000 */
/* #define _CNSTATE_CNSTATE0_MASK                   0x00000001 */
/* #define _CNSTATE_CNSTATE0_LENGTH                 0x00000001 */

/* #define _CNSTATE_CNSTATE1_POSITION               0x00000001 */
/* #define _CNSTATE_CNSTATE1_MASK                   0x00000002 */
/* #define _CNSTATE_CNSTATE1_LENGTH                 0x00000001 */

/* #define _CNSTATE_CNSTATE2_POSITION               0x00000002 */
/* #define _CNSTATE_CNSTATE2_MASK                   0x00000004 */
/* #define _CNSTATE_CNSTATE2_LENGTH                 0x00000001 */

/* #define _CNSTATE_CNSTATE3_POSITION               0x00000003 */
/* #define _CNSTATE_CNSTATE3_MASK                   0x00000008 */
/* #define _CNSTATE_CNSTATE3_LENGTH                 0x00000001 */

/* #define _CNSTATE_CNSTATE4_POSITION               0x00000004 */
/* #define _CNSTATE_CNSTATE4_MASK                   0x00000010 */
/* #define _CNSTATE_CNSTATE4_LENGTH                 0x00000001 */

/* #define _CNSTATE_CNSTATE5_POSITION               0x00000005 */
/* #define _CNSTATE_CNSTATE5_MASK                   0x00000020 */
/* #define _CNSTATE_CNSTATE5_LENGTH                 0x00000001 */

/* #define _CNSTATE_CNSTATE6_POSITION               0x00000006 */
/* #define _CNSTATE_CNSTATE6_MASK                   0x00000040 */
/* #define _CNSTATE_CNSTATE6_LENGTH                 0x00000001 */

