rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _CNSTATE_CNSTATE7_POSITION               0x00000007 */
/* #define _CNSTATE_CNSTATE7_MASK                   0x00000080 */
/* #define _CNSTATE_CNSTATE7_LENGTH                 0x00000001 */

/* #define _CNSTATE_w_POSITION                      0x00000000 */
/* #define _CNSTATE_w_MASK                          0xFFFFFFFF */
/* #define _CNSTATE_w_LENGTH                        0x00000020 */

/* #define _ANSELF_w_POSITION                       0x00000000 */
/* #define _ANSELF_w_MASK                           0xFFFFFFFF */
/* #define _ANSELF_w_LENGTH                         0x00000020 */

/* #define _TRISF_TRISF0_POSITION                   0x00000000 */
/* #define _TRISF_TRISF0_MASK                       0x00000001 */
/* #define _TRISF_TRISF0_LENGTH                     0x00000001 */

/* #define _TRISF_TRISF1_POSITION                   0x00000001 */
/* #define _TRISF_TRISF1_MASK                       0x00000002 */
/* #define _TRISF_TRISF1_LENGTH                     0x00000001 */

/* #define _TRISF_TRISF3_POSITION                   0x00000003 */
/* #define _TRISF_TRISF3_MASK                       0x00000008 */
/* #define _TRISF_TRISF3_LENGTH                     0x00000001 */

/* #define _TRISF_TRISF4_POSITION                   0x00000004 */
/* #define _TRISF_TRISF4_MASK                       0x00000010 */
/* #define _TRISF_TRISF4_LENGTH                     0x00000001 */

/* #define _TRISF_TRISF5_POSITION                   0x00000005 */
/* #define _TRISF_TRISF5_MASK                       0x00000020 */
/* #define _TRISF_TRISF5_LENGTH                     0x00000001 */

/* #define _TRISF_w_POSITION                        0x00000000 */
/* #define _TRISF_w_MASK                            0xFFFFFFFF */
/* #define _TRISF_w_LENGTH                          0x00000020 */

/* #define _PORTF_RF0_POSITION                      0x00000000 */
/* #define _PORTF_RF0_MASK                          0x00000001 */
/* #define _PORTF_RF0_LENGTH                        0x00000001 */

/* #define _PORTF_RF1_POSITION                      0x00000001 */
/* #define _PORTF_RF1_MASK                          0x00000002 */
/* #define _PORTF_RF1_LENGTH                        0x00000001 */

/* #define _PORTF_RF3_POSITION                      0x00000003 */
/* #define _PORTF_RF3_MASK                          0x00000008 */
/* #define _PORTF_RF3_LENGTH                        0x00000001 */

/* #define _PORTF_RF4_POSITION                      0x00000004 */
/* #define _PORTF_RF4_MASK                          0x00000010 */
/* #define _PORTF_RF4_LENGTH                        0x00000001 */

/* #define _PORTF_RF5_POSITION                      0x00000005 */
/* #define _PORTF_RF5_MASK                          0x00000020 */
/* #define _PORTF_RF5_LENGTH                        0x00000001 */

/* #define _PORTF_w_POSITION                        0x00000000 */
/* #define _PORTF_w_MASK                            0xFFFFFFFF */
/* #define _PORTF_w_LENGTH                          0x00000020 */

/* #define _LATF_LATF0_POSITION                     0x00000000 */
/* #define _LATF_LATF0_MASK                         0x00000001 */
/* #define _LATF_LATF0_LENGTH                       0x00000001 */

/* #define _LATF_LATF1_POSITION                     0x00000001 */
/* #define _LATF_LATF1_MASK                         0x00000002 */
/* #define _LATF_LATF1_LENGTH                       0x00000001 */

/* #define _LATF_LATF3_POSITION                     0x00000003 */
/* #define _LATF_LATF3_MASK                         0x00000008 */
/* #define _LATF_LATF3_LENGTH                       0x00000001 */

/* #define _LATF_LATF4_POSITION                     0x00000004 */
/* #define _LATF_LATF4_MASK                         0x00000010 */
/* #define _LATF_LATF4_LENGTH                       0x00000001 */

/* #define _LATF_LATF5_POSITION                     0x00000005 */
/* #define _LATF_LATF5_MASK                         0x00000020 */
/* #define _LATF_LATF5_LENGTH                       0x00000001 */

/* #define _LATF_w_POSITION                         0x00000000 */
/* #define _LATF_w_MASK                             0xFFFFFFFF */
/* #define _LATF_w_LENGTH                           0x00000020 */

/* #define _ODCF_ODCF0_POSITION                     0x00000000 */
/* #define _ODCF_ODCF0_MASK                         0x00000001 */
/* #define _ODCF_ODCF0_LENGTH                       0x00000001 */

/* #define _ODCF_ODCF1_POSITION                     0x00000001 */
/* #define _ODCF_ODCF1_MASK                         0x00000002 */
/* #define _ODCF_ODCF1_LENGTH                       0x00000001 */

/* #define _ODCF_ODCF3_POSITION                     0x00000003 */
/* #define _ODCF_ODCF3_MASK                         0x00000008 */
/* #define _ODCF_ODCF3_LENGTH                       0x00000001 */

/* #define _ODCF_ODCF4_POSITION                     0x00000004 */
/* #define _ODCF_ODCF4_MASK                         0x00000010 */
/* #define _ODCF_ODCF4_LENGTH                       0x00000001 */

/* #define _ODCF_ODCF5_POSITION                     0x00000005 */
/* #define _ODCF_ODCF5_MASK                         0x00000020 */
/* #define _ODCF_ODCF5_LENGTH                       0x00000001 */

/* #define _ODCF_w_POSITION                         0x00000000 */
/* #define _ODCF_w_MASK                             0xFFFFFFFF */
/* #define _ODCF_w_LENGTH                           0x00000020 */

/* #define _CNPUF_CNPUF0_POSITION                   0x00000000 */
/* #define _CNPUF_CNPUF0_MASK                       0x00000001 */
/* #define _CNPUF_CNPUF0_LENGTH                     0x00000001 */

/* #define _CNPUF_CNPUF1_POSITION                   0x00000001 */
/* #define _CNPUF_CNPUF1_MASK                       0x00000002 */
/* #define _CNPUF_CNPUF1_LENGTH                     0x00000001 */

/* #define _CNPUF_CNPUF3_POSITION                   0x00000003 */
/* #define _CNPUF_CNPUF3_MASK                       0x00000008 */
/* #define _CNPUF_CNPUF3_LENGTH                     0x00000001 */

/* #define _CNPUF_CNPUF4_POSITION                   0x00000004 */
/* #define _CNPUF_CNPUF4_MASK                       0x00000010 */
/* #define _CNPUF_CNPUF4_LENGTH                     0x00000001 */

/* #define _CNPUF_CNPUF5_POSITION                   0x00000005 */
/* #define _CNPUF_CNPUF5_MASK                       0x00000020 */
/* #define _CNPUF_CNPUF5_LENGTH                     0x00000001 */

/* #define _CNPUF_w_POSITION                        0x00000000 */
/* #define _CNPUF_w_MASK                            0xFFFFFFFF */
/* #define _CNPUF_w_LENGTH                          0x00000020 */

/* #define _CNPDF_CNPDF0_POSITION                   0x00000000 */
/* #define _CNPDF_CNPDF0_MASK                       0x00000001 */
/* #define _CNPDF_CNPDF0_LENGTH                     0x00000001 */

/* #define _CNPDF_CNPDF1_POSITION                   0x00000001 */
/* #define _CNPDF_CNPDF1_MASK                       0x00000002 */
/* #define _CNPDF_CNPDF1_LENGTH                     0x00000001 */

