rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _CNPDF_CNPDF3_POSITION                   0x00000003 */
/* #define _CNPDF_CNPDF3_MASK                       0x00000008 */
/* #define _CNPDF_CNPDF3_LENGTH                     0x00000001 */

/* #define _CNPDF_CNPDF4_POSITION                   0x00000004 */
/* #define _CNPDF_CNPDF4_MASK                       0x00000010 */
/* #define _CNPDF_CNPDF4_LENGTH                     0x00000001 */

/* #define _CNPDF_CNPDF5_POSITION                   0x00000005 */
/* #define _CNPDF_CNPDF5_MASK                       0x00000020 */
/* #define _CNPDF_CNPDF5_LENGTH                     0x00000001 */

/* #define _CNPDF_w_POSITION                        0x00000000 */
/* #define _CNPDF_w_MASK                            0xFFFFFFFF */
/* #define _CNPDF_w_LENGTH                          0x00000020 */

/* #define _CNCONF_SIDL_POSITION                    0x0000000D */
/* #define _CNCONF_SIDL_MASK                        0x00002000 */
/* #define _CNCONF_SIDL_LENGTH                      0x00000001 */

/* #define _CNCONF_ON_POSITION                      0x0000000F */
/* #define _CNCONF_ON_MASK                          0x00008000 */
/* #define _CNCONF_ON_LENGTH                        0x00000001 */

/* #define _CNCONF_w_POSITION                       0x00000000 */
/* #define _CNCONF_w_MASK                           0xFFFFFFFF */
/* #define _CNCONF_w_LENGTH                         0x00000020 */

/* #define _CNENF_CNIEF0_POSITION                   0x00000000 */
/* #define _CNENF_CNIEF0_MASK                       0x00000001 */
/* #define _CNENF_CNIEF0_LENGTH                     0x00000001 */

/* #define _CNENF_CNIEF1_POSITION                   0x00000001 */
/* #define _CNENF_CNIEF1_MASK                       0x00000002 */
/* #define _CNENF_CNIEF1_LENGTH                     0x00000001 */

/* #define _CNENF_CNIEF3_POSITION                   0x00000003 */
/* #define _CNENF_CNIEF3_MASK                       0x00000008 */
/* #define _CNENF_CNIEF3_LENGTH                     0x00000001 */

/* #define _CNENF_CNIEF4_POSITION                   0x00000004 */
/* #define _CNENF_CNIEF4_MASK                       0x00000010 */
/* #define _CNENF_CNIEF4_LENGTH                     0x00000001 */

/* #define _CNENF_CNIEF5_POSITION                   0x00000005 */
/* #define _CNENF_CNIEF5_MASK                       0x00000020 */
/* #define _CNENF_CNIEF5_LENGTH                     0x00000001 */

/* #define _CNENF_w_POSITION                        0x00000000 */
/* #define _CNENF_w_MASK                            0xFFFFFFFF */
/* #define _CNENF_w_LENGTH                          0x00000020 */

/* #define _CNSTATF_CNSTATF0_POSITION               0x00000000 */
/* #define _CNSTATF_CNSTATF0_MASK                   0x00000001 */
/* #define _CNSTATF_CNSTATF0_LENGTH                 0x00000001 */

/* #define _CNSTATF_CNSTATF1_POSITION               0x00000001 */
/* #define _CNSTATF_CNSTATF1_MASK                   0x00000002 */
/* #define _CNSTATF_CNSTATF1_LENGTH                 0x00000001 */

/* #define _CNSTATF_CNSTATF3_POSITION               0x00000003 */
/* #define _CNSTATF_CNSTATF3_MASK                   0x00000008 */
/* #define _CNSTATF_CNSTATF3_LENGTH                 0x00000001 */

/* #define _CNSTATF_CNSTATF4_POSITION               0x00000004 */
/* #define _CNSTATF_CNSTATF4_MASK                   0x00000010 */
/* #define _CNSTATF_CNSTATF4_LENGTH                 0x00000001 */

/* #define _CNSTATF_CNSTATF5_POSITION               0x00000005 */
/* #define _CNSTATF_CNSTATF5_MASK                   0x00000020 */
/* #define _CNSTATF_CNSTATF5_LENGTH                 0x00000001 */

/* #define _CNSTATF_w_POSITION                      0x00000000 */
/* #define _CNSTATF_w_MASK                          0xFFFFFFFF */
/* #define _CNSTATF_w_LENGTH                        0x00000020 */

/* #define _ANSELG_ANSG6_POSITION                   0x00000006 */
/* #define _ANSELG_ANSG6_MASK                       0x00000040 */
/* #define _ANSELG_ANSG6_LENGTH                     0x00000001 */

/* #define _ANSELG_ANSG7_POSITION                   0x00000007 */
/* #define _ANSELG_ANSG7_MASK                       0x00000080 */
/* #define _ANSELG_ANSG7_LENGTH                     0x00000001 */

/* #define _ANSELG_ANSG8_POSITION                   0x00000008 */
/* #define _ANSELG_ANSG8_MASK                       0x00000100 */
/* #define _ANSELG_ANSG8_LENGTH                     0x00000001 */

/* #define _ANSELG_ANSG9_POSITION                   0x00000009 */
/* #define _ANSELG_ANSG9_MASK                       0x00000200 */
/* #define _ANSELG_ANSG9_LENGTH                     0x00000001 */

/* #define _ANSELG_w_POSITION                       0x00000000 */
/* #define _ANSELG_w_MASK                           0xFFFFFFFF */
/* #define _ANSELG_w_LENGTH                         0x00000020 */

/* #define _TRISG_TRISG2_POSITION                   0x00000002 */
/* #define _TRISG_TRISG2_MASK                       0x00000004 */
/* #define _TRISG_TRISG2_LENGTH                     0x00000001 */

/* #define _TRISG_TRISG3_POSITION                   0x00000003 */
/* #define _TRISG_TRISG3_MASK                       0x00000008 */
/* #define _TRISG_TRISG3_LENGTH                     0x00000001 */

/* #define _TRISG_TRISG6_POSITION                   0x00000006 */
/* #define _TRISG_TRISG6_MASK                       0x00000040 */
/* #define _TRISG_TRISG6_LENGTH                     0x00000001 */

/* #define _TRISG_TRISG7_POSITION                   0x00000007 */
/* #define _TRISG_TRISG7_MASK                       0x00000080 */
/* #define _TRISG_TRISG7_LENGTH                     0x00000001 */

/* #define _TRISG_TRISG8_POSITION                   0x00000008 */
/* #define _TRISG_TRISG8_MASK                       0x00000100 */
/* #define _TRISG_TRISG8_LENGTH                     0x00000001 */

/* #define _TRISG_TRISG9_POSITION                   0x00000009 */
/* #define _TRISG_TRISG9_MASK                       0x00000200 */
/* #define _TRISG_TRISG9_LENGTH                     0x00000001 */

/* #define _TRISG_w_POSITION                        0x00000000 */
/* #define _TRISG_w_MASK                            0xFFFFFFFF */
/* #define _TRISG_w_LENGTH                          0x00000020 */

/* #define _PORTG_RG2_POSITION                      0x00000002 */
/* #define _PORTG_RG2_MASK                          0x00000004 */
/* #define _PORTG_RG2_LENGTH                        0x00000001 */

/* #define _PORTG_RG3_POSITION                      0x00000003 */
/* #define _PORTG_RG3_MASK                          0x00000008 */
/* #define _PORTG_RG3_LENGTH                        0x00000001 */

/* #define _PORTG_RG6_POSITION                      0x00000006 */
/* #define _PORTG_RG6_MASK                          0x00000040 */
/* #define _PORTG_RG6_LENGTH                        0x00000001 */

/* #define _PORTG_RG7_POSITION                      0x00000007 */
/* #define _PORTG_RG7_MASK                          0x00000080 */
/* #define _PORTG_RG7_LENGTH                        0x00000001 */

/* #define _PORTG_RG8_POSITION                      0x00000008 */
/* #define _PORTG_RG8_MASK                          0x00000100 */
/* #define _PORTG_RG8_LENGTH                        0x00000001 */

