rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _PORTG_RG9_POSITION                      0x00000009 */
/* #define _PORTG_RG9_MASK                          0x00000200 */
/* #define _PORTG_RG9_LENGTH                        0x00000001 */

/* #define _PORTG_w_POSITION                        0x00000000 */
/* #define _PORTG_w_MASK                            0xFFFFFFFF */
/* #define _PORTG_w_LENGTH                          0x00000020 */

/* #define _LATG_LATG2_POSITION                     0x00000002 */
/* #define _LATG_LATG2_MASK                         0x00000004 */
/* #define _LATG_LATG2_LENGTH                       0x00000001 */

/* #define _LATG_LATG3_POSITION                     0x00000003 */
/* #define _LATG_LATG3_MASK                         0x00000008 */
/* #define _LATG_LATG3_LENGTH                       0x00000001 */

/* #define _LATG_LATG6_POSITION                     0x00000006 */
/* #define _LATG_LATG6_MASK                         0x00000040 */
/* #define _LATG_LATG6_LENGTH                       0x00000001 */

/* #define _LATG_LATG7_POSITION                     0x00000007 */
/* #define _LATG_LATG7_MASK                         0x00000080 */
/* #define _LATG_LATG7_LENGTH                       0x00000001 */

/* #define _LATG_LATG8_POSITION                     0x00000008 */
/* #define _LATG_LATG8_MASK                         0x00000100 */
/* #define _LATG_LATG8_LENGTH                       0x00000001 */

/* #define _LATG_LATG9_POSITION                     0x00000009 */
/* #define _LATG_LATG9_MASK                         0x00000200 */
/* #define _LATG_LATG9_LENGTH                       0x00000001 */

/* #define _LATG_w_POSITION                         0x00000000 */
/* #define _LATG_w_MASK                             0xFFFFFFFF */
/* #define _LATG_w_LENGTH                           0x00000020 */

/* #define _ODCG_ODCG2_POSITION                     0x00000002 */
/* #define _ODCG_ODCG2_MASK                         0x00000004 */
/* #define _ODCG_ODCG2_LENGTH                       0x00000001 */

/* #define _ODCG_ODCG3_POSITION                     0x00000003 */
/* #define _ODCG_ODCG3_MASK                         0x00000008 */
/* #define _ODCG_ODCG3_LENGTH                       0x00000001 */

/* #define _ODCG_ODCG6_POSITION                     0x00000006 */
/* #define _ODCG_ODCG6_MASK                         0x00000040 */
/* #define _ODCG_ODCG6_LENGTH                       0x00000001 */

/* #define _ODCG_ODCG7_POSITION                     0x00000007 */
/* #define _ODCG_ODCG7_MASK                         0x00000080 */
/* #define _ODCG_ODCG7_LENGTH                       0x00000001 */

/* #define _ODCG_ODCG8_POSITION                     0x00000008 */
/* #define _ODCG_ODCG8_MASK                         0x00000100 */
/* #define _ODCG_ODCG8_LENGTH                       0x00000001 */

/* #define _ODCG_ODCG9_POSITION                     0x00000009 */
/* #define _ODCG_ODCG9_MASK                         0x00000200 */
/* #define _ODCG_ODCG9_LENGTH                       0x00000001 */

/* #define _ODCG_w_POSITION                         0x00000000 */
/* #define _ODCG_w_MASK                             0xFFFFFFFF */
/* #define _ODCG_w_LENGTH                           0x00000020 */

/* #define _CNPUG_CNPUG2_POSITION                   0x00000002 */
/* #define _CNPUG_CNPUG2_MASK                       0x00000004 */
/* #define _CNPUG_CNPUG2_LENGTH                     0x00000001 */

/* #define _CNPUG_CNPUG3_POSITION                   0x00000003 */
/* #define _CNPUG_CNPUG3_MASK                       0x00000008 */
/* #define _CNPUG_CNPUG3_LENGTH                     0x00000001 */

/* #define _CNPUG_CNPUG6_POSITION                   0x00000006 */
/* #define _CNPUG_CNPUG6_MASK                       0x00000040 */
/* #define _CNPUG_CNPUG6_LENGTH                     0x00000001 */

/* #define _CNPUG_CNPUG7_POSITION                   0x00000007 */
/* #define _CNPUG_CNPUG7_MASK                       0x00000080 */
/* #define _CNPUG_CNPUG7_LENGTH                     0x00000001 */

/* #define _CNPUG_CNPUG8_POSITION                   0x00000008 */
/* #define _CNPUG_CNPUG8_MASK                       0x00000100 */
/* #define _CNPUG_CNPUG8_LENGTH                     0x00000001 */

/* #define _CNPUG_CNPUG9_POSITION                   0x00000009 */
/* #define _CNPUG_CNPUG9_MASK                       0x00000200 */
/* #define _CNPUG_CNPUG9_LENGTH                     0x00000001 */

/* #define _CNPUG_w_POSITION                        0x00000000 */
/* #define _CNPUG_w_MASK                            0xFFFFFFFF */
/* #define _CNPUG_w_LENGTH                          0x00000020 */

/* #define _CNPDG_CNPDG2_POSITION                   0x00000002 */
/* #define _CNPDG_CNPDG2_MASK                       0x00000004 */
/* #define _CNPDG_CNPDG2_LENGTH                     0x00000001 */

/* #define _CNPDG_CNPDG3_POSITION                   0x00000003 */
/* #define _CNPDG_CNPDG3_MASK                       0x00000008 */
/* #define _CNPDG_CNPDG3_LENGTH                     0x00000001 */

/* #define _CNPDG_CNPDG6_POSITION                   0x00000006 */
/* #define _CNPDG_CNPDG6_MASK                       0x00000040 */
/* #define _CNPDG_CNPDG6_LENGTH                     0x00000001 */

/* #define _CNPDG_CNPDG7_POSITION                   0x00000007 */
/* #define _CNPDG_CNPDG7_MASK                       0x00000080 */
/* #define _CNPDG_CNPDG7_LENGTH                     0x00000001 */

/* #define _CNPDG_CNPDG8_POSITION                   0x00000008 */
/* #define _CNPDG_CNPDG8_MASK                       0x00000100 */
/* #define _CNPDG_CNPDG8_LENGTH                     0x00000001 */

/* #define _CNPDG_CNPDG9_POSITION                   0x00000009 */
/* #define _CNPDG_CNPDG9_MASK                       0x00000200 */
/* #define _CNPDG_CNPDG9_LENGTH                     0x00000001 */

/* #define _CNPDG_w_POSITION                        0x00000000 */
/* #define _CNPDG_w_MASK                            0xFFFFFFFF */
/* #define _CNPDG_w_LENGTH                          0x00000020 */

/* #define _CNCONG_SIDL_POSITION                    0x0000000D */
/* #define _CNCONG_SIDL_MASK                        0x00002000 */
/* #define _CNCONG_SIDL_LENGTH                      0x00000001 */

/* #define _CNCONG_ON_POSITION                      0x0000000F */
/* #define _CNCONG_ON_MASK                          0x00008000 */
/* #define _CNCONG_ON_LENGTH                        0x00000001 */

/* #define _CNCONG_w_POSITION                       0x00000000 */
/* #define _CNCONG_w_MASK                           0xFFFFFFFF */
/* #define _CNCONG_w_LENGTH                         0x00000020 */

/* #define _CNENG_CNIEG2_POSITION                   0x00000002 */
/* #define _CNENG_CNIEG2_MASK                       0x00000004 */
/* #define _CNENG_CNIEG2_LENGTH                     0x00000001 */

