rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _CNENG_CNIEG3_POSITION                   0x00000003 */
/* #define _CNENG_CNIEG3_MASK                       0x00000008 */
/* #define _CNENG_CNIEG3_LENGTH                     0x00000001 */

/* #define _CNENG_CNIEG6_POSITION                   0x00000006 */
/* #define _CNENG_CNIEG6_MASK                       0x00000040 */
/* #define _CNENG_CNIEG6_LENGTH                     0x00000001 */

/* #define _CNENG_CNIEG7_POSITION                   0x00000007 */
/* #define _CNENG_CNIEG7_MASK                       0x00000080 */
/* #define _CNENG_CNIEG7_LENGTH                     0x00000001 */

/* #define _CNENG_CNIEG8_POSITION                   0x00000008 */
/* #define _CNENG_CNIEG8_MASK                       0x00000100 */
/* #define _CNENG_CNIEG8_LENGTH                     0x00000001 */

/* #define _CNENG_CNIEG9_POSITION                   0x00000009 */
/* #define _CNENG_CNIEG9_MASK                       0x00000200 */
/* #define _CNENG_CNIEG9_LENGTH                     0x00000001 */

/* #define _CNENG_w_POSITION                        0x00000000 */
/* #define _CNENG_w_MASK                            0xFFFFFFFF */
/* #define _CNENG_w_LENGTH                          0x00000020 */

/* #define _CNSTATG_CNSTATG2_POSITION               0x00000002 */
/* #define _CNSTATG_CNSTATG2_MASK                   0x00000004 */
/* #define _CNSTATG_CNSTATG2_LENGTH                 0x00000001 */

/* #define _CNSTATG_CNSTATG3_POSITION               0x00000003 */
/* #define _CNSTATG_CNSTATG3_MASK                   0x00000008 */
/* #define _CNSTATG_CNSTATG3_LENGTH                 0x00000001 */

/* #define _CNSTATG_CNSTATG6_POSITION               0x00000006 */
/* #define _CNSTATG_CNSTATG6_MASK                   0x00000040 */
/* #define _CNSTATG_CNSTATG6_LENGTH                 0x00000001 */

/* #define _CNSTATG_CNSTATG7_POSITION               0x00000007 */
/* #define _CNSTATG_CNSTATG7_MASK                   0x00000080 */
/* #define _CNSTATG_CNSTATG7_LENGTH                 0x00000001 */

/* #define _CNSTATG_CNSTATG8_POSITION               0x00000008 */
/* #define _CNSTATG_CNSTATG8_MASK                   0x00000100 */
/* #define _CNSTATG_CNSTATG8_LENGTH                 0x00000001 */

/* #define _CNSTATG_CNSTATG9_POSITION               0x00000009 */
/* #define _CNSTATG_CNSTATG9_MASK                   0x00000200 */
/* #define _CNSTATG_CNSTATG9_LENGTH                 0x00000001 */

/* #define _CNSTATG_w_POSITION                      0x00000000 */
/* #define _CNSTATG_w_MASK                          0xFFFFFFFF */
/* #define _CNSTATG_w_LENGTH                        0x00000020 */

/* #define _DEVCFG3_USERID_POSITION                 0x00000000 */
/* #define _DEVCFG3_USERID_MASK                     0x0000FFFF */
/* #define _DEVCFG3_USERID_LENGTH                   0x00000010 */

/* #define _DEVCFG3_FSRSSEL_POSITION                0x00000010 */
/* #define _DEVCFG3_FSRSSEL_MASK                    0x00070000 */
/* #define _DEVCFG3_FSRSSEL_LENGTH                  0x00000003 */

/* #define _DEVCFG3_PMDL1WAY_POSITION               0x0000001C */
/* #define _DEVCFG3_PMDL1WAY_MASK                   0x10000000 */
/* #define _DEVCFG3_PMDL1WAY_LENGTH                 0x00000001 */

/* #define _DEVCFG3_IOL1WAY_POSITION                0x0000001D */
/* #define _DEVCFG3_IOL1WAY_MASK                    0x20000000 */
/* #define _DEVCFG3_IOL1WAY_LENGTH                  0x00000001 */

/* #define _DEVCFG3_FUSBIDIO_POSITION               0x0000001E */
/* #define _DEVCFG3_FUSBIDIO_MASK                   0x40000000 */
/* #define _DEVCFG3_FUSBIDIO_LENGTH                 0x00000001 */

/* #define _DEVCFG3_FVBUSONIO_POSITION              0x0000001F */
/* #define _DEVCFG3_FVBUSONIO_MASK                  0x80000000 */
/* #define _DEVCFG3_FVBUSONIO_LENGTH                0x00000001 */

/* #define _DEVCFG3_w_POSITION                      0x00000000 */
/* #define _DEVCFG3_w_MASK                          0xFFFFFFFF */
/* #define _DEVCFG3_w_LENGTH                        0x00000020 */

/* #define _DEVCFG2_FPLLIDIV_POSITION               0x00000000 */
/* #define _DEVCFG2_FPLLIDIV_MASK                   0x00000007 */
/* #define _DEVCFG2_FPLLIDIV_LENGTH                 0x00000003 */

/* #define _DEVCFG2_FPLLMUL_POSITION                0x00000004 */
/* #define _DEVCFG2_FPLLMUL_MASK                    0x00000070 */
/* #define _DEVCFG2_FPLLMUL_LENGTH                  0x00000003 */

/* #define _DEVCFG2_UPLLIDIV_POSITION               0x00000008 */
/* #define _DEVCFG2_UPLLIDIV_MASK                   0x00000700 */
/* #define _DEVCFG2_UPLLIDIV_LENGTH                 0x00000003 */

/* #define _DEVCFG2_UPLLEN_POSITION                 0x0000000F */
/* #define _DEVCFG2_UPLLEN_MASK                     0x00008000 */
/* #define _DEVCFG2_UPLLEN_LENGTH                   0x00000001 */

/* #define _DEVCFG2_FPLLODIV_POSITION               0x00000010 */
/* #define _DEVCFG2_FPLLODIV_MASK                   0x00070000 */
/* #define _DEVCFG2_FPLLODIV_LENGTH                 0x00000003 */

/* #define _DEVCFG2_w_POSITION                      0x00000000 */
/* #define _DEVCFG2_w_MASK                          0xFFFFFFFF */
/* #define _DEVCFG2_w_LENGTH                        0x00000020 */

/* #define _DEVCFG1_FNOSC_POSITION                  0x00000000 */
/* #define _DEVCFG1_FNOSC_MASK                      0x00000007 */
/* #define _DEVCFG1_FNOSC_LENGTH                    0x00000003 */

/* #define _DEVCFG1_FSOSCEN_POSITION                0x00000005 */
/* #define _DEVCFG1_FSOSCEN_MASK                    0x00000020 */
/* #define _DEVCFG1_FSOSCEN_LENGTH                  0x00000001 */

/* #define _DEVCFG1_IESO_POSITION                   0x00000007 */
/* #define _DEVCFG1_IESO_MASK                       0x00000080 */
/* #define _DEVCFG1_IESO_LENGTH                     0x00000001 */

/* #define _DEVCFG1_POSCMOD_POSITION                0x00000008 */
/* #define _DEVCFG1_POSCMOD_MASK                    0x00000300 */
/* #define _DEVCFG1_POSCMOD_LENGTH                  0x00000002 */

/* #define _DEVCFG1_OSCIOFNC_POSITION               0x0000000A */
/* #define _DEVCFG1_OSCIOFNC_MASK                   0x00000400 */
/* #define _DEVCFG1_OSCIOFNC_LENGTH                 0x00000001 */

