rogermc2/MB_Ada/src/p32mx470f512.h
/* #define _DEVCFG1_FPBDIV_POSITION                 0x0000000C */
/* #define _DEVCFG1_FPBDIV_MASK                     0x00003000 */
/* #define _DEVCFG1_FPBDIV_LENGTH                   0x00000002 */

/* #define _DEVCFG1_FCKSM_POSITION                  0x0000000E */
/* #define _DEVCFG1_FCKSM_MASK                      0x0000C000 */
/* #define _DEVCFG1_FCKSM_LENGTH                    0x00000002 */

/* #define _DEVCFG1_WDTPS_POSITION                  0x00000010 */
/* #define _DEVCFG1_WDTPS_MASK                      0x001F0000 */
/* #define _DEVCFG1_WDTPS_LENGTH                    0x00000005 */

/* #define _DEVCFG1_WINDIS_POSITION                 0x00000016 */
/* #define _DEVCFG1_WINDIS_MASK                     0x00400000 */
/* #define _DEVCFG1_WINDIS_LENGTH                   0x00000001 */

/* #define _DEVCFG1_FWDTEN_POSITION                 0x00000017 */
/* #define _DEVCFG1_FWDTEN_MASK                     0x00800000 */
/* #define _DEVCFG1_FWDTEN_LENGTH                   0x00000001 */

/* #define _DEVCFG1_FWDTWINSZ_POSITION              0x00000018 */
/* #define _DEVCFG1_FWDTWINSZ_MASK                  0x03000000 */
/* #define _DEVCFG1_FWDTWINSZ_LENGTH                0x00000002 */

/* #define _DEVCFG1_w_POSITION                      0x00000000 */
/* #define _DEVCFG1_w_MASK                          0xFFFFFFFF */
/* #define _DEVCFG1_w_LENGTH                        0x00000020 */

/* #define _DEVCFG0_DEBUG_POSITION                  0x00000000 */
/* #define _DEVCFG0_DEBUG_MASK                      0x00000003 */
/* #define _DEVCFG0_DEBUG_LENGTH                    0x00000002 */

/* #define _DEVCFG0_JTAGEN_POSITION                 0x00000002 */
/* #define _DEVCFG0_JTAGEN_MASK                     0x00000004 */
/* #define _DEVCFG0_JTAGEN_LENGTH                   0x00000001 */

/* #define _DEVCFG0_ICESEL_POSITION                 0x00000003 */
/* #define _DEVCFG0_ICESEL_MASK                     0x00000018 */
/* #define _DEVCFG0_ICESEL_LENGTH                   0x00000002 */

/* #define _DEVCFG0_PWP_POSITION                    0x0000000C */
/* #define _DEVCFG0_PWP_MASK                        0x000FF000 */
/* #define _DEVCFG0_PWP_LENGTH                      0x00000008 */

/* #define _DEVCFG0_BWP_POSITION                    0x00000018 */
/* #define _DEVCFG0_BWP_MASK                        0x01000000 */
/* #define _DEVCFG0_BWP_LENGTH                      0x00000001 */

/* #define _DEVCFG0_CP_POSITION                     0x0000001C */
/* #define _DEVCFG0_CP_MASK                         0x10000000 */
/* #define _DEVCFG0_CP_LENGTH                       0x00000001 */

/* #define _DEVCFG0_FDEBUG_POSITION                 0x00000000 */
/* #define _DEVCFG0_FDEBUG_MASK                     0x00000003 */
/* #define _DEVCFG0_FDEBUG_LENGTH                   0x00000002 */

/* #define _DEVCFG0_w_POSITION                      0x00000000 */
/* #define _DEVCFG0_w_MASK                          0xFFFFFFFF */
/* #define _DEVCFG0_w_LENGTH                        0x00000020 */

/* Vector Numbers */
/* #define _CORE_TIMER_VECTOR                       0 */
/* #define _CORE_SOFTWARE_0_VECTOR                  1 */
/* #define _CORE_SOFTWARE_1_VECTOR                  2 */
/* #define _EXTERNAL_0_VECTOR                       3 */
/* #define _TIMER_1_VECTOR                          4 */
/* #define _INPUT_CAPTURE_1_VECTOR                  5 */
/* #define _OUTPUT_COMPARE_1_VECTOR                 6 */
/* #define _EXTERNAL_1_VECTOR                       7 */
/* #define _TIMER_2_VECTOR                          8 */
/* #define _INPUT_CAPTURE_2_VECTOR                  9 */
/* #define _OUTPUT_COMPARE_2_VECTOR                 10 */
/* #define _EXTERNAL_2_VECTOR                       11 */
/* #define _TIMER_3_VECTOR                          12 */
/* #define _INPUT_CAPTURE_3_VECTOR                  13 */
/* #define _OUTPUT_COMPARE_3_VECTOR                 14 */
/* #define _EXTERNAL_3_VECTOR                       15 */
/* #define _TIMER_4_VECTOR                          16 */
/* #define _INPUT_CAPTURE_4_VECTOR                  17 */
/* #define _OUTPUT_COMPARE_4_VECTOR                 18 */
/* #define _EXTERNAL_4_VECTOR                       19 */
/* #define _TIMER_5_VECTOR                          20 */
/* #define _INPUT_CAPTURE_5_VECTOR                  21 */
/* #define _OUTPUT_COMPARE_5_VECTOR                 22 */
/* #define _ADC_VECTOR                              23 */
/* #define _FAIL_SAFE_MONITOR_VECTOR                24 */
/* #define _RTCC_VECTOR                             25 */
/* #define _FCE_VECTOR                              26 */
/* #define _COMPARATOR_1_VECTOR                     27 */
/* #define _COMPARATOR_2_VECTOR                     28 */
/* #define _USB_1_VECTOR                            29 */
/* #define _SPI_1_VECTOR                            30 */
/* #define _UART_1_VECTOR                           31 */
/* #define _I2C_1_VECTOR                            32 */
/* #define _CHANGE_NOTICE_VECTOR                    33 */
/* #define _PMP_VECTOR                              34 */
/* #define _SPI_2_VECTOR                            35 */
/* #define _UART_2_VECTOR                           36 */
/* #define _I2C_2_VECTOR                            37 */
/* #define _UART_3_VECTOR                           38 */
/* #define _UART_4_VECTOR                           39 */
/* #define _CTMU_VECTOR                             41 */
/* #define _DMA_0_VECTOR                            42 */
/* #define _DMA_1_VECTOR                            43 */
/* #define _DMA_2_VECTOR                            44 */
/* #define _DMA_3_VECTOR                            45 */

/* IRQ Numbers */
/* #define _CORE_TIMER_IRQ                          0 */
/* #define _CORE_SOFTWARE_0_IRQ                     1 */
/* #define _CORE_SOFTWARE_1_IRQ                     2 */
/* #define _EXTERNAL_0_IRQ                          3 */
/* #define _TIMER_1_IRQ                             4 */
/* #define _INPUT_CAPTURE_ERROR_1_IRQ               5 */
/* #define _INPUT_CAPTURE_1_IRQ                     6 */
/* #define _OUTPUT_COMPARE_1_IRQ                    7 */
/* #define _EXTERNAL_1_IRQ                          8 */
/* #define _TIMER_2_IRQ                             9 */
/* #define _INPUT_CAPTURE_ERROR_2_IRQ               10 */
/* #define _INPUT_CAPTURE_2_IRQ                     11 */
/* #define _OUTPUT_COMPARE_2_IRQ                    12 */
/* #define _EXTERNAL_2_IRQ                          13 */
/* #define _TIMER_3_IRQ                             14 */
/* #define _INPUT_CAPTURE_ERROR_3_IRQ               15 */
/* #define _INPUT_CAPTURE_3_IRQ                     16 */
/* #define _OUTPUT_COMPARE_3_IRQ                    17 */
/* #define _EXTERNAL_3_IRQ                          18 */
/* #define _TIMER_4_IRQ                             19 */
/* #define _INPUT_CAPTURE_ERROR_4_IRQ               20 */
/* #define _INPUT_CAPTURE_4_IRQ                     21 */
/* #define _OUTPUT_COMPARE_4_IRQ                    22 */
/* #define _EXTERNAL_4_IRQ                          23 */
/* #define _TIMER_5_IRQ                             24 */
/* #define _INPUT_CAPTURE_ERROR_5_IRQ               25 */
/* #define _INPUT_CAPTURE_5_IRQ                     26 */
/* #define _OUTPUT_COMPARE_5_IRQ                    27 */
/* #define _ADC_IRQ                                 28 */
/* #define _FAIL_SAFE_MONITOR_IRQ                   29 */
/* #define _RTCC_IRQ                                30 */
/* #define _FLASH_CONTROL_IRQ                       31 */
/* #define _COMPARATOR_1_IRQ                        32 */
/* #define _COMPARATOR_2_IRQ                        33 */
/* #define _USB_IRQ                                 34 */
/* #define _SPI1_ERR_IRQ                            35 */
/* #define _SPI1_RX_IRQ                             36 */
/* #define _SPI1_TX_IRQ                             37 */
/* #define _UART1_ERR_IRQ                           38 */
/* #define _UART1_RX_IRQ                            39 */
/* #define _UART1_TX_IRQ                            40 */
/* #define _I2C1_BUS_IRQ                            41 */
/* #define _I2C1_SLAVE_IRQ                          42 */
/* #define _I2C1_MASTER_IRQ                         43 */
/* #define _CHANGE_NOTICE_A_IRQ                     44 */
/* #define _CHANGE_NOTICE_B_IRQ                     45 */
/* #define _CHANGE_NOTICE_C_IRQ                     46 */
/* #define _CHANGE_NOTICE_D_IRQ                     47 */
/* #define _CHANGE_NOTICE_E_IRQ                     48 */
/* #define _CHANGE_NOTICE_F_IRQ                     49 */
/* #define _CHANGE_NOTICE_G_IRQ                     50 */
/* #define _PMP_IRQ                                 51 */
/* #define _PMP_ERROR_IRQ                           52 */
/* #define _SPI2_ERR_IRQ                            53 */
/* #define _SPI2_RX_IRQ                             54 */
/* #define _SPI2_TX_IRQ                             55 */
/* #define _UART2_ERR_IRQ                           56 */
/* #define _UART2_RX_IRQ                            57 */
/* #define _UART2_TX_IRQ                            58 */
/* #define _I2C2_BUS_IRQ                            59 */
/* #define _I2C2_SLAVE_IRQ                          60 */
/* #define _I2C2_MASTER_IRQ                         61 */
/* #define _UART3_ERR_IRQ                           62 */
/* #define _UART3_RX_IRQ                            63 */
/* #define _UART3_TX_IRQ                            64 */
/* #define _UART4_ERR_IRQ                           65 */
/* #define _UART4_RX_IRQ                            66 */
/* #define _UART4_TX_IRQ                            67 */
/* #define _CTMU_IRQ                                71 */
/* #define _DMA0_IRQ                                72 */
/* #define _DMA1_IRQ                                73 */
/* #define _DMA2_IRQ                                74 */
/* #define _DMA3_IRQ                                75 */

/* Device Peripherals */
/* #define _ADC10 */
/* #define _BMX */
/* #define _CFG */
/* #define _CMP */
/* #define _CVR */
/* #define _DMAC */
/* #define _DMAC0 */
/* #define _DMAC1 */
/* #define _DMAC2 */
/* #define _DMAC3 */
/* #define _I2C1 */
/* #define _I2C2 */
/* #define _ICAP1 */
/* #define _ICAP2 */
/* #define _ICAP3 */
/* #define _ICAP4 */
/* #define _ICAP5 */
/* #define _INT */
/* #define _NVM */
/* #define _OCMP1 */
/* #define _OCMP2 */
/* #define _OCMP3 */
/* #define _OCMP4 */
/* #define _OCMP5 */
/* #define _OSC */
/* #define _PCACHE */
/* #define _PMP */
/* #define _PORTB */
/* #define _PORTC */
/* #define _PORTD */
/* #define _PORTE */
/* #define _PORTF */
/* #define _PORTG */
/* #define _RCON */
/* #define _RTCC */
/* #define _SPI1 */
/* #define _SPI2 */
/* #define _TMR1 */
/* #define _TMR2 */
/* #define _TMR3 */
/* #define _TMR4 */
/* #define _TMR5 */
/* #define _UART1 */
/* #define _UART2 */
/* #define _UART3 */
/* #define _UART4 */
/* #define _USB */
/* #define _WDT */

