rogermc2/MB_Ada/src/p32mx470f512.h
/* Base Addresses for Peripherals */
/* #define _ADC10_BASE_ADDRESS                      0xBF809000 */
/* #define _BMX_BASE_ADDRESS                        0xBF882000 */
/* #define _CFG_BASE_ADDRESS                        0xBF80F200 */
/* #define _CMP_BASE_ADDRESS                        0xBF80A000 */
/* #define _CVR_BASE_ADDRESS                        0xBF809800 */
/* #define _DMAC_BASE_ADDRESS                       0xBF883000 */
/* #define _DMAC0_BASE_ADDRESS                      0xBF883060 */
/* #define _DMAC1_BASE_ADDRESS                      0xBF883120 */
/* #define _DMAC2_BASE_ADDRESS                      0xBF8831E0 */
/* #define _DMAC3_BASE_ADDRESS                      0xBF8832A0 */
/* #define _I2C1_BASE_ADDRESS                       0xBF805000 */
/* #define _I2C2_BASE_ADDRESS                       0xBF805100 */
/* #define _ICAP1_BASE_ADDRESS                      0xBF802000 */
/* #define _ICAP2_BASE_ADDRESS                      0xBF802200 */
/* #define _ICAP3_BASE_ADDRESS                      0xBF802400 */
/* #define _ICAP4_BASE_ADDRESS                      0xBF802600 */
/* #define _ICAP5_BASE_ADDRESS                      0xBF802800 */
/* #define _INT_BASE_ADDRESS                        0xBF881000 */
/* #define _NVM_BASE_ADDRESS                        0xBF80F400 */
/* #define _OCMP1_BASE_ADDRESS                      0xBF803000 */
/* #define _OCMP2_BASE_ADDRESS                      0xBF803200 */
/* #define _OCMP3_BASE_ADDRESS                      0xBF803400 */
/* #define _OCMP4_BASE_ADDRESS                      0xBF803600 */
/* #define _OCMP5_BASE_ADDRESS                      0xBF803800 */
/* #define _OSC_BASE_ADDRESS                        0xBF80F000 */
/* #define _PCACHE_BASE_ADDRESS                     0xBF884000 */
/* #define _PMP_BASE_ADDRESS                        0xBF807000 */
/* #define _PORTB_BASE_ADDRESS                      0xBF886120 */
/* #define _PORTC_BASE_ADDRESS                      0xBF886220 */
/* #define _PORTD_BASE_ADDRESS                      0xBF886320 */
/* #define _PORTE_BASE_ADDRESS                      0xBF886420 */
/* #define _PORTF_BASE_ADDRESS                      0xBF886520 */
/* #define _PORTG_BASE_ADDRESS                      0xBF886660 */
/* #define _RCON_BASE_ADDRESS                       0xBF80F600 */
/* #define _RTCC_BASE_ADDRESS                       0xBF800200 */
/* #define _SPI1_BASE_ADDRESS                       0xBF805800 */
/* #define _SPI2_BASE_ADDRESS                       0xBF805A00 */
/* #define _TMR1_BASE_ADDRESS                       0xBF800600 */
/* #define _TMR2_BASE_ADDRESS                       0xBF800800 */
/* #define _TMR3_BASE_ADDRESS                       0xBF800A00 */
/* #define _TMR4_BASE_ADDRESS                       0xBF800C00 */
/* #define _TMR5_BASE_ADDRESS                       0xBF800E00 */
/* #define _UART1_BASE_ADDRESS                      0xBF806000 */
/* #define _UART2_BASE_ADDRESS                      0xBF806200 */
/* #define _UART3_BASE_ADDRESS                      0xBF806400 */
/* #define _UART4_BASE_ADDRESS                      0xBF806600 */
/* #define _USB_BASE_ADDRESS                        0xBF885040 */
/* #define _WDT_BASE_ADDRESS                        0xBF800000 */
